[
  {
    "Position": "1",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "DevOps & Developer Productivity",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon Q Developer",
    "Description": "Generative AI can help remove the heavy lifting developers experience today by writing much of the undifferentiated code, allowing them to build faster. Helping developers code faster could be one of the most powerful uses of generative AI that organizations will see in the coming years; this framework can also be applied to data science projects. Amazon Q Developer accelerates the completion of data science coding tasks with extensions for JupyterLab and Amazon SageMaker. In this workshop, learn how to build data processing pipelines and machine learning models with the help of an AI coding companion and accelerate data science experiments in Python. You must bring your laptop to participate."
  },
  {
    "Position": "2",
    "Session Type": "Workshop",
    "Topic": "DevOps & Developer Productivity",
    "Secondary Topic": "DevOps & Developer Productivity",
    "Area of Interest": "Lambda-Based Applications",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "AWS Lambda",
    "Description": "Enhance your serverless development skills in the official Powertools for AWS Lambda workshop with new features. Make an existing application more observable, resilient to retries, and capable of handling API requests efficiently all while reducing boilerplate code by half. Choose your language adventure with Python, Java, JavaScript/TypeScript, or .NET. Gain hands-on experience using Powertools as your go-to developer toolkit for serverless workloads. Learn practical techniques for building robust, observable serverless applications. You must bring your laptop to participate."
  },
  {
    "Position": "3",
    "Session Type": "Workshop",
    "Topic": "Customer Enablement",
    "Secondary Topic": "Resilience",
    "Area of Interest": "Innovation & Transformation",
    "Level": "100 – Foundational",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Description": "In today’s rapidly evolving tech landscape, navigating complex innovation and transformation initiatives can be daunting. This hands-on workshop equips you with the tools and strategies to unlock your organization’s full potential for innovation and transformation. Use the AWS Innovation Pulse Check tool, powered by generative AI, to assess capabilities and receive tailored recommendations. Explore mental models that empower informed decision-making and foster an innovation culture. Dive into interactive modules to review processes, design effective change mechanisms, and prioritize actions for exceptional customer value delivery. Walk away with a roadmap to accelerate innovation maturity and stay ahead in the tech landscape. You must bring your laptop to participate."
  },
  {
    "Position": "4",
    "Session Type": "Workshop",
    "Topic": "DevOps & Developer Productivity",
    "Secondary Topic": "DevOps & Developer Productivity",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "300 – Advanced",
    "Role": "",
    "Service": "",
    "Description": "Engineering complex industrial systems relies heavily on collaboration and use of domain-specific models such as computer-aided design (CAD), finite element model (FEM), and custom software models. Digital engineering fundamentally relies on integrating data across model structures, which leads to collaboration across geographically dispersed organizations. In this workshop, learn how to deploy a collaborative digital engineering environment on AWS using open source OpenMBEE to develop automated workflows for product development using a model-based systems engineering (MBSE) approach. You must bring your laptop to participate."
  },
  {
    "Position": "5",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "DevOps & Developer Productivity",
    "Area of Interest": "Automotive",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon Q Developer",
    "Description": "Join this workshop to learn how to increase developer efficiency and streamline software-defined vehicle function test case creation using generative AI features within the virtual engineering workbench. Discover how test and validation engineers can drastically reduce the time needed to create meaningful test cases using Amazon Bedrock. Then, explore how Amazon Q can help developers to quickly find the information they need from distributed and disparate internal knowledge management and documentation systems like Confluence, JIRA, and RTC. You must bring your laptop to participate."
  },
  {
    "Position": "6",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "Storage",
    "Area of Interest": "Generative AI",
    "Level": "400 – Expert",
    "Role": "IT Professional / Technical Manager",
    "Service": "Amazon Elastic Container Service (Amazon ECS)",
    "Description": "In this workshop, learn how AWS storage can help increase the performance of machine learning (ML) training jobs and reduce the complexity for containerized environments using Amazon EKS. Explore storage solutions for your unique requirements, from Mountpoint for Amazon S3 and the Amazon S3 Express One Zone storage class to the seamless integration of Amazon FSx for Lustre with Amazon S3, using low-latency and high-performance capabilities for ML workloads. Join this hands-on workshop to enhance your skills in storage for distributed ML training. You must bring your laptop to participate."
  },
  {
    "Position": "7",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "DevOps & Developer Productivity",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon Q Developer",
    "Description": "In this workshop, explore the transformative impact of generative AI in development. Get hands-on experience with Amazon Q Developer to learn how it can help you understand, build, and operate AWS applications. Explore the IDE to see how Amazon Q provides software development assistance, including code explanation, generation, modernization, and much more. You must bring your laptop to participate."
  },
  {
    "Position": "8",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "Compute",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon SageMaker",
    "Description": "While large language models (LLMs) have broad knowledge and versatility, tailoring these powerful models to specific domains unlocks new levels of understanding and performance, allowing them to enhance user experience in domain-focused or industry-vertical applications. In this workshop, learn how to apply post-training techniques like supervised fine-tuning and model alignment on AWS Trainium and AWS Inferentia using Amazon SageMaker and Hugging Face Optimum Neuron library. Explore how to deploy these models and evaluate the effects of these techniques with domain-specific accuracy tests. You must bring a laptop to participate."
  },
  {
    "Position": "9",
    "Session Type": "Workshop",
    "Topic": "Cloud Operations",
    "Secondary Topic": "Cost Optimization",
    "Area of Interest": "400 – Expert",
    "Level": "400 – Expert",
    "Role": "Amazon Elastic Container Service (Amazon ECS)",
    "Service": "Amazon Elastic Container Service (Amazon ECS)",
    "Description": "Due to the dynamic nature of cloud workloads and the inherent use of shared services, organizations are looking for simple ways to analyze spend and allocate their shared costs to teams and applications that utilize them. In this hands-on workshop, learn about the tools and techniques that can help you build your cost allocation strategy. Discover best practices for tagging and analyzing spend, and find out how to improve the cost visibility of your containerized Amazon ECS and Amazon EKS workloads with the split cost allocation data feature. Also, learn how to visualize your detailed cost and usage data with Amazon QuickSight dashboards. You must bring your laptop to participate."
  },
  {
    "Position": "10",
    "Session Type": "Workshop",
    "Topic": "Architecture",
    "Secondary Topic": "Disaster Response & Recovery",
    "Area of Interest": "Global Infrastructure",
    "Level": "400 – Expert",
    "Role": "Developer / Engineer",
    "Service": "Amazon Aurora",
    "Description": "Join this hands-on workshop to explore a resilient, cloud-native architecture that surpasses the stringent availability and recovery regulations for financial markets utility providers. This highly available design uses Amazon ECS, Java Spring Boot, Amazon MQ, Amazon Kinesis, Amazon DynamoDB, Amazon Aurora, Amazon Route 53 Application Recovery Controller, and AWS Systems Manager. Delve into key design decisions, including cross-Region data stores, messaging, and cross-Region state replication. Also learn about exactly-once transaction processing, reliable global traffic shifting, and best practices for fail-safe disaster recovery orchestration. You must bring your laptop to participate."
  },
  {
    "Position": "11",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "Analytics",
    "Area of Interest": "Financial Services",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon Bedrock",
    "Description": "Analyzing complex datasets can be time-consuming and resource intensive. In this workshop, learn how to move from analysis to action faster and with minimal manual effort. Build an agent-based generative AI application that quickly links multiple data sources and produces meaningful insights using agents and knowledge bases for Amazon Bedrock. Discover how to integrate these agents with services like Amazon RDS and Amazon S3 as well as online data sources to improve customer interactions, personalize product offers, and identify new opportunities. Your application will demonstrate how financial institutions can revolutionize customer service while respecting guardrails for responsible AI. You must bring your laptop to participate."
  },
  {
    "Position": "12",
    "Session Type": "Workshop",
    "Topic": "Compute",
    "Secondary Topic": "Quantum Technologies",
    "Area of Interest": "200 – Intermediate",
    "Level": "200 – Intermediate",
    "Role": "Amazon Braket",
    "Service": "Amazon Braket",
    "Description": "Amazon Braket provides access to quantum computing hardware and simulators to speed up scientific research and software development for quantum computing. Join this workshop to implement your first quantum algorithm and gain hands-on experience with running quantum circuits on gate-based devices and simulators. Review service features and examples available in the AWS quantum algorithm library. You must bring your laptop to participate."
  },
  {
    "Position": "13",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "Healthcare & Life Sciences",
    "Area of Interest": "Healthcare & Life Sciences",
    "Level": "200 – Intermediate",
    "Role": "Amazon Q",
    "Service": "Amazon Q",
    "Description": "In this workshop, learn how to use Amazon Q tools and resources to develop, test, and deploy applications while integrating them with healthcare data sources and knowledge bases. Also, explore advanced topics including scaling AI-generated applications for enterprise deployments and integrating with other AWS services and third-party healthcare solutions. You must bring your laptop to participate."
  },
  {
    "Position": "14",
    "Session Type": "Workshop",
    "Topic": "Analytics",
    "Secondary Topic": "Cross-Industry Solutions",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon Managed Blockchain (AMB)",
    "Description": "Blockchains are rich with historic data, but analyzing this data can be technically challenging. In this workshop, learn how to access Bitcoin and Ethereum wallet balances and other transaction data via Amazon Managed Blockchain (AMB) Query. Also, discover how you can use AMB Query and other services to support cross-chain applications. You must bring your laptop to participate."
  },
  {
    "Position": "15",
    "Session Type": "Workshop",
    "Topic": "Networking",
    "Secondary Topic": "Network & Infrastructure Security",
    "Area of Interest": "300 – Advanced",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon Route 53",
    "Description": "In this workshop, discover practical guidance that can help you build a secure Amazon VPC. Using a hands-on approach, review Amazon VPC features such as subnets, security groups, flow logs, and routing. Then, learn how you can add on additional layers of security and how to securely ingress and egress VPC traffic with other services, such as Amazon Route 53 Resolver DNS Firewall, AWS Network Firewall, Amazon VPC Traffic Mirroring, AWS WAF, and more. You must bring your laptop to participate."
  },
  {
    "Position": "16",
    "Session Type": "Workshop",
    "Topic": "Hybrid Cloud",
    "Secondary Topic": "Migration & Modernization",
    "Area of Interest": "Edge Computing",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon Elastic Kubernetes Service (Amazon EKS)",
    "Description": "In this workshop, explore successful design templates for architecting, designing, building, and deploying applications at the edge. Dive deep into successful workload architectures as well as business drivers and best practices for deploying edge applications with AWS services like AWS Local Zones and AWS Outposts. Discover the steps for deploying a real-time online game, private CDNs, and Amazon EKS workloads at the edge. You must bring your laptop to participate."
  },
  {
    "Position": "17",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "Open Source",
    "Area of Interest": "300 – Advanced",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "AWS Lambda",
    "Description": "In this workshop, discover how popular open source AutoML framework AutoGluon empowers developers to build ML applications with cutting-edge AutoML capabilities. Learn how AutoGluon streamlines the ML building process (from data loading and model selection to ensembling and HPO) with three lines of code, allowing developers to focus on solving ML problems rather than tinkering with models. Dive into hands-on exercises where you’ll use AutoGluon to train high-performing ML models on various use cases, including tabular, time-series, and multimodal, regardless of your expertise level. Join this workshop to unlock the full potential of AutoML and accelerate your journey toward building intelligent applications with AutoGluon. You must bring your laptop to participate."
  },
  {
    "Position": "18",
    "Session Type": "Workshop",
    "Topic": "Migration & Modernization",
    "Secondary Topic": "Modernization",
    "Area of Interest": "SAP",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon Bedrock",
    "Description": "To gain a competitive edge, SAP customers are modernizing mission-critical SAP processes with cloud services. The AWS SDK for SAP ABAP simplifies reinventing SAP-based processes using more than 200 AWS services. In this hands-on workshop, learn how to automate paper-to-post invoice management by integrating SAP with AWS services, including generative AI capabilities. Learn how automating invoice processing with Amazon Textract, Amazon Translate, Amazon Bedrock, and SAP can accelerate payment approvals, enable anomaly detection, reduce errors, save costs, and boost staff productivity. You must bring your laptop to participate."
  },
  {
    "Position": "19",
    "Session Type": "Workshop",
    "Topic": "Cloud Operations",
    "Secondary Topic": "Management & Governance",
    "Area of Interest": "300 – Advanced",
    "Level": "300 – Advanced",
    "Role": "AWS Organizations",
    "Service": "AWS Organizations",
    "Description": "In this workshop, learn how to automate patch management and compliance. See how you can quickly enable patching at scale across your AWS accounts and Regions within your AWS organization using AWS Systems Manager. Gain hands-on experience with how to use AWS Systems Manager to enable patching operations and maintain compliance. You must bring your laptop to participate."
  },
  {
    "Position": "20",
    "Session Type": "Workshop",
    "Topic": "Architecture",
    "Secondary Topic": "DevOps & Developer Productivity",
    "Area of Interest": "Independent Software Vendor (ISV)",
    "Level": "400 – Expert",
    "Role": "Developer / Engineer",
    "Service": "Amazon Elastic Kubernetes Service (Amazon EKS)",
    "Description": "The Kubernetes DevOps tool chain equips builders with a rich collection of constructs that can be used to design and implement a range of multi-tenant automation strategies. This workshop looks at how these Kubernetes tools are combined to support tenant onboarding, deployment, provisioning, configuration, and so on. The labs identify approaches for targeting and automating these unique SaaS DevOps needs. The goal is to create an end-to-end solution that uses GitOps, Argo, Helm, and other Kubernetes tools to create and configure multi-tenant Amazon EKS environments that cover a range of tiers and deployment models. You must bring your laptop to participate."
  },
  {
    "Position": "21",
    "Session Type": "Workshop",
    "Topic": "Networking",
    "Secondary Topic": "Network & Infrastructure Security",
    "Area of Interest": "Innovation & Transformation",
    "Level": "300 – Advanced",
    "Role": "AWS PrivateLink",
    "Service": "Amazon Virtual Private Cloud (Amazon VPC)",
    "Description": "As your AWS network infrastructure grows in size and complexity, not only will you need to develop and modernize your applications, you will also need to modernize and manage the infrastructure in an agile, efficient, and secure manner. During this workshop, learn about and apply NetDevOps best practices through hands-on scenario role-play at a fictitious company. Act as a new network engineer who needs to troubleshoot and fix required automations for their company. You must bring your laptop to participate."
  },
  {
    "Position": "22",
    "Session Type": "Workshop",
    "Topic": "Business Applications",
    "Secondary Topic": "Storage",
    "Area of Interest": "Application Integration",
    "Level": "300 – Advanced",
    "Role": "IT Administrator",
    "Service": "AWS B2B Data Interchange",
    "Description": "AWS B2B Data Interchange transforms EDI business-to-business (B2B) data exchanged between you and your trading partners at cloud scale. In this workshop, dive deep into how to use AWS B2B Data Interchange to automate the transformation of your EDI documents to accelerate migration of your B2B data exchange workloads. Explore practical examples of industry-standard ERP, and learn how to reduce operational complexity and optimize cost using inbound and outbound messaging. You must bring your laptop to participate."
  },
  {
    "Position": "23",
    "Session Type": "Workshop",
    "Topic": "Security, Compliance & Identity",
    "Secondary Topic": "Advertising & Marketing",
    "Area of Interest": "Advertising & Marketing",
    "Level": "400 – Expert",
    "Role": "Developer / Engineer",
    "Service": "AWS Shield",
    "Description": "In this workshop, compete in a team-based environment to practice protecting a web application in real time. Your team uses AWS WAF and AWS Shield to mitigate distributed HTTP floods, web exploits, and malicious bots that disrupt the experience of your customers. This workshop offers a risk-free environment where teamwork is paramount as you work together under pressure. Watch a real-time scoreboard as your team works through each level. The most effective team will earn a prize at the end! You must bring your laptop to participate."
  },
  {
    "Position": "24",
    "Session Type": "Workshop",
    "Topic": "Compute",
    "Secondary Topic": "Cross-Industry Solutions",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon EC2 - Graviton",
    "Description": "Ready to learn more about AWS Graviton in an immersive environment? In this team-based gamified learning setting, perform a live migration of your workload to Graviton. You learn how to unlock Graviton’s full price-performance potential and optimize the size of an Amazon EC2 fleet. You have the opportunity to identify CPU-architectural incompatibilities with the Porting Advisor for Graviton tool, test performance, adjust a continuous integration and delivery (CI/CD) pipeline to create ARM64 artifacts, and explore popular Graviton use cases. You must bring your laptop to participate."
  },
  {
    "Position": "25",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "Security, Compliance & Identity",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon Q",
    "Description": "Join this workshop to get a better understanding of how to provide your developers access to generative AI applications, including Amazon Q. Learn how to connect your corporate identities to AWS and how to use your corporate login to manage access to generative AI applications. Be guided through managing session duration and security to simplify your users’ experience. You must bring your laptop to participate."
  },
  {
    "Position": "26",
    "Session Type": "Workshop",
    "Topic": "Migration & Modernization",
    "Secondary Topic": "Modernization",
    "Area of Interest": "300 – Advanced",
    "Level": "300 – Advanced",
    "Role": "AWS Mainframe Modernization",
    "Service": "AWS Mainframe Modernization",
    "Description": "In this workshop, learn about select AWS Mainframe Modernization accelerators, such as Application Testing, data replication, File Transfer, DevOps CI/CD, and managed services, that speed your time to value and deliver cost savings, agility, resilience, and innovation. Gain hands-on experience with some of the accelerators, and learn how they could complement refactor, replatform, reimagine, or augment patterns. Finally, discover how you can accelerate the modernization pace wherever you may be in your mainframe application modernization journey. You must bring your laptop to participate."
  },
  {
    "Position": "27",
    "Session Type": "Workshop",
    "Topic": "Customer Enablement",
    "Secondary Topic": "New to AWS",
    "Area of Interest": "AWS Marketplace",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "AWS Marketplace",
    "Description": "AWS Marketplace makes it easy to find, subscribe, deploy, and manage third-party software, data, and services. In this workshop, choose between hands-on labs for buyers just starting to learn about AWS Marketplace or labs for experienced buyers looking to expand their knowledge. New buyers can explore how to buy and deploy different types of third-party products in AWS Marketplace. Experienced buyers can learn to govern purchases by setting up a private marketplace of approved products, sharing licenses, analyzing spend, and allocating costs. This session requires an active AWS account with admin rights. You must bring your laptop to participate."
  },
  {
    "Position": "28",
    "Session Type": "Workshop",
    "Topic": "Cloud Operations",
    "Secondary Topic": "Migration & Modernization",
    "Area of Interest": "AWS Marketplace",
    "Level": "300 – Advanced",
    "Role": "",
    "Service": "",
    "Description": "In this workshop, choose between hands-on labs for new sellers just starting or labs for experienced sellers looking to optimize their operations in AWS Marketplace. Sellers just starting out can explore publishing virtual machine, container, or SaaS-based products. Established sellers can learn about API-enabled automations for their delivery pipelines, private offers, and other integrations with AWS Marketplace. The part of the workshop intended for established sellers requires a registered seller account with an existing published product. For new or interested sellers, an active AWS account is required. This workshop is intended for AWS Partners. You must bring your laptop to participate."
  },
  {
    "Position": "29",
    "Session Type": "Workshop",
    "Topic": "Architecture",
    "Secondary Topic": "Cloud Operations",
    "Area of Interest": "Well-Architected Framework",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "AWS Billing and Cost Management",
    "Description": "Does your infrastructure’s cost reflect best practices and recommended patterns? Are you using AWS services optimally while implementing robust, cost-optimized foundations? This workshop is designed to help you drive architectural improvements through cost observation. It explores how to uncover suboptimal architecture patterns, hidden failures, and noncompliant deployments by using costs to establish and visualize good baselines for foundational services and workload architectures. It demonstrates how to combine cost categories and usage data with design requirements, application profiles, and best practices to generate flexible visualizations and KPIs that empower the frugal architect. Join this workshop to gain expertise in creating a cost-effective architecture. You must bring your laptop to participate."
  },
  {
    "Position": "30",
    "Session Type": "Workshop",
    "Topic": "Migration & Modernization",
    "Secondary Topic": "Generative AI",
    "Area of Interest": "Monitoring & Observability",
    "Level": "300 – Advanced",
    "Role": "Solution / Systems Architect",
    "Service": "Amazon Q in QuickSight",
    "Description": "In this workshop, learn how SAP customers are maximizing the scalability, reliability, security, sustainability, and performance of AWS. Explore architecture best practices developed by AWS while helping thousands of SAP customers run their mission-critical applications in the cloud. Gain hands-on experience setting up an automated health check solution that scans SAP on AWS environments and compares results against more than 100 architecture best practices. Then, use generative AI from Amazon Q in QuickSight to analyze the results and uncover opportunities for optimization. You must bring your laptop to participate."
  },
  {
    "Position": "31",
    "Session Type": "Workshop",
    "Topic": "Compute",
    "Secondary Topic": "Storage",
    "Area of Interest": "Modernization",
    "Level": "300 – Advanced",
    "Role": "IT Administrator",
    "Service": "Amazon Elastic Block Store (Amazon EBS)",
    "Description": "Millions of customers deploy performance-intensive enterprise applications and databases on AWS. In this workshop, explore the detailed process of deploying a high-performance application on Amazon EC2 and Amazon EBS for optimized availability, resiliency, and cost performance. Discover how to select the ideal Amazon EC2 instance types and Amazon EBS volume types for various workloads. Learn about on-demand storage flexibility and performance using Elastic Volumes. Monitor and improve operational performance and resource optimization of Amazon EBS using Amazon CloudWatch metrics. Build resilience and fault tolerance using AWS Fault Injection Service. You must bring your laptop to participate."
  },
  {
    "Position": "32",
    "Session Type": "Workshop",
    "Topic": "Compute",
    "Secondary Topic": "Kubernetes",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon Elastic Kubernetes Service (Amazon EKS)",
    "Description": "Bootstrapping and operating Kubernetes environments can be complex, from selecting the right open source tools to implementing multi-tenancy and security controls. In this hands-on workshop, learn how to use Amazon EKS Blueprints for CDK, a collection of infrastructure-as-code modules, to rapidly provision and configure an Amazon EKS cluster for a microservices application. Discover how Amazon Q can assist you in writing and modifying the AWS CDK code to streamline infrastructure provisioning. Learn how to deploy and configure a ready-to-use Amazon EKS cluster using continuous deployment automation, allowing you to scale the provisioning and maintenance of Amazon EKS clusters across your organization efficiently. You must bring your laptop to participate."
  },
  {
    "Position": "33",
    "Session Type": "Workshop",
    "Topic": "Storage",
    "Secondary Topic": "Migration & Modernization",
    "Area of Interest": "Modernization",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "AWS Lake Formation",
    "Description": "Discover how data mesh architectures revolutionize product offerings across organizations, from small businesses to global enterprises, while centralizing security, governance, auditing, and data discovery. In this workshop, discover how AWS Transfer Family can automate the data processing pipeline for third-party data, validate the integrity of files transferred, apply PGP encryption and decryption and anti-malware scans, and enrich and load the data into a secure data mesh integrated with AWS Lake Formation. Learn how, once it’s there, users can securely access data based on their roles to search, query, and perform analytics. You must bring your laptop to participate."
  },
  {
    "Position": "34",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "Databases",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon Bedrock",
    "Description": "In this workshop, build an application to query your domain-specific, differentiated, and highly related datasets using natural language. Amazon Neptune is your database of record storing a knowledge graph with the most up-to-date version of your data and helps the LLM at the center of your application improve the quality of the answers provided. Discover how to use multimodal inputs, such as text, images, or both, for a Retrieval Augmented Generation (RAG) process that uses vector search over your knowledge graph data. You must bring a laptop to participate."
  },
  {
    "Position": "35",
    "Session Type": "Workshop",
    "Topic": "Business Applications",
    "Secondary Topic": "Internet of Things",
    "Area of Interest": "Manufacturing & Industrial",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon Bedrock",
    "Description": "In this workshop, construct a generative AI–powered assistant that enhances operational efficiency and reduces machine downtime in industrial settings. While harnessing the power of large language models from Amazon Bedrock, learn how to integrate AWS IoT SiteWise and an enterprise knowledge graph, and find out how to connect knowledge bases, configure agents, and establish robust guardrails. When finished, see your generative AI assistant in action in a simulated factory environment and the impact it makes to deliver contextualized insights and actionable recommendations to plant operators. You must bring your laptop to participate."
  },
  {
    "Position": "36",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "Cross-Industry Solutions",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon Bedrock",
    "Description": "In this immersive workshop, learn how to build scalable and intelligent agentic workflows using Amazon Bedrock, LangChain, and LangGraph. Through hands-on coding, use Amazon Bedrock capabilities with LangChain to process and generate text, images, and data, enabling autonomous agents that understand natural language instructions. Then, discover how to use the Amazon Bedrock Converse API to build conversational AI agents for streamlined customer service. Finally, integrate Amazon Bedrock with LangGraph to create multistep, AI-powered workflows that adapt to business requirements by connecting conversational agents and data processing capabilities developed throughout the workshop. You must bring your laptop to participate."
  },
  {
    "Position": "37",
    "Session Type": "Workshop",
    "Topic": "Analytics",
    "Secondary Topic": "Security, Compliance & Identity",
    "Area of Interest": "Data Protection",
    "Level": "300 – Advanced",
    "Role": "",
    "Service": "",
    "Description": "A data mesh is a distributed, domain-driven architecture that defines responsibilities and coordination across separate domain teams and data products. A data mesh requires data governance to ensure data quality, consistency, security, and trust across domains. In this workshop, learn how to build with Amazon DataZone to help manage and govern your data mesh. Explore automating data discovery, cataloging, and sharing; analyzing data quality; visualizing data lineage; and governing data access to meet objectives. Through hands-on exercises, gain practical experience designing, deploying, and maintaining a well-governed data mesh solution using Amazon DataZone. You must bring your laptop to participate."
  },
  {
    "Position": "38",
    "Session Type": "Workshop",
    "Topic": "Architecture",
    "Secondary Topic": "Serverless Compute & Containers",
    "Area of Interest": "Games",
    "Level": "300 – Advanced",
    "Role": "Amazon GameLift",
    "Service": "Amazon Cognito",
    "Description": "In this workshop, learn how to use the AWS Game Backend Framework to develop a custom cross-platform game backend for your multiplayer game. Explore cross-platform player identity, backend microservices for matchmaking, and integrations to popular game engines. Also learn how to use Amazon GameLift to host your game servers globally, close to players for a low-latency real-time experience. You must bring your laptop to participate."
  },
  {
    "Position": "39",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "Cross-Industry Solutions",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon SageMaker",
    "Description": "In this workshop, get hands-on experience building an Automated Video Highlight Reel Generator using Amazon SageMaker’s comprehensive tools. Learn to search for and select the right multi-modal LLM for video use cases. Interactively build a multi-modal image/video analysis engine that automatically highlights the most exciting parts of any video using Amazon SageMaker Studio notebooks. Perfect your highlight reel generation system by fine-tuning your multi-modal LLM with custom text-image/video pairs using SageMaker training jobs. Finally, deploy your fine-tuned model as a SageMaker-hosted endpoint. Also learn to deploy a low-latency, production-ready Streamlit app UI on AWS. You must bring your laptop to participate."
  },
  {
    "Position": "40",
    "Session Type": "Workshop",
    "Topic": "Analytics",
    "Secondary Topic": "Databases",
    "Area of Interest": "Innovation on AWS",
    "Level": "400 – Expert",
    "Role": "Developer / Engineer",
    "Service": "Amazon Aurora",
    "Description": "In this workshop, learn to build modern web applications at scale using purpose-built databases. Discover how to apply development patterns using Amazon Aurora, Amazon DynamoDB, Amazon ElastiCache, Amazon Neptune, and Amazon OpenSearch Service to build a fully functional and scalable bookstore ecommerce application, and dive deep into best practices along the way. Basic familiarity with AWS concepts and services such as AWS Identity and Access Management (IAM), Amazon VPC, networking, and storage services is recommended. You must bring your laptop to participate."
  },
  {
    "Position": "41",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "Storage",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon FSx for Lustre",
    "Description": "High-performance storage is essential for efficient and cost-effective machine learning (ML) and large language model (LLM) training for generative AI. Managing intensive GPUs and accelerators like AWS Trainium requires optimized storage solutions. Amazon S3 and Amazon FSx for Lustre offer scalability and compute acceleration for workloads, from time to first byte to multi-petabyte scales. In this workshop, learn how to use Amazon S3 and FSx for Lustre with Amazon SageMaker and monitor them using Amazon CloudWatch, and discover how to achieve the best performance for your workload. You must bring your laptop to participate."
  },
  {
    "Position": "42",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "DevOps & Developer Productivity",
    "Area of Interest": "Software and Internet",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "AWS Amplify",
    "Description": "Learn how to create applications that use real-time data and generative AI to improve user engagement. In this workshop, build a multiplayer trivia application with scoring, leaderboards, and game state updates. Use AWS Amplify to connect an application frontend to a serverless backend built with an AWS AppSync GraphQL API. You must bring your laptop to participate."
  },
  {
    "Position": "43",
    "Session Type": "Workshop",
    "Topic": "Migration & Modernization",
    "Secondary Topic": "Manufacturing & Industrial",
    "Area of Interest": "Manufacturing & Industrial",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon Bedrock",
    "Description": "SAP customers must take full advantage of their enterprise data to stay ahead. In this hands-on workshop, use SAP, generative AI, and both structured and unstructured data to optimize multiple manufacturing processes. Build a secure generative AI assistant to engage with SAP supply chain data using a conversational interface to identify top-performing suppliers, dependencies, and risk factors. Next, employ a generative AI agent to promptly address machinery issues on the shop floor leveraging unstructured data to advise users on immediate solutions and triggering processes in SAP to deploy additional resources when necessary. You must bring your laptop to participate."
  },
  {
    "Position": "44",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "Databases",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon Aurora",
    "Description": "The integration of embeddings generated from LLMs for Amazon Aurora PostgreSQL-Compatible Edition and Amazon RDS for PostgreSQL presents a powerful and efficient solution for optimizing the product catalog similarity search experience. By using foundation models and vector embeddings, businesses can enhance the accuracy and speed of similarity searches by using Retrieval Augmented Generation (RAG), which ultimately leads to improved user satisfaction and a more personalized experience. In this workshop, build your own generative AI applications with Amazon Bedrock using Aurora PostgreSQL as your vector database. You must bring your laptop to participate."
  },
  {
    "Position": "45",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "Analytics",
    "Area of Interest": "Manufacturing & Industrial",
    "Level": "300 – Advanced",
    "Role": "Data Scientist",
    "Service": "Amazon Bedrock",
    "Description": "Manufacturers have vast amounts of knowledge dispersed across the product lifecycle, often resulting in limited visibility, significant knowledge gaps, and the inability to continuously improve. A digital thread offers an integrated approach to combine disparate data sources across enterprise systems to drive traceability, accessibility, collaboration, and agility. In this workshop, learn how to create an intelligent manufacturing digital thread using a combination of knowledge graph and generative AI technologies based on the data generated throughout the product lifecycle. Explore several use cases and discover actionable steps to kick-start your intelligent digital thread journey. You must bring your laptop to participate."
  },
  {
    "Position": "46",
    "Session Type": "Workshop",
    "Topic": "DevOps & Developer Productivity",
    "Secondary Topic": "DevOps & Developer Productivity",
    "Area of Interest": "Event-Driven Architecture",
    "Level": "200 – Intermediate",
    "Role": "Developer / Engineer",
    "Service": "Amazon API Gateway",
    "Description": "In this workshop, learn how to build a complete serverless web application for a popular theme park called Innovator Island. The theme park is rolling out a mobile app that provides thousands of visitors with wait times, photo opportunities, notification alerts, and language translation. Get hands-on experience building a scalable serverless application with a single-page application frontend that delivers a feature-rich user experience. You must bring your laptop to participate."
  },
  {
    "Position": "47",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "Internet of Things",
    "Area of Interest": "Aerospace & Satellite",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon API Gateway",
    "Description": "Learn how to build and deploy an AI assistant that seamlessly integrates with AWS services, enabling interaction with your industrial data in real time. Imagine an assistant that can answer questions like “What is the OEE for this line?” or compose maintenance requests. This workshop walks through the process of deploying an API to interface with industrial IoT services and creating a custom plugin in Amazon Q Business. Coding experience isn’t required, but some API design and industrial automation knowledge is helpful. Leave this workshop with a functional AI assistant that can be tailored to your factory’s needs. You must bring your laptop to participate."
  },
  {
    "Position": "48",
    "Session Type": "Workshop",
    "Topic": "Databases",
    "Secondary Topic": "Open Source",
    "Area of Interest": "300 – Advanced",
    "Level": "300 – Advanced",
    "Role": "",
    "Service": "",
    "Description": "In today’s data-driven world, organizations are grappling with the challenge of providing consistent and trusted insights across multiple data consumers, including BI tools, embedded analytics, and AI agents. Enter Cube.js, an open source project that helps you build a universal semantic layer, bridging the gap between your data sources and data consumers. In this hands-on workshop, learn how to use Cube.js to create a unified data model that can be consumed by various applications, ensuring data consistency and governance. Explore how to connect to different data sources on AWS and define metrics and dimensions using Cube.js’s developer-friendly approach. You must bring your laptop to participate."
  },
  {
    "Position": "49",
    "Session Type": "Workshop",
    "Topic": "Serverless Compute & Containers",
    "Secondary Topic": "Cross-Industry Solutions",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "200 – Intermediate",
    "Role": "Developer / Engineer",
    "Service": "Amazon EventBridge",
    "Description": "Many organizations choose to build event-driven application architectures in which subscribers or target services automatically perform in response to events triggered by publisher or source services. This pattern can help development teams operate more independently to release new features faster and make their applications more scalable. In this workshop, learn about the basics of event-driven design using examples involving Amazon SNS, Amazon SQS, AWS Lambda, Amazon EventBridge, and more. Find out how to choose the right AWS service for the job and how you can optimize cost and performance. You must bring your laptop to participate."
  },
  {
    "Position": "50",
    "Session Type": "Workshop",
    "Topic": "DevOps & Developer Productivity",
    "Secondary Topic": "DevOps & Developer Productivity",
    "Area of Interest": "Software and Internet",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "AWS AppSync",
    "Description": "In this workshop, discover the functionality of AWS AppSync, a fully managed service that makes it easy to develop GraphQL APIs. Learn how AWS AppSync handles the heavy lifting of securely connecting to data sources like Amazon DynamoDB, Amazon Bedrock, AWS Lambda, and more. You must bring your laptop to participate."
  },
  {
    "Position": "51",
    "Session Type": "Workshop",
    "Topic": "Architecture",
    "Secondary Topic": "Global Infrastructure",
    "Area of Interest": "Resilience",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon Route 53 Application Recovery Controller",
    "Description": "In this workshop, get hands-on experience building, operating, and testing a resilient Multi-AZ application. Use Amazon CloudWatch dashboards, insights rules, and composite alarms to observe the health of your application. Then, inject randomized faults using AWS Fault Injection Service to simulate a variety of Single-AZ impairments. Also, learn how to use AWS CodeDeploy to perform zonal deployments and experience deployment failures. Finally, use Amazon Route 53 zonal shift to recover from these failures and protect your customer experience. You must bring your laptop to participate."
  },
  {
    "Position": "52",
    "Session Type": "Workshop",
    "Topic": "Architecture",
    "Secondary Topic": "Cloud Operations",
    "Area of Interest": "Generative AI",
    "Level": "400 – Expert",
    "Role": "DevOps Engineer",
    "Service": "Amazon Bedrock",
    "Description": "Building operational resilience requires proactive identification and mitigation of risks. In this workshop, use AWS managed generative AI services in real-world scenarios to learn how to assess readiness, proactively improve your architecture, react quickly to events, troubleshoot issues, and implement effective observability practices. Also use AWS Countdown and the AWS Well-Architected Framework as the entry point reference frameworks to leverage generative AI services for operation. Through hands-on activities, learn strategies for debugging issues, detecting anomalies and incidents, and optimizing architectures to improve the resilience of your workloads. You must bring your laptop to participate."
  },
  {
    "Position": "53",
    "Session Type": "Workshop",
    "Topic": "Cloud Operations",
    "Secondary Topic": "Resilience",
    "Area of Interest": "300 – Advanced",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon CloudWatch",
    "Description": "As cloud-based applications become increasingly complex and dynamic, ensuring resilience and reliability is a critical concern for organizations. In this workshop, explore how to use AWS services, including AWS Resilience Hub, Amazon CloudWatch, and AWS Fault Injection Service, to build resilient and reliable cloud-based applications. Learn how to implement observability strategies that enable proactive monitoring, rapid incident response, and continuous improvement. You must bring your laptop to participate."
  },
  {
    "Position": "54",
    "Session Type": "Workshop",
    "Topic": "Architecture",
    "Secondary Topic": "DevOps & Developer Productivity",
    "Area of Interest": "Healthcare & Life Sciences",
    "Level": "200 – Intermediate",
    "Role": "Developer / Engineer",
    "Service": "Amazon SageMaker",
    "Description": "Learn how to accelerate scientific discovery by building, orchestrating, and visualizing computer-aided drug discovery workflows using AWS HealthOmics, state-of-the-art biological foundation models, and Jupyter. In this workshop, build multiple drug discovery workflows using Amazon SageMaker, NVIDIA BioNeMo, and HealthOmics, and then scale them to process thousands of predictions simultaneously. You must bring your laptop to participate."
  },
  {
    "Position": "55",
    "Session Type": "Workshop",
    "Topic": "DevOps & Developer Productivity",
    "Secondary Topic": "DevOps & Developer Productivity",
    "Area of Interest": "Application Security",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon GuardDuty",
    "Description": "In this hands-on workshop, learn techniques to secure a serverless application built with AWS Lambda, Amazon API Gateway, and Amazon Aurora. Discover AWS services and features that you can use to improve the security of a serverless application in five domains: identity and access management, infrastructure, data, code, and logging and monitoring. Finally, explore new features including integrations with Amazon Inspector and Amazon GuardDuty. You must bring your laptop to participate."
  },
  {
    "Position": "56",
    "Session Type": "Workshop",
    "Topic": "Serverless Compute & Containers",
    "Secondary Topic": "Application Integration",
    "Area of Interest": "Event-Driven Architecture",
    "Level": "400 – Expert",
    "Role": "Developer / Engineer",
    "Service": "AWS Lambda",
    "Description": "Enterprises today face an ever-increasing need to process large-scale data to meet their business goals and unlock new value. Distributed data processing offers a cost-efficient way to speed up processing, but it also presents challenges for developers in managing the parallelism within serverful environments. In this workshop, learn how serverless technologies like AWS Step Functions and AWS Lambda can help you simplify management and scaling, offload undifferentiated tasks, and address the challenges of distributed data processing. Also, discover use cases, best practices, and resources that can help you accelerate your data processing journey. You must bring your laptop to participate."
  },
  {
    "Position": "57",
    "Session Type": "Workshop",
    "Topic": "Analytics",
    "Secondary Topic": "Architecture",
    "Area of Interest": "Modernization",
    "Level": "400 – Expert",
    "Role": "",
    "Service": "",
    "Description": "In this hands-on workshop, learn how to build a reliable and scalable streaming ingestion pipeline into Apache Iceberg–based data lakes on AWS to build a highly available, real-time data platform that can adapt to evolving data requirements. Through a series of guided exercises, learn how to use AWS streaming services to ingest data into Iceberg tables on Amazon S3 and use Amazon EMR to process the data. Implement Iceberg’s key capabilities, including atomic writes, schema evolution, and error handling for metadata management, to gracefully handle schema changes and data errors. You must bring your laptop to participate."
  },
  {
    "Position": "58",
    "Session Type": "Workshop",
    "Topic": "Security, Compliance & Identity",
    "Secondary Topic": "Storage",
    "Area of Interest": "Application Security",
    "Level": "300 – Advanced",
    "Role": "Cloud Security Specialist",
    "Service": "Amazon Elastic Block Store (Amazon EBS)",
    "Description": "Data protection and reducing long-term data retention costs are top priorities for most organizations. Join this workshop to learn how to protect Amazon EBS volumes with EBS snapshots. Walk through examples of scripting data protection workflows to achieve faster backup at lower costs using EBS direct APIs. Explore the EBS Snapshots Archive tier, which can save you up to 75% in snapshot storage costs. Learn ways to protect and optimize your EBS resources, including encryption best practices, access and data security management, and strategies for optimal cost savings. You must bring your laptop to participate."
  },
  {
    "Position": "59",
    "Session Type": "Workshop",
    "Topic": "Architecture",
    "Secondary Topic": "Storage",
    "Area of Interest": "Data Protection",
    "Level": "400 – Expert",
    "Role": "Developer / Engineer",
    "Service": "AWS Backup",
    "Description": "Ransomware and malware continue to disrupt business applications. This expert-level workshop applies AWS Backup locking mechanisms, logically air-gapped vaults, and restore testing to help strengthen cyber recovery posture. Explore configuring air-gapped, immutable vaults and automating recovery point testing to meet objectives. See how you can combine these features to build a comprehensive, recovery-focused data protection strategy that can help withstand evolving cyber threats. Through hands-on exercises, gain practical experience designing, deploying, and maintaining a resilient backup and recovery solution using AWS Backup. You must bring your laptop to participate."
  },
  {
    "Position": "60",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "Cross-Industry Solutions",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon Bedrock",
    "Description": "In this workshop, dive into building responsible generative AI applications using Guardrails for Amazon Bedrock. Develop a generative AI application from scratch, test its behavior, and discuss the potential risks and challenges associated with uncontrolled language models. Use guardrails to filter undesirable topics, block harmful content, avoid prompt injection attacks, and handle sensitive information such as PII. Learn how to detect and avoid hallucinations in model responses that are not grounded in your data. See how you can create and apply custom tailored guardrails directly with FMs and fine-tuned FMs on Amazon Bedrock to implement responsible AI policies within your generative AI applications. You must bring your laptop to participate."
  },
  {
    "Position": "61",
    "Session Type": "Workshop",
    "Topic": "Compute",
    "Secondary Topic": "Automotive",
    "Area of Interest": "Automotive",
    "Level": "300 – Advanced",
    "Role": "AWS Batch",
    "Service": "AWS Batch",
    "Description": "It can be complex, time-consuming, and error-prone to run autonomous vehicle and advanced driver assistance system (AV/ADAS) simulations using a single container due to the diversity of simulation components (simulation environment, test scenarios, software under test). In this hands-on workshop, learn how to use AWS Batch to run your AV/ADAS simulations as logical independent containers, in parallel, at scale. Build a CARLA simulation in an Amazon ECS/Amazon EC2 compute environment using separate containers for the simulation and autonomy stacks. Run multiple scenarios, upload the results to Amazon S3, and view them in a dashboard. You must bring your laptop to participate."
  },
  {
    "Position": "62",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "DevOps & Developer Productivity",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon CodeCatalyst",
    "Description": "In this workshop, learn about creating continuous integration and continuous delivery (CI/CD) pipelines using Amazon CodeCatalyst. CodeCatalyst is a unified software development service on AWS that brings together everything teams need to plan, code, build, test, and deploy applications with continuous CI/CD tools. Explore how to utilize AWS services and integrate AWS resources into your projects by connecting your AWS accounts. With all of the stages of an application’s lifecycle in one tool, you can deliver quality software quickly and confidently. You must bring your laptop to participate."
  },
  {
    "Position": "63",
    "Session Type": "Workshop",
    "Topic": "New to AWS",
    "Secondary Topic": "DevOps & Developer Productivity",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "AWS Amplify",
    "Description": "Next.js continues to gain momentum as the preferred server-side rendering (SSR) React framework for frontend and full-stack web developers. Join this workshop to learn how to develop and deploy a Next.js application with the new AWS Amplify Gen 2 developer experience. You must bring your laptop to participate."
  },
  {
    "Position": "64",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "Cross-Industry Solutions",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon SageMaker",
    "Description": "Building machine learning (ML) models involves complex and time-consuming tasks from data preparation to model deployment. Amazon SageMaker Canvas makes it easy to build ML workflows using ready-to-use foundation models (FMs) from Amazon Bedrock or Amazon SageMaker JumpStart, or by building highly accurate custom ML models without writing a single line of code. In this workshop, learn to use the latest FMs and build custom ML models through hands-on exercises. You must bring your laptop to participate."
  },
  {
    "Position": "65",
    "Session Type": "Workshop",
    "Topic": "Security, Compliance & Identity",
    "Secondary Topic": "Storage",
    "Area of Interest": "Application Security",
    "Level": "300 – Advanced",
    "Role": "Cloud Security Specialist",
    "Service": "Amazon Elastic Compute Cloud (Amazon EC2)",
    "Description": "Amazon S3 provides security settings and granular access controls to suit virtually any workload. In this workshop, learn how you can manage access and define user and resource-based policies at scale to fit your needs with Amazon S3 access management tools. In addition, learn how you can monitor and audit who is accessing what data, including from where and when. Explore scenarios involving different security requirements, and walk through how you can apply different Amazon S3 tools and capabilities to meet those requirements. You must bring your laptop to participate."
  },
  {
    "Position": "66",
    "Session Type": "Workshop",
    "Topic": "Cloud Operations",
    "Secondary Topic": "Migration & Modernization",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "DevOps Engineer",
    "Service": "Amazon CloudWatch",
    "Description": "Optimize cost and sustainability of AWS workloads with the help of generative AI. In this workshop, explore how to use AWS services that are designed to optimize your infrastructure and workloads. Through real-world scenarios, learn best practices for cost and sustainability optimization. Discover how to empower application owners with clear, actionable tasks enabled by detection mechanisms for identifying anomalies and inefficiencies. Implement strategies with data from multiple AWS services, gaining practical experience in driving cost efficiencies while aligning with sustainability goals. You must bring your laptop to participate."
  },
  {
    "Position": "67",
    "Session Type": "Workshop",
    "Topic": "Databases",
    "Secondary Topic": "Migration & Modernization",
    "Area of Interest": "Modernization",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon Aurora",
    "Description": "In this workshop, learn how you can easily and securely migrate and continuously replicate a database to AWS. Using the managed features of AWS Database Migration Service (AWS DMS), walk through the end-to-end migration steps to modernize a self-managed database using an AWS managed database engine like Amazon Aurora or Amazon RDS. Learn how to convert schemas and database code and then migrate and replicate data with AWS DMS on an ongoing basis to enable integrations with Amazon Kinesis, Amazon S3, and more. You must bring your laptop to participate."
  },
  {
    "Position": "68",
    "Session Type": "Workshop",
    "Topic": "Compute",
    "Secondary Topic": "Internet of Things",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "300 – Advanced",
    "Role": "DevOps Engineer",
    "Service": "Amazon Elastic Compute Cloud (Amazon EC2)",
    "Description": "Join spatial computing specialists as they show you how to build a digital twin in this interactive workshop using NVIDIA Omniverse. Using provided photos, videos, and LiDAR sources, you build a real-time 3D replica of a bike factory demo and compare your digital twin to the physical demo on the Expo floor. You must bring your laptop to participate."
  },
  {
    "Position": "69",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "Hybrid Cloud",
    "Area of Interest": "Energy & Utilities",
    "Level": "300 – Advanced",
    "Role": "Generative AI",
    "Service": "Amazon Elastic Compute Cloud (Amazon EC2)",
    "Description": "In the fast-paced industrial automation world, leveraging machine learning (ML) and foundation models (FMs) makes a significant difference in detecting anomalies, forecasting trends, and ensuring smooth operations. Running these models at the edge facilitates local data processing, low latency, and resilience against connectivity issues, enabling seamless operations in distributed environments. In this immersive workshop, gain hands-on experience deploying pre-trained ML models and fine-tuned small large language models (LLMs) on AWS Outposts servers at edge locations. Discover how these models can identify anomalies, forecast trends, and provide real-time assistance, supporting data-driven decisions and smoothing operations. You must bring your laptop to participate."
  },
  {
    "Position": "70",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "Databases",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "Amazon Q Business",
    "Service": "Amazon Q Business",
    "Description": "Successful generative AI projects are built on solid data foundations that include data quality, data privacy, and data governance tools and techniques. Join this workshop to get hands-on experience building a chatbot for a regulated scenario, such as health care and life sciences. Gain insights on data enrichment and cataloging tools, and expose your chatbot to customer interaction with Amazon Q for Business. You must bring your laptop to participate. This workshop is intended for AWS Partners."
  },
  {
    "Position": "71",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "Compute",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "400 – Expert",
    "Role": "Developer / Engineer",
    "Service": "Amazon Elastic Compute Cloud (Amazon EC2)",
    "Description": "LLMs need to be supplied with additional context for organization-specific data to yield a better experience for customers across customer support, analytics, research, and other sensitive use cases. However, highly sensitive data used to achieve this fine-tuning has to be safeguarded from associated threat vectors. In this workshop, learn how AWS Nitro Enclaves can be used in existing LLM-based applications to protect sensitive data and models while they are being used in RAG, prompt modeling, and various other steps. You must bring your laptop to participate."
  },
  {
    "Position": "72",
    "Session Type": "Workshop",
    "Topic": "Databases",
    "Secondary Topic": "Security, Compliance & Identity",
    "Area of Interest": "Data Protection",
    "Level": "200 – Intermediate",
    "Role": "Developer / Engineer",
    "Service": "AWS Audit Manager",
    "Description": "Join this workshop to learn how to simplify selecting the right tools to mitigate your data protection risks while reducing costs. Follow the data protection lifecycle by conducting a risk assessment, selecting the effective controls to mitigate those risks, deploying and configuring AWS services to implement those controls, and performing continuous monitoring for audits. Leave knowing how to apply the right controls to mitigate your business risk using AWS advanced services for encryption, permissions, and multi-party processing. You must bring your laptop to participate."
  },
  {
    "Position": "73",
    "Session Type": "Workshop",
    "Topic": "Cloud Operations",
    "Secondary Topic": "Resilience",
    "Area of Interest": "Threat Detection & Incident Response",
    "Level": "200 – Intermediate",
    "Role": "System Administrator",
    "Service": "AWS Elastic Disaster Recovery",
    "Description": "AWS provides resiliency and incident response capabilities to help organizations react to developing events in a timely manner. In this workshop, participate in an interactive tabletop exercise covering several disaster scenarios. Through engaging role-play, take on one of several incident response personas, strategizing and working as a team to defend an organization from a variety of threats and dilemmas. Learn how AWS services (AWS Resilience Hub, AWS Elastic Disaster Recovery, AWS Fault Injection Service, and more), features, and programs can help you be better prepared for the unexpected. You must bring your laptop to participate."
  },
  {
    "Position": "74",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "New to AWS",
    "Area of Interest": "Generative AI",
    "Level": "100 – Foundational",
    "Role": "Business Executive",
    "Service": "IT Professional / Technical Manager",
    "Description": "This collaborative workshop is for business and technical leaders who want to understand and experience Amazon’s customer-centric approach to innovation. The content is inspired by Amazon’s Working Backwards process—the same innovation mechanism used to develop products and services such as AWS, Amazon Prime, Amazon Kindle, Amazon Echo, Amazon Alexa, and Amazon Go. The workshop features activities that demonstrate the power of generative AI in the context of product innovation. You must bring your laptop to participate."
  },
  {
    "Position": "75",
    "Session Type": "Workshop",
    "Topic": "Serverless Compute & Containers",
    "Secondary Topic": "Modernization",
    "Area of Interest": "Monitoring & Observability",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon Elastic Container Service (Amazon ECS)",
    "Description": "When running containerized applications on Amazon ECS, operations teams need to ensure that new software releases are rolled out safely with the ability to try out new releases and to quickly restore a service to a last known stable state. Join this workshop to gain hands-on experience with Amazon ECS deployment strategies. Dive deep into the different approaches, and learn how they can be automated as part of a CI/CD pipeline. You must bring your laptop to participate."
  },
  {
    "Position": "76",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "Compute",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "AWS Inferentia",
    "Description": "Large language models (LLMs) show remarkable impact in a wide range of applications, but they pose significant cost and deployment challenges at scale. In this workshop, explore best practices for efficient LLM deployment using AWS Inferentia2-based Amazon EC2 Inf2 instances to maximize performance and lower costs. Learn review techniques like continuous batching, paged attention, flash attention, and others, and walk through serving libraries such as Hugging Face TGI and vLLM. You must bring your laptop to participate."
  },
  {
    "Position": "77",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "Cross-Industry Solutions",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "100 – Foundational",
    "Role": "Developer / Engineer",
    "Service": "Amazon Bedrock",
    "Description": "Building on AWS DeepRacer foundations, learn fine-tuning and pre-training techniques that use AWS managed services like Amazon SageMaker Jumpstart and Amazon Bedrock. Discover how smaller, fine-tuned large language models (LLMs) can outperform bigger models in solving diverse tasks. Develop crucial fit-for-purpose AI-customization skills that are essential to prepare you for an AI-driven future of work and innovation. Explore dataset preparation, model tuning, hyperparameter optimization, and evaluation. Fostering team-building and democratizing machine learning, this workshop is designed for both technical and nontechnical audiences and is accessible to anyone who wants to improve their generative AI skills. You must bring your laptop to participate."
  },
  {
    "Position": "78",
    "Session Type": "Workshop",
    "Topic": "Cloud Operations",
    "Secondary Topic": "Security, Compliance & Identity",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "",
    "Service": "",
    "Description": "In this workshop, participate in an interactive tabletop exercise covering threat vectors like exposed AWS access keys, insecure security group ports, and unauthorized resource launches. Through engaging role-play, take on an incident response persona, strategizing and working together to defend an organization from security threats and dilemmas. Learn how to correlate data from sources including AWS CloudTrail, IAM Access Analyzer, AWS Config, and AWS Trusted Advisor using Amazon Q. Discover how to respond to incidents using AWS Systems Manager, AWS Lambda, and Amazon CloudWatch Events. Learn how AWS programs can help you prepare for the unexpected. You must bring your laptop to participate."
  },
  {
    "Position": "79",
    "Session Type": "Workshop",
    "Topic": "DevOps & Developer Productivity",
    "Secondary Topic": "DevOps & Developer Productivity",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "AWS Cloud Development Kit (AWS CDK)",
    "Description": "In this workshop, learn how to build and deploy applications using infrastructure as code with AWS Cloud Development Kit (AWS CDK). Create resources using AWS CDK, and learn maintenance and operations tips. In addition, get an introduction to building your own constructs. You must bring your laptop to participate."
  },
  {
    "Position": "80",
    "Session Type": "Workshop",
    "Topic": "Architecture",
    "Secondary Topic": "Disaster Response & Recovery",
    "Area of Interest": "Global Infrastructure",
    "Level": "300 – Advanced",
    "Role": "Solution / Systems Architect",
    "Service": "AWS Elastic Disaster Recovery",
    "Description": "In this workshop, get hands-on experience implementing different AWS disaster recovery strategies while building a Unishop application. Each module throughout the workshop highlights the AWS strategies and services that have features that make it easy to implement a disaster recovery plan. You must bring your laptop to participate."
  },
  {
    "Position": "81",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "Telecommunications",
    "Area of Interest": "Telecommunications",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon Bedrock",
    "Description": "In this workshop, explore three compelling telecommunications use cases using AWS services like Amazon Bedrock and Amazon Q, and learn how they support code generation and accelerate network operations. The workshop culminates with a customer care demo, revealing ways to elevate the customer experience. Come learn about opportunities to apply these cutting-edge technologies in an interactive environment. You must bring your laptop to participate."
  },
  {
    "Position": "82",
    "Session Type": "Workshop",
    "Topic": "Kubernetes",
    "Secondary Topic": "Migration & Modernization",
    "Area of Interest": "Modernization",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon Elastic Kubernetes Service (Amazon EKS)",
    "Description": "Elevate your Amazon EKS skills with this hands-on workshop designed for experienced builders. Learn how to create a unified internal developer platform for Amazon EKS clusters across environments using GitOps principles. Hone your skills in multi-cluster resource configuration, drift detection, and lifecycle management while ensuring compliance and security. Gain practical skills in implementing platform engineering for consistent resource states, enforcing policies across clusters, and centralizing logging, metrics, monitoring, and access control. Equip yourself with cutting-edge strategies to efficiently manage and secure your Amazon EKS fleet at scale. You must bring your laptop to participate."
  },
  {
    "Position": "83",
    "Session Type": "Workshop",
    "Topic": "Networking",
    "Secondary Topic": "Network & Infrastructure Security",
    "Area of Interest": "300 – Advanced",
    "Level": "300 – Advanced",
    "Role": "",
    "Service": "Amazon Route 53",
    "Description": "Get hands-on experience building a modern global network with AWS Cloud WAN and AWS Direct Connect. In this workshop, transform your network by replacing traditional data center interconnect circuits with AWS Direct Connect SiteLink. Also, dual-stack your hybrid network to prepare IPv6 connectivity for applications, and scale beyond limitations of IPv4 space. Finally, enhance your hybrid cloud network by implementing Amazon Route 53 Resolver endpoints with Route 53 Profiles to integrate your AWS and on-premises DNS infrastructure. Leave this workshop well-equipped to architect and deploy efficient hybrid network architectures. You must bring your laptop to participate."
  },
  {
    "Position": "84",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "Migration & Modernization",
    "Area of Interest": "Generative AI",
    "Level": "400 – Expert",
    "Role": "Developer / Engineer",
    "Service": "Amazon Q Code   Transformation",
    "Description": "In this workshop, gain hands-on experience porting a .NET Framework application to cross-platform .NET. Use Amazon Q Code Transformation for .NET, a modernization tool powered by generative AI that significantly reduces the time to migrate applications from Windows Server to Linux. Learn how migrating to Linux helps you avoid additional licensing fees and gain performance and security benefits. You must bring your laptop to participate."
  },
  {
    "Position": "85",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "Education",
    "Area of Interest": "Education",
    "Level": "300 – Advanced",
    "Role": "",
    "Service": "",
    "Description": "Imagine a world where learning is no longer a one-size-fits-all experience but a personalized journey tailored to each individual’s needs. Learn how to harness the power of generative AI and AWS services to revolutionize the education space. In this workshop, see how generative AI can aid with different learning styles, productivity, and accessibility for students. Get ready to be inspired by the art of the possible in leveraging technology to transform the way people learn. You must bring your laptop to participate."
  },
  {
    "Position": "86",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "DevOps & Developer Productivity",
    "Area of Interest": "Generative AI",
    "Level": "400 – Expert",
    "Role": "Amazon Q Code   Transformation",
    "Service": "Amazon Q Developer",
    "Description": "Unlock the power of generative AI for modern engineering on AWS in this immersive workshop. Gain hands-on experience with cutting-edge services like Amazon Q Developer, managed database services, and open source tools such as Backstage, Argo CD, and Crossplane on Amazon EKS. Harness features like Amazon Q Developer Agent for code transformation and for software development to streamline application development and modernize Java and .NET legacy code. Learn how to apply internal developer platforms with self-service templates and how to use fully automate progressive delivery tooling with modern databases. Harness generative AI to foster innovation, and unlock cloud-native experiences on AWS. This workshop is intended for AWS Partners."
  },
  {
    "Position": "87",
    "Session Type": "Workshop",
    "Topic": "Analytics",
    "Secondary Topic": "Business Applications",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "400 – Expert",
    "Role": "400 – Expert",
    "Service": "Amazon Quicksight Q",
    "Description": "In today’s data-driven business landscape, executives and decision-makers need real-time access to actionable insights. However, traditional business intelligence (BI) tools often require technical expertise and can be time-consuming to navigate. This hands-on workshop shows you how to empower your executives to get insights on their own. Leverage the latest Generative BI capabilities in Amazon QuickSight to build a powerful executive dashboard in minutes using natural language. Learn how Amazon Q makes it easier for business users to understand data with executive summaries, context-aware Q&A, and data stories that help drive decisions from insights. You must bring your laptop to participate."
  },
  {
    "Position": "88",
    "Session Type": "Workshop",
    "Topic": "Analytics",
    "Secondary Topic": "Architecture",
    "Area of Interest": "Modernization",
    "Level": "400 – Expert",
    "Role": "",
    "Service": "",
    "Description": "This comprehensive workshop equips data engineers, data scientists, data analysts, and data developers with the skills to navigate their entire data journey on AWS. Gain expertise in different data ingestion and integration techniques; explore data lake and data warehouse storage solutions; build data transformations; build, scale, and monitor data pipelines; deploy governance at scale; and dive into different data transformation methods to unlock data’s true potential. Leave this workshop empowered to build data products and manage robust transactional data lakes and data warehouses, transforming raw data into actionable intelligence. You must bring your laptop to participate."
  },
  {
    "Position": "89",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "Analytics",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "",
    "Service": "",
    "Description": "Supercharge your data warehouse with zero-ETL and generative AI. In this workshop, explore zero-ETL architecture patterns that simplify data analysis by eliminating the need for complex pipelines and seamlessly integrate generative AI models into your Amazon Redshift data warehouse. Through a real-world retail scenario, learn how to integrate customer 360 data to generate personalized communications that are tailored to sentiment and product reviews by harnessing the power of AI and operational analytics from directly within your data warehouse. You must bring your laptop to participate."
  },
  {
    "Position": "90",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "Architecture",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "400 – Expert",
    "Role": "Developer / Engineer",
    "Service": "Amazon Q Developer",
    "Description": "In this workshop, use leading models available on Amazon Bedrock to build intelligent, scalable business applications that optimize the delivery of critical citizen services. Delve into the capabilities of the models available on Amazon Bedrock, including prompt engineering and function tools, and utilize Amazon Q Developer to prototype and test solutions. By integrating these technologies with the Generative AI Application Builder on AWS solution, construct a real-world use case demonstrating how intelligent automation can streamline operations and enhance citizen experiences, addressing the challenges agencies and public organizations face. You must bring your laptop to participate."
  },
  {
    "Position": "91",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "Cross-Industry Solutions",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon Bedrock",
    "Description": "In this workshop, explore how you can evaluate your RAG components in Amazon Bedrock. These frameworks often offer various tools, utilities, and metrics to assess the performance of RAG systems across different aspects, such as retrieval accuracy, generation quality, and factual consistency. By using open source frameworks, generative AI developers can rigorously evaluate RAG models, identify strengths and weaknesses, and make informed decisions about model selection and deployment. These frameworks also facilitate collaboration and knowledge sharing by promoting transparency and reproducibility. You must bring your laptop to participate."
  },
  {
    "Position": "92",
    "Session Type": "Workshop",
    "Topic": "Compute",
    "Secondary Topic": "Quantum Technologies",
    "Area of Interest": "300 – Advanced",
    "Level": "300 – Advanced",
    "Role": "Amazon Braket",
    "Service": "Amazon Braket",
    "Description": "Hybrid algorithms, combining quantum and classical compute resources, are widely believed to be promising candidates for the first demonstrations of useful applications of quantum computers. Linear systems of equations, which play an important role in science and technology, are one such area where hybrid algorithms have been explored. In this workshop, learn how to use Amazon Braket Hybrid Jobs to implement the Variational Quantum Linear Solver algorithm to solve linear systems of equations on real quantum computers. You must bring your laptop to participate."
  },
  {
    "Position": "93",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "Cross-Industry Solutions",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "200 – Intermediate",
    "Role": "Developer / Engineer",
    "Service": "Amazon Bedrock",
    "Description": "This hands-on workshop explores the synergy between traditional ML approaches and the emerging realm of generative AI. Drawing parallels from reinforcement learning concepts used with AWS DeepRacer, this workshop dives into the criteria for selecting appropriate solutions, whether traditional ML or generative AI. Explore the different tools and services available, ranging from low-code/no-code offerings like Amazon Bedrock and Amazon Q to code-based solutions like Amazon SageMaker JumpStart. Leave this workshop with a comprehensive understanding of when to use generative AI capabilities, how to integrate generative AI seamlessly with traditional ML methodologies, and what tools are available through AWS. You must bring your laptop to participate."
  },
  {
    "Position": "94",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "Generative AI",
    "Area of Interest": "Microsoft & .NET",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon API Gateway",
    "Description": "Learn how to use generative AI to automate code generation, reduce manual effort, and increase development speed. In this workshop, get hands-on experience developing an end-to-end .NET 8 application using Amazon Bedrock, AWS Lambda, and Amazon API Gateway. Use Amazon Bedrock to generate infrastructure as code (IaC) directly from architecture diagrams and then, with agents, use the code to automatically create the infrastructure. Learn security best practices and how to use Amazon Bedrock within your .NET applications to enable seamless integration with generative AI models. You must bring your laptop to participate."
  },
  {
    "Position": "95",
    "Session Type": "Workshop",
    "Topic": "DevOps & Developer Productivity",
    "Secondary Topic": "DevOps & Developer Productivity",
    "Area of Interest": "Lambda-Based Applications",
    "Level": "400 – Expert",
    "Role": "Developer / Engineer",
    "Service": "Amazon Q Developer",
    "Description": "In this workshop, learn how to bring your traditional Java Spring application to AWS Lambda with minimal effort and iteratively apply optimizations to get the best out of your serverless Java experience. Find out how to improve the performance of your application with AWS Lambda SnapStart and GraalVM native images. Then, learn how to write new applications with Spring Cloud Function and use Amazon Q Developer to quickly generate the code. Finally, discover how to use observability tooling to get a full picture of your architecture. Leave this workshop knowing how to make well-informed decisions when modernizing enterprise Java applications with AWS Lambda. You must bring your laptop to participate."
  },
  {
    "Position": "96",
    "Session Type": "Workshop",
    "Topic": "Migration & Modernization",
    "Secondary Topic": "Serverless Compute & Containers",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "200 – Intermediate",
    "Role": "IT Professional / Technical Manager",
    "Service": "System Administrator",
    "Description": "In this workshop, learn how to use AWS modernization pathways to quickly decompose a monolithic workload to a loosely coupled, distributed microservices architecture. Walk through a real-world migration scenario, starting with the migration of VMware-based applications to AWS, followed by step-by-step guidance on modernizing those applications. Hear from AWS experts as they share best practices for transforming monolithic applications into modern cloud architectures. Learn how to utilize AWS services such as AWS App Runner, Amazon Aurora, and AWS Lambda as you containerize the monolithic application, migrate to a managed database, and move your applications to serverless. You must bring your laptop to participate."
  },
  {
    "Position": "97",
    "Session Type": "Workshop",
    "Topic": "Compute",
    "Secondary Topic": "Kubernetes",
    "Area of Interest": "Management & Governance",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon Elastic Kubernetes Service (Amazon EKS)",
    "Description": "Are you ready to get hands-on with Amazon EKS? In this workshop, start with Kubernetes fundamentals and then dive deeper into modules that cover generative AI, observability, networking, security, and more. Gain operational expertise on Amazon EKS like managing scale and costs with Karpenter, training and serving generative AI models, and building resilient clusters that follow industry best practices. Join us for an opportunity to explore Amazon EKS and learn new skills. You must bring your laptop to participate."
  },
  {
    "Position": "98",
    "Session Type": "Workshop",
    "Topic": "AI/ML",
    "Secondary Topic": "Cross-Industry Solutions",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon Bedrock",
    "Description": "Gain a deeper understanding of your customers by harnessing the power of Amazon Transcribe and generative AI. In this workshop, learn how to combine automatic call transcription, analytics, call summarization, and business intelligence from customer calls. Experience demos on building analytics dashboards and integrations with large language models (LLMs) and Amazon Q in QuickSight. Visualize key metrics, uncover data stories, and find answers to your top business questions. Unlock valuable insights and make data-driven decisions to enhance customer experience. You must bring your laptop to participate."
  },
  {
    "Position": "99",
    "Session Type": "Workshop",
    "Topic": "Databases",
    "Secondary Topic": "Generative AI",
    "Area of Interest": "Open Source",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon Aurora",
    "Description": "In this workshop, use generative AI to develop an incident detection and response (IDR) system. The IDR system will utilize a diverse range of data sources, including database documentation, runbooks, incident records, and more, to build a robust vector store using Amazon Aurora PostgreSQL-Compatible Edition with the pgvector extension. The IDR system will use Amazon Bedrock for inference with an LLM to classify incidents and perform automatic corrective actions. In addition, learn how to create a chatbot that provides insights into your database infrastructure–related queries and offers guidance for regular operations, such as Aurora and Amazon RDS database upgrades. You must bring your laptop to participate."
  },
  {
    "Position": "100",
    "Session Type": "Workshop",
    "Topic": "Architecture",
    "Secondary Topic": "Generative AI",
    "Area of Interest": "Resilience",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon Bedrock",
    "Description": "There are multiple factors that impact the performance and reliability of generative AI applications. These include the choice of model, where the model is hosted, and the length and complexity of the inputs and outputs. Chaos engineering helps software teams understand the risks in their systems. This workshop applies chaos engineering practices to demonstrate potential performance and resilience risks in generative AI applications. Learn how to construct a useful hypothesis backlog for generative AI applications and how to use AWS Fault Injection Service to run those experiments. You must bring your laptop to participate."
  }
]