[
  {
    "Position": "1",
    "Session Type": "Breakout session",
    "Topic": "Storage",
    "Industry": "Migration & Modernization",
    "Area of Interest": "Energy & Utilities",
    "Level": "200 – Intermediate",
    "Role": "IT Professional / Technical Manager",
    "Service": "Amazon Simple Storage Service (Amazon S3)",
    "Session Title": "Accelerate your cloud journey by moving your data to AWS quickly and securely with AWS DataSync. In this session, discover best practices for how to move your data at scale and increase performance. Hear a success story from Resilience, an AWS customer that is transforming the way novel medicines are produced, and learn how they used DataSync to build a connected network for fast, reliable data transfer in their lab environments."
  },
  {
    "Position": "2",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Generative AI",
    "Level": "200 – Intermediate",
    "Role": "",
    "Service": "",
    "Session Title": "Amazon Bedrock Studio provides the easiest way to build and iterate on generative AI–based applications using foundation models (FMs). Its web-based interface and single sign-on makes it simple for developers across an organization to experiment with large language models, collaborate on projects, and access the tools needed to build generative AI applications. Amazon Bedrock Studio offers a streamlined rapid prototyping environment by integrating with Amazon Bedrock’s serverless capabilities to deploy FMs. In this session, learn how Amazon Bedrock Studio accelerates generative AI application development by abstracting infrastructure complexities away from developers."
  },
  {
    "Position": "3",
    "Session Type": "Breakout session",
    "Topic": "Customer Enablement",
    "Industry": "New to AWS",
    "Area of Interest": "AWS Marketplace",
    "Level": "100 – Foundational",
    "Role": "",
    "Service": "",
    "Session Title": "Cloud marketplaces are emerging as the preferred destination for software, services, and data procurement. These solutions from experts in the worldwide AWS Partner community have become a vital component of the overall cloud and digital strategy for organizations. To enable innovation at speed, organizations have already begun to modernize the way they acquire, deploy, and govern these solutions through AWS Marketplace. In this session, AWS Marketplace Customer Advisors and business innovation leaders discuss how they have worked with organizations to revolutionize the management of the complete lifecycle of partner solutions integrated in their AWS innovation journeys."
  },
  {
    "Position": "4",
    "Session Type": "Breakout session",
    "Topic": "DevOps & Developer Productivity",
    "Industry": "Serverless Compute & Containers",
    "Area of Interest": "Lambda-Based Applications",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "In this session, discover best practices and proven patterns for using Terraform to build serverless applications safely, predictably, and repeatedly. Learn techniques for designing modular, reusable architectures and strategies to test applications locally. Understand how to manage ownership and separation of concerns between operations and development teams. Gain insights into efficiently deploying serverless applications to the cloud. Familiarize yourself with open source frameworks to accelerate your serverless journey with Terraform today. Leave equipped with practical skills for leveraging Terraform’s power in your organization’s modern cloud architectures."
  },
  {
    "Position": "5",
    "Session Type": "Breakout session",
    "Topic": "Databases",
    "Industry": "Innovation & Transformation",
    "Area of Interest": "400 – Expert",
    "Level": "400 – Expert",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "Amazon Aurora is a relational database service built for the cloud that is designed for unparalleled high performance and availability at global scale, with full MySQL and PostgreSQL compatibility. In this session, learn how Amazon Aurora Limitless Database enables applications to scale to millions of transactions per second across petabytes of data. Explore the architecture, distributed transaction management, and serverless scaling capabilities of Aurora Limitless Database. Also, discover application patterns that are a good fit for Aurora Limitless Database and which patterns to avoid. Learn how Aurora Limitless Database makes it easier than ever to scale Aurora."
  },
  {
    "Position": "6",
    "Session Type": "Breakout session",
    "Topic": "Databases",
    "Industry": "Customer Stories",
    "Area of Interest": "Innovation on AWS",
    "Level": "400 – Expert",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "Amazon DynamoDB is a popular choice for modern applications because it’s a serverless database that provides single-digit millisecond performance at any scale. Optimizing your usage of DynamoDB requires a different approach to data modeling than traditional relational databases. In this session, AWS Data Hero Alex DeBrie shows you advanced techniques to help you get the most out of DynamoDB. Learn how to “think in DynamoDB” by learning the DynamoDB foundations and principles for data modeling. Further, learn practical strategies and DynamoDB features to handle difficult use cases in your application."
  },
  {
    "Position": "7",
    "Session Type": "Breakout session",
    "Topic": "Serverless Compute & Containers",
    "Industry": "Application Integration",
    "Area of Interest": "Event-Driven Architecture",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "Today’s applications are interconnected: they expose APIs, publish events, call third-party services, and externalize states. They must therefore address the fundamental challenges of distributed systems, such as out-of-order delivery, retries, idempotence, or partial failures. To balance those characteristics, architects have a range of options, including the level of decoupling through indirection, transformation, and asynchrony. In this session, learn about common design trade-offs for distributed systems, how to navigate them with design patterns, and how to embed those patterns in your cloud automation."
  },
  {
    "Position": "8",
    "Session Type": "Breakout session",
    "Topic": "Networking",
    "Industry": "Global Infrastructure",
    "Area of Interest": "Network & Infrastructure Security",
    "Level": "300 – Advanced",
    "Role": "",
    "Service": "",
    "Session Title": "Amazon VPC is a foundational service on AWS, giving you control over your virtual networking environment. Every year, AWS makes updates to Amazon VPC to help improve functionality, security, and usability. In this session, learn about the latest updates to Amazon VPC and how you can use them to enhance your current architectures."
  },
  {
    "Position": "9",
    "Session Type": "Breakout session",
    "Topic": "Databases",
    "Industry": "Disaster Response & Recovery",
    "Area of Interest": "Global Infrastructure",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "Amazon Aurora is a fully managed relational database designed for unparalleled high performance and availability at global scale with full MySQL and PostgreSQL compatibility. Aurora provides managed high availability (HA) and disaster recovery (DR) capabilities in and across AWS Regions. In this session, explore the Aurora HA and DR capabilities and discover design patterns that enable the development of resilient applications. Learn how to establish in-Region and cross-Region HA and DR using Aurora features, including Multi-AZ deployments, Aurora Global Database, and Amazon RDS Proxy, and discover how to reduce failover times with a JDBC driver."
  },
  {
    "Position": "10",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "DevOps & Developer Productivity",
    "Area of Interest": "Generative AI",
    "Level": "200 – Intermediate",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "In this session, learn how Amazon Q Developer is transforming the developer experience by speeding up a range of tasks that support you as you research how to get started, evaluate system design, build secure and scalable applications, upgrade existing applications, and optimize application performance. Learn firsthand how Amazon Q capabilities for building, troubleshooting, and transforming applications faster and more easily frees you up to focus on experimentation and innovation."
  },
  {
    "Position": "11",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Analytics",
    "Area of Interest": "Business Intelligence",
    "Level": "100 – Foundational",
    "Role": "Amazon QuickSight",
    "Service": "",
    "Session Title": "Unleash data’s true potential with Amazon Q in QuickSight—an AI-powered Generative BI assistant that boosts productivity organization-wide. In this session, discover how analysts can build dashboards in minutes, not hours. Explore how business users can create interactive data stories and presentations in seconds to drive decisions and distill key insights from data not shown in dashboards with the data Q&A experience and executive summaries. Hear from two AWS customers on how they empowered their workforce with Generative BI and eliminated manual reporting bottlenecks, unlocked deeper insights, and gained a competitive edge with Amazon Q in QuickSight."
  },
  {
    "Position": "12",
    "Session Type": "Breakout session",
    "Topic": "Storage",
    "Industry": "Storage",
    "Area of Interest": "Application Security",
    "Level": "300 – Advanced",
    "Role": "System Administrator",
    "Service": "Amazon Simple Storage Service (Amazon S3)",
    "Session Title": "Strong adherence to architecture best practices and proactive controls are the foundations of data security. Amazon S3 provides security settings and granular access controls to suit any workload. In this session, learn about the fundamentals of Amazon S3 security and dive deep into the latest enhancements in usability and functionality. Explore options for access control, encryption, monitoring, auditing, and remediation. Discover best practices for data security and access control in Amazon S3."
  },
  {
    "Position": "13",
    "Session Type": "Breakout session",
    "Topic": "Databases",
    "Industry": "Innovation & Transformation",
    "Area of Interest": "400 – Expert",
    "Level": "400 – Expert",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "To overcome the performance and scale limitations of relational databases, AWS built Amazon DynamoDB to deliver consistent single-digit millisecond performance at any scale for the most demanding applications on the planet. In this session, learn about the architecture choices for Amazon DynamoDB. Gain a better understanding of when to use DynamoDB and why DynamoDB is used by over one million AWS customers to power hundreds of applications that exceed half a million requests per second. Leave with a new perspective on how to design your own applications."
  },
  {
    "Position": "14",
    "Session Type": "Breakout session",
    "Topic": "Serverless Compute & Containers",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Application Integration",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "Modern distributed applications leverage diverse integration components such as queues, event brokers, and workflows. To enhance developer productivity and enforce best practices, platform architects automate the management of these components, incorporating robust logging, monitoring, and security measures. In this session, explore the implementation of application integration using serverless components in enterprise environments. Gain insights on implementing effective data masking techniques, establishing comprehensive observability, and securely configuring cross-account access, and learn how to design and maintain scalable, secure distributed systems that align with enterprise-grade standards."
  },
  {
    "Position": "15",
    "Session Type": "Breakout session",
    "Topic": "Analytics",
    "Industry": "Databases",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "In this session, gain the skills needed to deploy end-to-end generative AI applications using your most valuable data. While this session focuses on the Retrieval Augmented Generation (RAG) process, the concepts also apply to other methods of customizing generative AI applications. Discover best practice architectures using AWS database services like Amazon Aurora, Amazon OpenSearch Service, or Amazon MemoryDB along with data processing services like AWS Glue and streaming data services like Amazon Kinesis. Learn data lake, governance, and data quality concepts and how Amazon Bedrock features like knowledge bases and agents tie solution components together."
  },
  {
    "Position": "16",
    "Session Type": "Breakout session",
    "Topic": "Architecture",
    "Industry": "Well-Architected Framework",
    "Area of Interest": "200 – Intermediate",
    "Level": "200 – Intermediate",
    "Role": "",
    "Service": "",
    "Session Title": "Most businesses depend on a portfolio of technology solutions to operate and be successful every day. How do you know if you and your team are following best practice or what the risks in your architectures might be? In this session, learn how the AWS Well-Architected Framework provides prescriptive architectural advice and how the AWS Well-Architected Tool helps you measure and improve your technology portfolio."
  },
  {
    "Position": "17",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Analytics",
    "Area of Interest": "Advertising & Marketing",
    "Level": "300 – Advanced",
    "Role": "",
    "Service": "",
    "Session Title": "AffinityX, a leading advertising agency processing over 3 million purchase orders annually for promotional goods, encountered scalability challenges. In this session, hear how they leveraged generative AI on AWS and Cloudwick’s expertise to develop a solution powered by Amazon Bedrock, Anthropic Claude 3, AWS Lambda, and other serverless services. Discover how this innovative approach automated the entire order workflow, seamlessly handling the high volume of orders from submission to fulfillment without manual intervention. Gain insights into how AffinityX achieved cost savings, scalability, and the ability to dynamically adapt to demand by embracing generative AI on AWS for order processing automation."
  },
  {
    "Position": "18",
    "Session Type": "Breakout session",
    "Topic": "DevOps & Developer Productivity",
    "Industry": "Innovation on AWS",
    "Area of Interest": "200 – Intermediate",
    "Level": "200 – Intermediate",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "AWS provides services that enable the creation, deployment and maintenance of application infrastructure in a programmatic, descriptive, and declarative way. These services provide rigor, clarity, and reliability to application development. Join this session to learn about the new features and improvements for AWS infrastructure as code with AWS CloudFormation and AWS Cloud Development Kit (AWS CDK) and discover how they can benefit your team."
  },
  {
    "Position": "19",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Internet of Things",
    "Area of Interest": "Automotive",
    "Level": "200 – Intermediate",
    "Role": "IT Professional / Technical Manager",
    "Service": "AWS IoT Core",
    "Session Title": "With the advent of generative AI and large language models (LLMs), you must be wondering, how can these technologies be applied at the IoT edge? After all, there are many benefits of running LLMs at the edge—from network bandwidth efficiencies, offline processing, lower latency, and data sovereignty to cost savings, security, and differentiation. In this session, learn how using AWS IoT services and LLMs at the edge can uplift your solutions with actionable outcomes and innovative capabilities, such as gesture recognition, natural language processing for voice control, real-time predictive maintenance, energy optimization, anomaly detection, and more."
  },
  {
    "Position": "20",
    "Session Type": "Breakout session",
    "Topic": "Serverless Compute & Containers",
    "Industry": "Event-Driven Architecture",
    "Area of Interest": "Lambda-Based Applications",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "In this session, gain practical insights into building scalable, serverless data processing applications by integrating AWS Lambda with Apache Kafka. Explore using event-driven models for real-time data streaming and processing. Discover different architectural patterns and best practices to achieve high throughput, fault tolerance, and low latency. Leave with the knowledge to design serverless data processing pipelines that extract valuable insights from real-time data streams efficiently and cost-effectively."
  },
  {
    "Position": "21",
    "Session Type": "Breakout session",
    "Topic": "Hybrid Cloud",
    "Industry": "Migration & Modernization",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "200 – Intermediate",
    "Role": "IT Professional / Technical Manager",
    "Service": "Solution / Systems Architect",
    "Session Title": "While most workloads can be migrated to the cloud, some remain on premises or at the edge due to low latency, local data processing, or digital sovereignty needs. In this session, learn how AWS services like AWS Outposts, AWS Local Zones, AWS Dedicated Local Zones, and AWS IoT support hybrid cloud and edge computing workloads such as multiplayer gaming, high-frequency trading, medical imaging, smart manufacturing, and generative AI applications with data residency requirements."
  },
  {
    "Position": "22",
    "Session Type": "Breakout session",
    "Topic": "Serverless Compute & Containers",
    "Industry": "Event-Driven Architecture",
    "Area of Interest": "Lambda-Based Applications",
    "Level": "200 – Intermediate",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "Serverless empowers developers to build complex applications by shifting infrastructure and operational responsibility to AWS. Platform engineering plays an important role to ensure consistency and compliance and reduce the complexity of building in the cloud. Learn how platform teams can provide opinionated security, cost, observability, reliability, and sustainability patterns while maintaining developer flexibility and agility. Explore a real-world platform implementation on Backstage, with common application patterns for serverless APIs, event-driven architectures, and containerized applications."
  },
  {
    "Position": "23",
    "Session Type": "Breakout session",
    "Topic": "DevOps & Developer Productivity",
    "Industry": "Serverless Compute & Containers",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "400 – Expert",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "Do you want to take advantage of the full power of serverless architectures for your production workloads? Are you wondering how events can help your applications scale? Have you been trying to tune your applications for higher performance and lower cost? This session provides architectural best practices, optimizations, and useful shortcuts that experts can use to build secure, high-scale, and high-performance serverless applications."
  },
  {
    "Position": "24",
    "Session Type": "Breakout session",
    "Topic": "Databases",
    "Industry": "Security, Compliance & Identity",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "300 – Advanced",
    "Role": "AWS Key Management Service (AWS KMS)",
    "Service": "",
    "Session Title": "AWS uses a combination of culture and technologies to share ownership and build security into every layer of the stack, then externalizes lessons learned through the managed services AWS provides to you. This session examines the full range of data protection capabilities available with AWS and how best practices and culture can complement them to improve security outcomes. Dive deep into a defense in depth perspective, which details how organizations can protect their data and bolster their security culture by consistently building security into every layer."
  },
  {
    "Position": "25",
    "Session Type": "Breakout session",
    "Topic": "Compute",
    "Industry": "Databases",
    "Area of Interest": "Aerospace & Satellite",
    "Level": "200 – Intermediate",
    "Role": "Business Executive",
    "Service": "Amazon EC2 Auto Scaling",
    "Session Title": "In this session, discover how Boeing embarked on a modernization journey to migrate their product lifecycle management (PLM) software to AWS. Boeing’s migration, automation, and infrastructure-as-code approach allowed them to deploy complex PLM environments in a single day compared two weeks on premises. Additionally, they worked with AWS Professional Services and a partner to leverage Amazon RDS, Amazon EFS, and Amazon EC2 Auto Scaling to support disaster recovery, allowing for disaster recovery to be implemented in minutes rather than hours. Learn how their innovations have collectively improved the scalability, operational efficiency, and cost-effectiveness of their PLM systems."
  },
  {
    "Position": "26",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Generative AI",
    "Level": "100 – Foundational",
    "Role": "",
    "Service": "",
    "Session Title": "In this session, learn how Amazon Q Business can help you quickly build a generative AI–powered assistant that can answer questions, provide summaries, generate content, and complete tasks based on data and information in your enterprise systems across a variety of use cases. With security and privacy as central considerations, Amazon Q can respect existing identities, roles, and permissions and allows you to restrict sensitive topics, block keywords, and filter out inappropriate questions and answers."
  },
  {
    "Position": "27",
    "Session Type": "Breakout session",
    "Topic": "Databases",
    "Industry": "Cost Optimization",
    "Area of Interest": "300 – Advanced",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "In this session, explore Amazon Aurora and Amazon RDS cost components, and learn important best practices that can help you improve the performance of your relational database workloads while reducing spend on various cost components, such as compute, storage, backup, and I/O."
  },
  {
    "Position": "28",
    "Session Type": "Breakout session",
    "Topic": "Storage",
    "Industry": "Storage",
    "Area of Interest": "Generative AI",
    "Level": "200 – Intermediate",
    "Role": "IT Professional / Technical Manager",
    "Service": "Amazon Simple Storage Service (Amazon S3)",
    "Session Title": "Data has long been considered a strategic asset by organizations, but generative AI puts a renewed emphasis on the importance of a data strategy. Whether you are building your own model or customizing a foundation model, your data is a key differentiator for generative AI, so you need a data strategy that supports relevant, high-quality data. In this session, learn about the data tools that can fuel your generative AI strategy and the common data patterns required to transform your generative AI application from a generic tool to a program that truly knows your business and your customer."
  },
  {
    "Position": "29",
    "Session Type": "Breakout session",
    "Topic": "Serverless Compute & Containers",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Application Integration",
    "Level": "400 – Expert",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "Are you an experienced serverless developer building applications with AWS Step Functions workflows? Are you wondering when to use a Map state, a Parallel state, or a nested workflow? In this session, learn how you can use generative AI to generate state machines automatically from textual descriptions and chat with your workflow to optimize it. Learn about architectural best practices and repeatable patterns for building advanced workflows. Discover how to build secure, high-scale, and high-performance serverless applications while being cost-effective. This session shares real production scenarios to illustrate the benefits for you."
  },
  {
    "Position": "30",
    "Session Type": "Breakout session",
    "Topic": "Migration & Modernization",
    "Industry": "Migration & Modernization",
    "Area of Interest": "200 – Intermediate",
    "Level": "200 – Intermediate",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "Boost productivity and create better customer experiences by building a modern integration strategy. This session explores using AWS application, data, and file integration services to connect on-premises and cloud technologies securely and at scale. Discover common integration patterns, best practices, and practical use cases. Learn how to build a robust, extensible, scalable, and cost-effective integration strategy for the future."
  },
  {
    "Position": "31",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "",
    "Service": "",
    "Session Title": "Guardrails for Amazon Bedrock enables organizations to deliver consistently safe and moderated user experiences through generative AI applications, no matter the underlying FM. Join this session to learn about using guardrails in Amazon Bedrock to specify disallowed topics and moderation filters to keep interactions between FMs and users relevant and free of harmful content. See a demo of how to create and apply custom tailored guardrails with FMs and Agents for Amazon Bedrock to implement responsible AI policies within your generative AI applications."
  },
  {
    "Position": "32",
    "Session Type": "Breakout session",
    "Topic": "Databases",
    "Industry": "Cost Optimization",
    "Area of Interest": "Innovation & Transformation",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "Amazon Aurora Serverless represents a paradigm shift in database management, offering a serverless architecture that seamlessly scales compute and memory resources based on application demand. In this session, dive deep into the Amazon Aurora Serverless v2 architecture, new innovations, and best practices for building scalable and cost-optimized applications with this on-demand, auto scaling configuration for Aurora."
  },
  {
    "Position": "33",
    "Session Type": "Breakout session",
    "Topic": "Architecture",
    "Industry": "Serverless Compute & Containers",
    "Area of Interest": "Application Integration",
    "Level": "200 – Intermediate",
    "Role": "Amazon Elastic Container Service (Amazon ECS)",
    "Service": "",
    "Session Title": "Ten years ago, AWS Lambda pioneered serverless computing. Amazon ECS with AWS Fargate further catalyzed the serverless revolution. With serverless, builders are able to focus on delivering customer value instead of spending time managing servers. Serverless continues to be an innovative approach to building applications. Join this session to explore how serverless has evolved to help organizations drive the highest performance, availability, and security at low costs. Learn from leaders charged with defining the next generation of serverless how serverless powers applications across Amazon and AWS."
  },
  {
    "Position": "34",
    "Session Type": "Breakout session",
    "Topic": "Serverless Compute & Containers",
    "Industry": "Lambda-Based Applications",
    "Area of Interest": "200 – Intermediate",
    "Level": "200 – Intermediate",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "In this session, explore the fundamental differences between containers and serverless functions. Investigate real-world scenarios to gain insights into choosing the right approach based on workload requirements, deployment scenarios, and operations. Understand the architectural, scalability, and operational contrasts between these pivotal cloud technologies. Finally, discover synergies in combining them to leverage their collective strengths. Leave with a clear understanding of when to use containers, serverless functions, or a hybrid model for your application needs."
  },
  {
    "Position": "35",
    "Session Type": "Breakout session",
    "Topic": "DevOps & Developer Productivity",
    "Industry": "Innovation on AWS",
    "Area of Interest": "Open Source",
    "Level": "200 – Intermediate",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "AWS provides one place where you can plan work, collaborate on code, and build, test, and deploy applications with continuous integration and continuous delivery (CI/CD) tools. In this session, learn about creating complete CI/CD pipelines using infrastructure as code on AWS."
  },
  {
    "Position": "36",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "Amazon SageMaker allows data scientists and ML engineers to accelerate their generative AI journeys by deeply customizing publicly available foundation models (FMs) and deploying them into production applications. The journey begins with Amazon SageMaker JumpStart, an ML hub that provides access to hundreds of publicly available FMs, such as Llama 3, Falcon, and Mistral. Join this session to learn how you can evaluate FMs, select an FM, customize it with advanced techniques, and deploy it—all while implementing AI responsibility, simplifying access control, and enhancing transparency."
  },
  {
    "Position": "37",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Architecture",
    "Area of Interest": "Generative AI",
    "Level": "400 – Expert",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "The performance and accuracy of AI and ML systems directly depend on the quality, relevance, and integrity of the training data. Data engineering plays a crucial role in ensuring high-quality data is available, accessible, and usable for successful AI and ML implementations, allowing models to learn, reason, and act effectively. This session explores how AWS analytics provides complete engineering solutions for ingesting, storing, processing, and integrating data for AI and ML applications, addressing challenges such as cleaning and transforming real-time data streams, ingesting, integrating, and storing data from diverse sources into a unified view with orchestrated scalability."
  },
  {
    "Position": "38",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Analytics",
    "Area of Interest": "Application Integration",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "Generative AI is compelling organizations to reevaluate their data strategy. While data foundations like pipelines, architectures, stores, and governance need to evolve, businesses also aim to maintain cost efficiency and maximize performance in their generative AI adoption. In this session, learn how laying your data foundation on AWS provides the guidance and building blocks to balance both needs, and discover how to grow your data strategy for generative AI applications."
  },
  {
    "Position": "39",
    "Session Type": "Breakout session",
    "Topic": "Databases",
    "Industry": "Innovation on AWS",
    "Area of Interest": "Strategy & Transformation",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "Join this session to learn the core concepts of Amazon DynamoDB data modeling. Explore best practices for common access patterns used by DynamoDB customers for applications that need consistent, fast performance at any scale. Developers experienced with DynamoDB can learn best practices and trade-offs to make when deciding on single-table and multi-table designs, indexing strategies, and more."
  },
  {
    "Position": "40",
    "Session Type": "Breakout session",
    "Topic": "Storage",
    "Industry": "Storage",
    "Area of Interest": "Data Protection",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "Amazon Simple Storage Service (Amazon S3)",
    "Session Title": "Data continues to be one of the world’s most valuable resources. Data protection and resilience are critical to business success, helping to keep workflows running and allow business recovery from data loss events such as unplanned outages, natural disasters, and ransomware. Join this session to dive deep on how AWS storage offers organizations defense-in-depth data protection and resilience for application data across recovery point and time objectives, helping to mitigate risks with immutable solutions, restore testing, policy-based access controls, encryption, and auditing and reporting."
  },
  {
    "Position": "41",
    "Session Type": "Breakout session",
    "Topic": "Databases",
    "Industry": "Generative AI",
    "Area of Interest": "Innovation on AWS",
    "Level": "400 – Expert",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "With an innovative architecture that decouples compute from storage and advanced features like Global Database and low-latency read replicas, Amazon Aurora reimagines what it means to be a relational database. Aurora is a modern database service offering unparalleled performance and high availability at scale with full open source MySQL and PostgreSQL compatibility. In this session, dive deep into the most exciting new features that Aurora offers, including Aurora Limitless Database, Aurora I/O-Optimized, Aurora zero-ETL integration with Amazon Redshift, and Aurora Serverless v2. Additionally, learn how the addition of the pgvector extension allows for the storage of vector embeddings and support of vector similarity searches for generative AI."
  },
  {
    "Position": "42",
    "Session Type": "Breakout session",
    "Topic": "Databases",
    "Industry": "Generative AI",
    "Area of Interest": "Cost Optimization",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "With an innovative architecture, a broad choice of graph data models and query languages, and advanced features like Neptune Serverless, global databases, low-latency read replicas, and in-memory graph computing, Amazon Neptune makes it easier to obtain connected data insights for use cases like knowledge graphs, customer 360, fraud, and security. In this session, dive deep on exciting features in Neptune including serverless and in-memory processing, multi-Region availability, and I/O-optimized storage. Also learn about the latest performance innovations and advanced topics for query optimization and rewriting to optimize for performance, which give you the background to solve different technical and operational challenges."
  },
  {
    "Position": "43",
    "Session Type": "Breakout session",
    "Topic": "Databases",
    "Industry": "Strategy & Transformation",
    "Area of Interest": "400 – Expert",
    "Level": "400 – Expert",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "This session provides a deep dive into Amazon DynamoDB and shares insights into how DynamoDB is architected and how it’s able to deliver the scalability and response times that customers have come to expect. Gain an in-depth understanding of how DynamoDB capabilities including TTL, global tables, and MemDS have been implemented."
  },
  {
    "Position": "44",
    "Session Type": "Breakout session",
    "Topic": "Compute",
    "Industry": "Migration & Modernization",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "The AWS Nitro System is a rich collection of building block technologies—including hardware offload and security components built by AWS—that are powering the recent and future generations of Amazon EC2 instances with an ever-broadening selection of compute, storage, memory, and networking options. In this session, dive deep into the AWS Nitro System, review its design and architecture, explore new innovations in the Nitro platform, and see how it has made the seemingly impossible possible."
  },
  {
    "Position": "45",
    "Session Type": "Breakout session",
    "Topic": "Storage",
    "Industry": "Network & Infrastructure Security",
    "Area of Interest": "Strategy & Transformation",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "Amazon Simple Storage Service (Amazon S3)",
    "Session Title": "Amazon S3 provides developers and IT teams with cloud object storage that delivers industry-leading scalability, durability, security, and performance. In this session, dive deep into the underlying architecture of S3 to see how it delivers virtually unlimited scale and elasticity, learn how the culture of data durability delivers consistent performance, and discover how these fundamentals combine to make S3 different from any other cloud storage. Also learn about the S3 storage classes and key features across security, access management, storage management, and more."
  },
  {
    "Position": "46",
    "Session Type": "Breakout session",
    "Topic": "Cloud Operations",
    "Industry": "New to AWS",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "200 – Intermediate",
    "Role": "Sales / Marketing",
    "Service": "",
    "Session Title": "In this session, learn how product and technology officers at software companies continue to drive their innovation agenda, maintain differentiation, and avoid disruption. Technologies like generative AI have captured the imagination of the industry and are poised to bring in the next wave of advancements. However, software companies face challenges such as navigating the current macroeconomic climate and optimizing their capital allocation, profitability, and R&D priorities. Explore strategies for how product and technology officers can work together to build a strong foundation for business."
  },
  {
    "Position": "47",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Internet of Things",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "The next generation of smart home solutions is expected to harness the power of AI to a new level, delivering unprecedented convenience, hyper-personalization, and elevated intelligence. Modern AI assistants will learn user preferences, schedules, and habits, enabling proactive automation tailored to individual needs. In this session, learn how to train ML models optimized for smart home devices, set up CI/CD pipelines to efficiently distribute model updates, and implement mechanisms to automatically capture device data for retraining. Also, see how AWS customers are combining AI, IoT, and seamless interoperability to transform living spaces into truly adaptive environments."
  },
  {
    "Position": "48",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Generative AI",
    "Area of Interest": "Resilience",
    "Level": "100 – Foundational",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "As leaders create and navigate a future fueled by AI, they need to reimagine their leadership approaches, integrating their cognitive intelligence with their emotional intelligence to build adaptable, resilient, and innovative organizations. These leaders will have deep empathy for their customers and foster a culture of creativity and psychological safety among their employees. They will be data-driven but also authentically human. This session helps executives understand the EPIC attributes that empower future-ready leaders—empathy, purpose, inspiration, and connection—so they can drive successful outcomes for their businesses, their customers, and their people in the new human + AI era."
  },
  {
    "Position": "49",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Internet of Things",
    "Area of Interest": "Energy & Utilities",
    "Level": "200 – Intermediate",
    "Role": "200 – Intermediate",
    "Service": "Amazon Simple Storage Service (Amazon S3)",
    "Session Title": "Georgia-Pacific (GP) is one of the largest manufacturers of pulp and paper, dispensers, packaging, and wood and gypsum building products. Like many manufacturers, GP faces workforce attrition challenges as senior workers retire and apprentice operators need to upskill quickly. Hear how GP’s Amazon Bedrock–enabled industrial operator assistant provides a natural language interface for machine diagnostic troubleshooting based on unstructured data (SOP docs, machine manuals, etc.) and structured real-time machine data to retrieve and summarize relevant content in minutes. This reduces mean time to resolution by empowering apprentice workers to troubleshoot independently with real-time, contextualized machine data."
  },
  {
    "Position": "50",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Analytics",
    "Area of Interest": "Business Intelligence",
    "Level": "200 – Intermediate",
    "Role": "",
    "Service": "",
    "Session Title": "Elevate your applications by embedding rich, interactive analytics powered by Amazon QuickSight. In this session, explore how to seamlessly integrate visualizations, dashboards, and ML-powered natural language query into your applications. Discover best practices for embedding these insights at scale, without managing any infrastructure. Go behind the scenes with a real-world use case showcasing how one company differentiated their offering by providing thousands of users with embedded analytics, self-service authoring tools, and scalable data exploration. Whether seeking to drive user engagement, enable data-driven decisions, or monetize analytics, learn how QuickSight can help you deliver exceptional embedded analytics effortlessly."
  },
  {
    "Position": "51",
    "Session Type": "Breakout session",
    "Topic": "Serverless Compute & Containers",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Application Integration",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "Enterprises producing millions of events daily face unique challenges around schema management, evolution, and observability when scaling event-driven architectures (EDAs). In this session, discover proven patterns for building high-scale, event-driven systems with Amazon EventBridge. Learn best practices for enforcing schemas, versioning to evolve schemas without downtime, and enabling schema discovery at scale. Explore observability strategies to effectively monitor event-driven systems, ensuring system health and resilience."
  },
  {
    "Position": "52",
    "Session Type": "Breakout session",
    "Topic": "New to AWS",
    "Industry": "Networking",
    "Area of Interest": "Energy & Utilities",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "IT Professional / Technical Manager",
    "Session Title": "Low Earth orbit satellite networks are in their infancy, but with rapid technology advancements and lower costs, businesses are realizing their benefits. The ability to connect people, places, and machines anywhere in the world will have transformational effects. In this session, learn how the low Earth orbit technology in Amazon’s Project Kuiper will bring unprecedented speed and security by providing off-the-shelf private connectivity that will let businesses connect the edge of their network directly to their AWS API infrastructure, extending the edge to land, sea, and air."
  },
  {
    "Position": "53",
    "Session Type": "Breakout session",
    "Topic": "Analytics",
    "Industry": "Advertising & Marketing",
    "Area of Interest": "Sports",
    "Level": "200 – Intermediate",
    "Role": "Sales / Marketing",
    "Service": "",
    "Session Title": "In this session, learn how Formula One (F1) is connecting customer data across properties in real time, helping them deepen their understanding of customers; creating more accurate segmentation, activation, and measurement; and unlocking new possibilities for F1 to surprise and delight their global fanbase. Hear how these efforts give them the platform to deliver everything from the brilliant basics to the rule-busting ideas for customer engagement, opening up new audiences and revenue streams."
  },
  {
    "Position": "54",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Analytics",
    "Area of Interest": "Sustainability",
    "Level": "200 – Intermediate",
    "Role": "",
    "Service": "",
    "Session Title": "Navigating new and existing ESG regulations, such as the Corporate Sustainability Reporting Directive (CSRD), can be a daunting task due to the complexity of trusted and auditable data. In this session, learn how an ESG insights platform (made possible with the power of three—AWS customers, Sustainability Data Fabric, and AWS Partners Blue Prism and FlexZero) can help consolidate siloed data sources into a unified datastore, streamline reporting processes, and enable data sharing across organizations. Dive deep into Sustainability Data Fabric, a purpose-built, flexible, and extensible AWS solution accelerator that provides best practices for streamlined enterprise data management while taking into consideration data quality, security, cataloging, lineage, and data sharing."
  },
  {
    "Position": "55",
    "Session Type": "Breakout session",
    "Topic": "Serverless Compute & Containers",
    "Industry": "Open Source",
    "Area of Interest": "400 – Expert",
    "Level": "400 – Expert",
    "Role": "",
    "Service": "",
    "Session Title": "Did you learn serverless best practices but are unsure about implementation? Have you used Powertools for AWS Lambda but felt you barely scratched the surface? This session dives deep into observability practices, resilient data pipelines with AWS Batch, safe retries with idempotency, mono- and multi-function APIs, and more. Learn about each practice in depth, achieve expert-level knowledge, and hear from maintainers about what’s next."
  },
  {
    "Position": "56",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Generative AI",
    "Area of Interest": "Strategy & Transformation",
    "Level": "100 – Foundational",
    "Role": "Amazon Q Business",
    "Service": "",
    "Session Title": "Over the course of 90 minutes, this session for leaders covers the generative AI factors that help you make clear decisions on projects that incorporate AI. Come learn about the basics of generative AI terminology and the potential benefits and risks of using generative AI. Also, learn the steps for planning a generative AI project and the key considerations for building a generative AI–ready organization."
  },
  {
    "Position": "57",
    "Session Type": "Breakout session",
    "Topic": "Serverless Compute & Containers",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Software and Internet",
    "Level": "100 – Foundational",
    "Role": "Solution / Systems Architect",
    "Service": "",
    "Session Title": "Are you planning to build a new software as a service (SaaS) application using serverless on AWS? Do you want to modernize an existing SaaS application to serverless and want to know more about multi-tenancy? In this session, explore the fundamentals of serverless at AWS. Learn about AWS Lambda, Amazon API Gateway, and event-driven integration services, discover how to build your first serverless application, and learn how to handle multi-tenant architectures for SaaS applications."
  },
  {
    "Position": "58",
    "Session Type": "Breakout session",
    "Topic": "Migration & Modernization",
    "Industry": "Migration & Modernization",
    "Area of Interest": "Customer Stories",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "Moody’s runs dozens of .NET applications on Amazon EC2 for Windows Server. As part of its modernization strategy, Moody’s replatformed its critical legacy applications to Amazon EKS with Windows support, achieving cost reduction, better performance, and more flexibility for its developers. In this session, Moody’s shares key takeaways and best practices from its successful replatform, including how it overcame challenges and maximized its platform engineering investments. Leave this session with concrete examples and techniques to replatform your own .NET Framework applications on Amazon EKS."
  },
  {
    "Position": "59",
    "Session Type": "Breakout session",
    "Topic": "DevOps & Developer Productivity",
    "Industry": "Innovation on AWS",
    "Area of Interest": "Network & Infrastructure Security",
    "Level": "200 – Intermediate",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "In this session, learn how to use AWS CloudFormation and the AWS CDK to deploy cloud applications in regulated environments while enforcing security controls. Find out how to catch issues early with cdk-nag, validate your pipelines with cfn-guard, and protect your accounts from unintended changes with CloudFormation Hooks."
  },
  {
    "Position": "60",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Generative AI",
    "Area of Interest": "Microsoft & .NET",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "Microsoft workloads—such as SharePoint and File Server—are rich datasets for Amazon Q Business. In this session, learn how to extract the maximum value from these datasets by enabling Amazon Q Business to unleash generative AI power and by implementing data guardrails at the same time. See how Amazon Q Business integrates with SharePoint and Amazon FSx, indexes data, and enforces data guardrails based on Active Directory identities."
  },
  {
    "Position": "61",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Databases",
    "Area of Interest": "Financial Services",
    "Level": "300 – Advanced",
    "Role": "Amazon Aurora",
    "Service": "",
    "Session Title": "In this session, discover how Abrigo (a leading fintech company for over 2,400 community financial institutions) used the AWS global services to successfully migrate to AWS and modernize their infrastructure, achieving significant operational efficiencies and cost savings. Explore the challenges faced by Abrigo and the strategic solutions deployed, getting actionable insights for organizations embarking on their cloud transformation journeys. Join this session to learn key strategies for seamless migration, automation, and infrastructure modernization, backed by real-world results and best practices."
  },
  {
    "Position": "62",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Advertising & Marketing",
    "Area of Interest": "Amazon",
    "Level": "200 – Intermediate",
    "Role": "Tech Explorer",
    "Service": "",
    "Session Title": "In the ad-tech business, speed and managing infrastructure costs are the keys to success. The less the final user waits for an ad, the higher the probability of that user clicking on the ad. Showing the right ad to the right user is an incredibly complex challenge that involves multiple disciplines, such as artificial intelligence, data science, and software engineering. Learn how Smadex uses different AWS technologies and services to be able to do it one million times per second with a 100-millisecond constraint. Also learn how they are extending their retention capacity while reducing the infrastructure costs by 45%."
  },
  {
    "Position": "63",
    "Session Type": "Breakout session",
    "Topic": "Storage",
    "Industry": "Storage",
    "Area of Interest": "Manufacturing & Industrial",
    "Level": "200 – Intermediate",
    "Role": "IT Professional / Technical Manager",
    "Service": "Amazon Monitron",
    "Session Title": "In this session, hear how Gousto, a British meal kit retailer, built a scalable Industrial Data Fabric (IDF) to gain real-time and historical operations visibility. Gousto relies on equipment vendors to provide much of their data, which can add complexity, cost, and time delays. To resolve these challenges, AWS and an AWS Partner helped build a modern IDF using AWS IoT SiteWise, AWS IoT Core, and Amazon Monitron. Hear about the business benefits of their unified namespace architecture and how the customer uses advanced analytics, ML, and generative AI on top of their industrial data foundation."
  },
  {
    "Position": "64",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Aerospace & Satellite",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "300 – Advanced",
    "Role": "Solution / Systems Architect",
    "Service": "",
    "Session Title": "Over the past two years, climate change increased flood risks by 23% with an estimated 1.81 billion people now facing flood risk and consequences like disease, clean water scarcity, and food insecurity. Response organizations need precise, real-time updates to save lives and reduce the impact of flooding on communities. Discover how ICEYE and AWS combine satellite-acquired geospatial imagery and generative AI to help first responders access precise insights and take action faster. Find out how ICEYE uses Amazon SageMaker and Amazon Bedrock foundation models to capture and automate disaster location and impact data for response teams."
  },
  {
    "Position": "65",
    "Session Type": "Breakout session",
    "Topic": "Cloud Operations",
    "Industry": "Media & Entertainment",
    "Area of Interest": "Customer Stories",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "Amazon Elastic Compute Cloud (Amazon EC2)",
    "Session Title": "Netflix operates at full active across four AWS Regions, serving their global traffic by intelligently steering users and managing costs via thousands of auto scaling compute server groups. At various times, traffic surges hit their service that could exceed capacity. In this session, walk through how Netflix solves these problems by pairing predictive automated pre-scaling with fast reactive auto scaling in combination with advanced resilience techniques like prioritized load shedding, cross-Region traffic shifting, targeted capacity injection by service criticality, and more. Discover how to maintain a low level of spend while being ready for sudden load spikes."
  },
  {
    "Position": "66",
    "Session Type": "Breakout session",
    "Topic": "Business Applications",
    "Industry": "Networking",
    "Area of Interest": "Aerospace & Satellite",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "",
    "Session Title": "Active satellites are forecasted to grow from 8,377 to about 58,000 by 2030. Inter-satellite networks enable more reliable, accessible terrestrial networks and lay the foundation for space networks. However, simulating network connectivity across many orbital and ground objects requires a lot of time and computational resources. In this session, learn how AWS enables Rivada Networks to simulate, visualize, and orchestrate space-to-ground networks using digital twins of their constellation and user terminals. Discover how, using AWS, Rivada can shorten the constellation configuration time across their network from hours to seconds and leverage a variety of enterprise-grade networking protocols."
  },
  {
    "Position": "67",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Customer Stories",
    "Level": "200 – Intermediate",
    "Role": "IT Professional / Technical Manager",
    "Service": "Amazon SageMaker",
    "Session Title": "This session is delivered in Korean. Startups have diverse requirements for a variety of generative AI workloads, from providing their own foundation models for enterprise customers to creating content for end users. In this session, learn how startups can build generative AI applications on AWS at scale. Discover how Upstage’s Solar model is 100% pretrained with Amazon SageMaker and uses AWS Marketplace so that global customers can build their own fine-tuned models easily. Find out how Miridih’s MiriCanvas provides AI-based creative design features, such as recommending similar design templates and generating suitable content in Amazon Bedrock with over 50 million vector data points using Amazon OpenSearch Service."
  },
  {
    "Position": "68",
    "Session Type": "Breakout session",
    "Topic": "Kubernetes",
    "Industry": "Migration & Modernization",
    "Area of Interest": "Modernization",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "A wide range of companies, from the most innovative startups to the world’s leading enterprises, are running their internal platforms on Amazon EKS, helping them to accelerate developer velocity and increase the pace of innovation. In this session, learn about best practices that AWS has developed over years of helping thousands of customers build and scale their internal platforms on Amazon EKS."
  },
  {
    "Position": "69",
    "Session Type": "Breakout session",
    "Topic": "New to AWS",
    "Industry": "Developer Community",
    "Area of Interest": "100 – Foundational",
    "Level": "100 – Foundational",
    "Role": "",
    "Service": "",
    "Session Title": "New to AWS re:Invent? Come to this informational session to learn about navigating content, getting around campus, accessibility options, the Expo Hall, activities, and much more. There will be time for Q&A to help you get the most out of your week. Also, use this time to network with other first-time attendees."
  },
  {
    "Position": "70",
    "Session Type": "Breakout session",
    "Topic": "Security, Compliance & Identity",
    "Industry": "Content Delivery",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "300 – Advanced",
    "Role": "AWS Shield",
    "Service": "",
    "Session Title": "Securing web applications in today’s ever-evolving threat landscape is crucial. As threats evolve, so must security controls and countermeasures. In this chalk talk, dive into how AWS WAF seamlessly integrates with other AWS services, making it possible for you to construct a resilient, multi-layered defense strategy. Learn about uncommon use cases and how to address even the most unconventional threats."
  },
  {
    "Position": "71",
    "Session Type": "Breakout session",
    "Topic": "Security, Compliance & Identity",
    "Industry": "Serverless Compute & Containers",
    "Area of Interest": "Application Integration",
    "Level": "300 – Advanced",
    "Role": "Solution / Systems Architect",
    "Service": "AWS Lambda",
    "Session Title": "Building with serverless enables organizations to build and deploy applications without managing underlying infrastructure. Serverless strengthens your overall security posture by reducing attack surface and shifting security operations to AWS. In this session, explore how to implement security best practices across the software delivery lifecycle and into production deployment. Hear lessons learned from working with numerous enterprise customers that can help your builders be productive and innovative within security guardrails."
  },
  {
    "Position": "72",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Analytics",
    "Area of Interest": "Manufacturing & Industrial",
    "Level": "200 – Intermediate",
    "Role": "IT Professional / Technical Manager",
    "Service": "Amazon RedShift",
    "Session Title": "This session is delivered in Korean. LG Electronics has found that generative AI workloads using Amazon Bedrock have strengthened the competitiveness of their product lines and boosted individual productivity. For example, a text-to-SQL solution in the CRM built in Amazon Redshift provides a user-friendly experience for business users to securely search and analyze internal data without relying on data analysts. LG also built the Product 360 platform, a multi-type document data extraction and integrated search system for their display product and business data. In this session, learn about best practices to empower employees with your company’s knowledge and how to reduce decision-making time."
  },
  {
    "Position": "73",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Generative AI",
    "Area of Interest": "200 – Intermediate",
    "Level": "200 – Intermediate",
    "Role": "",
    "Service": "",
    "Session Title": "Could your machine learning (ML) workflows use some DevOps agility? In this session, explore how to bring DevOps-style practices into building, training, and deploying ML models. Also learn how to address the challenges associated with handoffs between data engineers, data scientists, software developers, and operations through the use of tools, automation, processes, and teamwork."
  },
  {
    "Position": "74",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Generative AI",
    "Area of Interest": "100 – Foundational",
    "Level": "100 – Foundational",
    "Role": "",
    "Service": "",
    "Session Title": "In this session, you learn how to create and optimize prompts for a variety of generative AI models. First, this session covers the basics of foundation models (FMs), including a subset of FMs called large language models (LLMs). Then, the session covers the fundamental concepts of prompt engineering, such as the different elements of a prompt and some general best practices for using prompts effectively. Finally, the session provides information about basic prompt techniques, including zero-shot, few-shot, and chain-of-thought prompting."
  },
  {
    "Position": "75",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Migration & Modernization",
    "Area of Interest": "Retail & Consumer Goods",
    "Level": "200 – Intermediate",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "Kellogg Company, the global snack and cereal powerhouse, relies on cloud technologies to power everything from manufacturing to supply chain to pricing. When it split into two companies, Kellanova (snacks) and WK Kellogg Co (cereal), the companies’ CIOs knew they needed to build a dynamic environment on AWS to optimize their SAP workloads, enhance revenue growth management and trade promotion management, and increase sales. In this session, learn the instrumental role AWS played in their transformation journey and how the companies are using the power of the cloud and AI, including Amazon SageMaker and Amazon Bedrock, to unlock new opportunities."
  },
  {
    "Position": "76",
    "Session Type": "Breakout session",
    "Topic": "Kubernetes",
    "Industry": "Application Integration",
    "Area of Interest": "Event-Driven Architecture",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "Most Kubernetes customers already use event-driven architectures (EDAs). However, they often face the challenge of either supporting two different platforms for deploying applications to Amazon EKS and AWS Lambda or dealing with a clunky, inefficient process involving infrastructure as code and ticketing systems. In this session, learn how to deploy EDAs through Kubernetes APIs using tools such as ACK. Platform engineers can extend their existing Kubernetes platform to deploy composable EDAs, giving developers easy access."
  },
  {
    "Position": "77",
    "Session Type": "Breakout session",
    "Topic": "Business Applications",
    "Industry": "Security, Compliance & Identity",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "100 – Foundational",
    "Role": "Solution / Systems Architect",
    "Service": "",
    "Session Title": "In this session, discover how leading businesses are using Amazon One Enterprise to enhance security by authenticating employees using their unique palm signature with data that is encrypted and isolated on AWS. Hear how this is helping them optimize operational overhead so that they can streamline operations through cloud-based management and spend less time monitoring access. Explore how Amazon One Enterprise simplifies employee access with a fast, convenient, contactless way to gain authorized access across workspaces without physical cards, badges, PINs, or passcodes."
  },
  {
    "Position": "78",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Generative AI",
    "Level": "200 – Intermediate",
    "Role": "",
    "Service": "",
    "Session Title": "In this session, learn how Amazon Q Apps empowers every employee to quickly turn their ideas into generative AI–powered apps to streamline tasks and boost individual and team productivity. Explore how these secure and customized apps are built on top of your enterprise knowledge with Amazon Q Business."
  },
  {
    "Position": "79",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Analytics",
    "Area of Interest": "Business Intelligence",
    "Level": "200 – Intermediate",
    "Role": "",
    "Service": "",
    "Session Title": "Learn how you can migrate legacy reporting to the cloud and deliver a unified user experience at scale with Amazon QuickSight. In this session, hear how AWS customers consolidated dashboarding and reporting workloads in QuickSight, lowering costs while delivering a unified user experience at scale. Discover how to automate high-demand reporting workloads using QuickSight’s paginated reporting APIs. Whether seeking cost efficiencies, enhanced collaboration, or improved agility, this session provides actionable insights for optimizing BI across your organization to unlock the full potential of modern, cloud-based reporting with Amazon QuickSight."
  },
  {
    "Position": "80",
    "Session Type": "Breakout session",
    "Topic": "Storage",
    "Industry": "Migration & Modernization",
    "Area of Interest": "Modernization",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "Managing file transfers can come at a high cost as you maintain infrastructure, licensing, resources, and adherence to regulatory and business requirements. In this session, learn how AWS Transfer Family provides fully managed, highly available file transfers over protocols such as SFTP and AS2. Hear how Transfer Family helps make sure that your data arrives on time, that it is secure and compliant, and that performance and costs scale with your workflows. Learn about these benefits while also considering how you can break down data silos and redirect resources to focus on adding value to your business."
  },
  {
    "Position": "81",
    "Session Type": "Breakout session",
    "Topic": "Storage",
    "Industry": "Data Protection",
    "Area of Interest": "Modernization",
    "Level": "200 – Intermediate",
    "Role": "Amazon FSx for NetApp ONTAP",
    "Service": "",
    "Session Title": "Migrating file-based workloads to the cloud without adversely affecting performance or availability can be challenging at scale. The Amazon FSx family can address this network-attached storage (NAS) challenge, and as a fully managed service it delivers shared storage, data resiliency, and management compatibilities without application or code changes. In this session, learn from industry experts how you can improve agility, reduce costs, and scale automatically by exploring examples of use cases from media and entertainment, education, healthcare and life sciences, and telecommunications customers. Leave this session feeling more confident to create your own migration plan."
  },
  {
    "Position": "82",
    "Session Type": "Breakout session",
    "Topic": "Analytics",
    "Industry": "Content Delivery",
    "Area of Interest": "Media & Entertainment",
    "Level": "200 – Intermediate",
    "Role": "Solution / Systems Architect",
    "Service": "AWS Elemental MediaConnect",
    "Session Title": "As the first professional sports league in North America to produce and distribute a live game entirely in the cloud, the NHL is on the cutting edge of sports production innovation―lowering costs, reducing carbon emissions, and increasing flexibility and creativity. Join this session to hear how the NHL’s investment in live cloud production and the development of engaging analytics allows them to nimbly provide new, creative, and engaging content for fans."
  },
  {
    "Position": "83",
    "Session Type": "Breakout session",
    "Topic": "Serverless Compute & Containers",
    "Industry": "Application Integration",
    "Area of Interest": "Lambda-Based Applications",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "In this session, explore key best practices for building multi-tenant solutions using AWS serverless services. Dive deep into leveraging AWS Lambda, AWS Step Functions, Amazon SQS, Amazon SNS, and Amazon EventBridge to achieve data isolation while scaling with performance efficiency. Learn how a serverless-first approach enables faster time-to-market for multi-tenant architectures. Leave with practical insights into designing and implementing serverless multi-tenant solutions that ensure proper data separation and meet scalability and performance requirements."
  },
  {
    "Position": "84",
    "Session Type": "Breakout session",
    "Topic": "Serverless Compute & Containers",
    "Industry": "Application Integration",
    "Area of Interest": "Event-Driven Architecture",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "User interfaces by nature are event-driven—interactions trigger events that drive the application. But, integrations between the frontend and backend are often built synchronously using a request/response pattern. This session explores patterns to enable asynchronous, event-driven integrations with the frontend. It’s designed for architects and frontend, backend, and full-stack engineers. Leave this session with real-world patterns that bring the agility and responsiveness of event-driven architecture across client-server interactions."
  },
  {
    "Position": "85",
    "Session Type": "Breakout session",
    "Topic": "Databases",
    "Industry": "Energy & Utilities",
    "Area of Interest": "Energy & Utilities",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "Amazon Keyspaces (for Apache Cassandra) is a globally scalable, serverless, fully managed database service with up to 99.999% availability. In this session, learn how GE Vernova, a leader in electrifying and decarbonizing the world, uses Amazon Keyspaces to store and query a massive 600 TB of industrial time-series data for its Asset Performance Management (APM) software. Dive deep into GE’s 600 TB migration from ScyllaDB to Amazon Keyspaces, and explore the benefits it observed, including improved availability and scalability. Gain insights into the AWS services it utilized and the challenges it overcame during this large-scale migration."
  },
  {
    "Position": "86",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "Prompt engineering is the important process where you guide large language models (LLMs) to produce your desired outputs. This session provides an overview of prompt engineering best practices and covers how you can choose the most appropriate formats, phrases, words, and symbols that will help you get the most out of generative AI solutions and improve accuracy and performance. With the Anthropic Claude 3 LLM used as an example, learn how prompt engineering helps to solve complex customer use cases. Explore various system designs for how prompts can be integrated with your architecture and discover how to use API parameters for tuning the model parameters using Amazon Bedrock."
  },
  {
    "Position": "87",
    "Session Type": "Breakout session",
    "Topic": "Storage",
    "Industry": "Storage",
    "Area of Interest": "Application Security",
    "Level": "200 – Intermediate",
    "Role": "System Administrator",
    "Service": "AWS Key Management Service (AWS KMS)",
    "Session Title": "Amazon EBS snapshots provide a secure, simple mechanism to back up and restore block data, boot volumes, and on-premises data. Learn how they deliver data protection while helping organizations reduce storage costs. Explore EBS volume and snapshot encryption, volume creation and recovery from a snapshot, and using Amazon Data Lifecycle Manager to automate your snapshots workflow across AWS accounts and Regions. Discover how you can strengthen the security posture of your snapshots to protect them against ransomware and easily read files from EBS snapshots. Hear from SAP on how it uses EBS snapshots to ensure data integrity and compliance for tens of thousands of SAP systems and thousands of customers."
  },
  {
    "Position": "88",
    "Session Type": "Breakout session",
    "Topic": "New to AWS",
    "Industry": "Migration & Modernization",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "100 – Foundational",
    "Role": "Solution / Systems Architect",
    "Service": "Migration Evaluator",
    "Session Title": "AWS has helped hundreds of thousands of businesses both big and small migrate and modernize their business through the AWS Migration Acceleration Program (MAP). In this session, learn how MAP is meticulously designed to guide businesses like yours seamlessly, not just during the migration to AWS, but also as you embrace cutting-edge technologies, modernize digital operations, and pave the way for future growth. Unlock the full potential of your cloud journey with MAP."
  },
  {
    "Position": "89",
    "Session Type": "Breakout session",
    "Topic": "DevOps & Developer Productivity",
    "Industry": "Serverless Compute & Containers",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "300 – Advanced",
    "Role": "IT Executive",
    "Service": "",
    "Session Title": "AWS AppSync makes it easier for developers to build applications that consume real-time data updates and events, like live sports scores and stats, group chat messages, prices, or location and schedule updates. With AWS AppSync managed WebSocket channels, you can easily scale to connect millions of users and deliver billions of messages. In this session, learn how organizations like PGA Tour are using AWS AppSync to deliver real-time event updates to their application users. Additionally, get an overview of new features like enhanced filtering options and native integration with Amazon EventBridge."
  },
  {
    "Position": "90",
    "Session Type": "Breakout session",
    "Topic": "Databases",
    "Industry": "Microsoft & .NET",
    "Area of Interest": "Cost Optimization",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "SQL Server cost optimization remains a top priority for AWS users. That's because database workloads typically depend on high memory and IOPS and less on vCPUs. In this session, learn how to reduce the cost of running SQL Server on Amazon EC2 while increasing the price performance by using the Optimize CPU feature on Amazon EC2. This session shares insights obtained through extensive testing including rigorous load testing with HammerDB simulations. Learn best practices you can use to maximize savings without sacrificing performance."
  },
  {
    "Position": "91",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "",
    "Service": "",
    "Session Title": "Organizations need robust, scalable, and cost-effective solutions to deploy and serve foundation models (FMs). This session explores how to use Amazon SageMaker to deploy FMs to make predictions at the best price performance for any use case. Get a detailed overview of deployment strategies to support large-scale generative AI inferencing, and learn how to architect solutions that optimize performance and cost."
  },
  {
    "Position": "92",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Compute",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "Edge computing brings data processing closer to the source, reducing latency and bandwidth usage, which is crucial for real-time applications like autonomous vehicles and IoT devices. According to Fortune Business Insights, the global edge computing market size was valued at $15.96 billion in 2023 and is projected to grow from $21.41 billion in 2024 to $216.76 billion by 2032. This underscores the increasing demand for efficient, immediate data processing capabilities and the shift from centralized to distributed computing frameworks. In this session, learn how deploying models and transaction applications at the edge on small form-factor computers can help businesses continue operations during connectivity disruptions, forecast inventory, reduce losses, and improve customer experience through enhanced edge intelligence."
  },
  {
    "Position": "93",
    "Session Type": "Breakout session",
    "Topic": "Architecture",
    "Industry": "SaaS",
    "Area of Interest": "400 – Expert",
    "Level": "400 – Expert",
    "Role": "",
    "Service": "",
    "Session Title": "Building a multi-tenant SaaS architecture is a balancing act. Finding the right blend of cost efficiency, scale, resilience, and operational agility can be challenging. It’s here that a cell-based architecture can often be a natural fit. The cell-based model gives you new ways to approach tenant isolation, deployment, scaling, regional distribution, and tiering, bringing a range of new possibilities to your SaaS architecture and operational footprint. In this session, dive deep on cell-based multi-tenant architecture and discover the strategies, patterns, and considerations that come with employing this model."
  },
  {
    "Position": "94",
    "Session Type": "Breakout session",
    "Topic": "New to AWS",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Software and Internet",
    "Level": "200 – Intermediate",
    "Role": "IT Executive",
    "Service": "",
    "Session Title": "With growth being a top priority for organizations, it’s important to identify programs that can help you scale. In this session, learn from AWS executives about how to expand into new markets with AWS, use the AWS sales team to co-sell your solution, run co-marketing campaigns, and sell on AWS Marketplace. Explore next steps for how and who to engage with at AWS to accelerate your growth in 2025 and beyond."
  },
  {
    "Position": "95",
    "Session Type": "Breakout session",
    "Topic": "Storage",
    "Industry": "Storage",
    "Area of Interest": "Media & Entertainment",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "Amazon Simple Storage Service (Amazon S3)",
    "Session Title": "Studio applications at Netflix generate petabytes of data consisting of billions of multimedia assets, such as images, videos, and text, that are delivered and stored securely in Amazon S3. In this session, explore the evolution of the media storage layer at Netflix, including organizing, tracking, and managing the access control and lifecycle of these assets. In addition, Netflix’s ever-growing content landscape has presented several challenges in scaling their storage backend infrastructure. Gain valuable insights into how Netflix tackled scaling challenges, and learn what media-specific features they added to effectively serve their media partners and applications."
  },
  {
    "Position": "96",
    "Session Type": "Breakout session",
    "Topic": "Serverless Compute & Containers",
    "Industry": "Application Integration",
    "Area of Interest": "300 – Advanced",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "In this session, explore how Amazon API Gateway private REST APIs can help organizations address the challenges of managing internal API workloads at scale. Learn about capabilities like access control, resource isolation, and scalability for securing and maintaining consistent API strategies across teams. Discover the latest enhancements for private REST API endpoints. Gain insights from real-world experience using these APIs to streamline workflows, enhance collaboration, and build a secure, scalable API ecosystem. Leave with a deeper understanding of how to secure your APIs and practical approaches for building these endpoints."
  },
  {
    "Position": "97",
    "Session Type": "Breakout session",
    "Topic": "Architecture",
    "Industry": "New to AWS",
    "Area of Interest": "Front-End Web & Mobile",
    "Level": "200 – Intermediate",
    "Role": "",
    "Service": "",
    "Session Title": "In this session, learn about patterns and techniques for architecting to handle rapid growth and success of your business’s infrastructure on AWS. Learn how to think about when to scale up versus when to scale out, where caching can help you best, and common points on the journey where breaking up your application into new services makes sense. From utilizing already highly scalable AWS services to architecting distributed system patterns, there are a number of choices you can make early on to help you overcome some common infrastructure challenges later. Come learn how to be ready to overcome the infrastructure challenges that can come with success."
  },
  {
    "Position": "98",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Serverless Compute & Containers",
    "Area of Interest": "Energy & Utilities",
    "Level": "300 – Advanced",
    "Role": "300 – Advanced",
    "Service": "Solution / Systems Architect",
    "Session Title": "Methane is the second-largest contributor to climate change behind carbon dioxide. In this session, hear how Scepter Inc., ExxonMobil, and AWS are developing a data analytics platform to characterize and quantify methane emissions. Learn how Scepter data fusion collects and aggregates ground-based, airborne, and in-orbit sensors. Find out how Scepter uses the AWS Global Infrastructure, AWS Lambda, and Amazon API Gateway to process and aggregate large amounts of data, pinpoint emissions, and help organizations like ExxonMobil enable more rapid and effective mitigation. Discover how this solution can also help agriculture, waste management, healthcare, retail, and transportation industries monitor carbon dioxide and air particulates."
  },
  {
    "Position": "99",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Security, Compliance & Identity",
    "Area of Interest": "Cross-Industry Solutions",
    "Level": "200 – Intermediate",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Session Title": "Looking to integrate with generative AI workloads through user-friendly bots? Join this session to discover how AWS Wickr can help you gain granular control over access policies and regulate who can engage with generative AI models. Learn how Wickr facilitates auditing and regulatory requirements with a comprehensive history of generative AI interactions. Wickr’s intuitive interface promotes transparency and accountability by allowing you to manage and monitor interactions. Whether you are concerned with regulatory compliance or organizational governance, discover how Wickr can help you streamline the integration process so that you can unlock the full potential of generative AI while maintaining control and oversight."
  },
  {
    "Position": "100",
    "Session Type": "Breakout session",
    "Topic": "AI/ML",
    "Industry": "Content Delivery",
    "Area of Interest": "Media & Entertainment",
    "Level": "200 – Intermediate",
    "Role": "Business Executive",
    "Service": "Amazon Bedrock",
    "Session Title": "Integrated with Sky TV, NOW TV, and the Sky Sports app, Sky Sports+ is a fully automated end-to-end live events platform that provides up to 100 concurrent live video streams. In this session, discover how Sky Sports+ uses AWS to deliver features for an enhanced immersive viewing experience, exclusive access to documentaries, and a dedicated linear channel. Explore how AWS powered automation, data mesh, acquisition platform, cloud production expansion, and generative AI are used to augment Sky’s platform capabilities across digital and linear channels."
  }
]