[
  {
    "Position": "1",
    "Session Type": "Builders' session",
    "Topic": "AI/ML",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Generative AI",
    "Level": "400 – Expert",
    "Role": "IT Professional / Technical Manager",
    "Service": "Amazon SageMaker",
    "Service Detail": "Amazon SageMaker HyperPod",
    "Description": "Amazon SageMaker HyperPod removes the undifferentiated heavy lifting involved in building and optimizing machine learning (ML) infrastructure for training foundation models (FMs), reducing training time by up to 40%. In this builders’ session, learn how to pre-train a large language model (LLM) using Slurm on SageMaker HyperPod. Explore the model pre-training workflow from start to finish, including setting up clusters, troubleshooting convergence issues, and running distributed training to improve model performance. You must bring your laptop to participate."
  },
  {
    "Position": "2",
    "Session Type": "Innovation Talks",
    "Topic": "AI/ML",
    "Industry": "Healthcare & Life Sciences",
    "Area of Interest": "Generative AI",
    "Level": "200 – Intermediate",
    "Role": "IT Professional / Technical Manager",
    "Service": "IT Professional / Technical Manager",
    "Service Detail": "Amazon Bedrock",
    "Description": "Healthcare and life sciences are harnessing the power of generative AI to unlock new possibilities for drug discovery, clinical trials, and patient care. In this talk, explore how leading healthcare and life sciences organizations are successfully integrating generative AI throughout their organizations to deliver real business value. Explore how these organizations are building enterprise-wide data strategies and data systems to break down internal data silos and fuel their data and generative AI initiatives. Gain insights and best practices for successfully operationalizing and scaling generative AI from pilot projects to production deployments across the health continuum."
  },
  {
    "Position": "3",
    "Session Type": "Builders' session",
    "Topic": "AI/ML",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Event-Driven Architecture",
    "Level": "300 – Advanced",
    "Role": "Event-Driven Architecture",
    "Service": "Public Sector",
    "Service Detail": "300 – Advanced",
    "Description": "In this builders’ session, explore how AI and machine learning can revolutionize traffic management to enhance safety and reduce congestion in urban areas. Gain hands-on experience in deploying technologies to collect and analyze real-time traffic data, build predictive models, and optimize traffic flow dynamically. Create a simulated traffic environment, configure sensors, and establish a data pipeline. Build and train a machine learning model and then deploy it using serverless computing for real-time predictions. Ideal for developers, data scientists, and traffic management professionals, this session aims to create a functional AI-driven traffic management prototype. You must bring your laptop to participate."
  },
  {
    "Position": "4",
    "Session Type": "Builders' session",
    "Topic": "AI/ML",
    "Industry": "Automotive",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "Data Engineer",
    "Service": "Amazon Bedrock",
    "Service Detail": "",
    "Description": "Join this hands-on session to build a generative AI–powered vehicle diagnostics and troubleshooting application. Use the Generative AI Application Builder (GAAB) on AWS with guardrails for Amazon Bedrock to analyze vehicle issues, diagnostic data (DTCs, CAN bus data), and sensor readings. Explore how to configure and deploy generative AI applications with Retrieval Augmented Generation (RAG) to query repair manuals and historical records, use vehicle symptoms or DTCs to generate root cause analyses and recommended repairs, and build a workflow using agents for Amazon Bedrock for multistep automotive diagnostic tasks. Also learn how to use prompt engineering to generate outcomes in different languages. You must bring your laptop to participate."
  },
  {
    "Position": "5",
    "Session Type": "Builders' session",
    "Topic": "Databases",
    "Industry": "DevOps & Developer Productivity",
    "Area of Interest": "Open Source",
    "Level": "400 – Expert",
    "Role": "",
    "Service": "",
    "Service Detail": "",
    "Description": "With ever-growing data volumes and real-time requirements, tuning Apache Iceberg for performance while controlling costs can be challenging. This builders’ session dives deep into how Iceberg works, its configuration, advanced performance optimization options, and how to tune Iceberg for different workload patterns. Whether you have petabyte-scale batch loads or real-time streaming ingestion, learn about common issues, performance bottlenecks, and best practices to help keep costs under control while turbocharging Iceberg performance at scale. You must bring your laptop to participate."
  },
  {
    "Position": "6",
    "Session Type": "Builders' session",
    "Topic": "Security, Compliance & Identity",
    "Industry": "Application Security",
    "Area of Interest": "Application Security",
    "Level": "200 – Intermediate",
    "Role": "IT Professional / Technical Manager",
    "Service": "Amazon Cognito",
    "Service Detail": "Amazon Verified Permissions",
    "Description": "In this builders’ session, gain hands-on experience with modern authorization in a microservices-based architecture on AWS. Learn how to externalize and customize authentication with Amazon Cognito, apply fine-grained authorization with policy-based access controls using Amazon Verified Permissions, and integrate with APIs that are protected by Amazon API Gateway. You must bring your laptop to participate."
  },
  {
    "Position": "7",
    "Session Type": "Builders' session",
    "Topic": "Databases",
    "Industry": "Innovation on AWS",
    "Area of Interest": "Innovation on AWS",
    "Level": "400 – Expert",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Service Detail": "",
    "Description": "In this builders’ session, learn how to turn a new business idea into a fully functional data model in Amazon DynamoDB. Discover how to translate business requirements into access patterns and access patterns into a fully optimized schema design. You must bring your laptop to participate."
  },
  {
    "Position": "8",
    "Session Type": "Spotlight labs",
    "Topic": "Security, Compliance & Identity",
    "Industry": "Application Security",
    "Area of Interest": "Application Security",
    "Level": "200 – Intermediate",
    "Role": "AWS Identity and Access Management (IAM)",
    "Service": "",
    "Service Detail": "",
    "Description": "This lab demonstrates the concept of assuming an AWS Identity and Access Management (IAM) role. Troubleshoot and fix access issues while applying least privilege concepts in your solution."
  },
  {
    "Position": "9",
    "Session Type": "Builders' session",
    "Topic": "Security, Compliance & Identity",
    "Industry": "Serverless Compute & Containers",
    "Area of Interest": "Data Protection",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "Amazon Elastic Container Service (Amazon ECS)",
    "Service Detail": "AWS Fargate",
    "Description": "Many organizations running containerized workloads need to ensure that they are meeting stringent data protection and compliance requirements, including those pertaining to the HIPAA Privacy and Security Rules for securing protected health information (PHI). This builders’ session focuses on how you can use Amazon ECS and other AWS services to run container applications containing PHI. Learn best practices with Amazon ECS, Amazon ECR, AWS Fargate, Amazon GuardDuty, and more. You must bring your laptop to participate."
  },
  {
    "Position": "10",
    "Session Type": "Innovation Talks",
    "Topic": "Architecture",
    "Industry": "Customer Stories",
    "Area of Interest": "Customer Stories",
    "Level": "200 – Intermediate",
    "Role": "Developer / Engineer",
    "Service": "Solution / Systems Architect",
    "Service Detail": "AWS Well-Architected Tool",
    "Description": "This talk explores how advanced architectural breakthroughs and generative AI are revolutionizing application design. Learn how to modernize applications using cutting-edge tools and techniques, develop a modern data strategy, and navigate the rapidly evolving cloud landscape. Explore the innovative ways AWS customers are building applications in the cloud, and discover best practices to help you navigate the rapidly changing architectural landscape."
  },
  {
    "Position": "11",
    "Session Type": "Builders' session",
    "Topic": "Storage",
    "Industry": "Data Protection",
    "Area of Interest": "Data Protection",
    "Level": "400 – Expert",
    "Role": "IT Administrator",
    "Service": "System Administrator",
    "Service Detail": "Amazon Data Lifecycle Manager",
    "Description": "Organizations use Amazon EBS snapshots to securely protect data on Amazon EBS volumes. Join this builders’ session to learn how to design and build automated application-consistent Amazon EBS snapshot workflows using Amazon Data Lifecycle Manager. Build snapshot automation into your existing data protection scripts, and explore how to design and code new snapshot workflows. This session also covers topics such as AWS account security, securing your snapshots from public access, secure sharing, and the Amazon EBS snapshot encryption architecture. Learn how to protect your data from accidental deletions, increase compliance, and safeguard against ransomware. You must bring your laptop to participate."
  },
  {
    "Position": "12",
    "Session Type": "Bootcamp",
    "Topic": "Architecture",
    "Industry": "New to AWS",
    "Area of Interest": "Global Infrastructure",
    "Level": "100 – Foundational",
    "Role": "IT Professional / Technical Manager",
    "Service": "Amazon Elastic Compute Cloud (Amazon EC2)",
    "Service Detail": "Amazon Simple Storage Service (Amazon S3)",
    "Description": "In this introductory bootcamp, you learn about AWS products, services, and common solutions. You also get familiar with the fundamentals of identifying AWS services so you can make informed decisions about IT solutions based on your business requirements. Throughout the bootcamp, you gain information on how to build, compare, and apply highly available, fault tolerant, scalable, and cost-effective cloud solutions."
  },
  {
    "Position": "13",
    "Session Type": "Innovation Talks",
    "Topic": "Databases",
    "Industry": "Generative AI",
    "Area of Interest": "Generative AI",
    "Level": "200 – Intermediate",
    "Role": "IT Professional / Technical Manager",
    "Service": "IT Professional / Technical Manager",
    "Service Detail": "Amazon Aurora",
    "Description": "For almost two decades, hundreds of thousands of customers have trusted AWS databases as their cloud data foundation. Join Jeff Carter, Vice President of AWS Databases & Migration Services, as he shares AWS databases innovation to help customers modernize their applications so they can deliver generative AI–enabled experiences for their users. Learn how AWS databases are making it easier to integrate and manage your data, build highly available, resilient applications for your mission-critical workloads, and seamlessly take advantage of generative AI advancements."
  },
  {
    "Position": "14",
    "Session Type": "Gamified learning",
    "Topic": "AI/ML",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Generative AI",
    "Level": "100 – Foundational",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Service Detail": "",
    "Description": "Prepare for the AWS Certified AI Practitioner exam by playing a 3D virtual escape room game. Select an avatar, enter a narrative-driven world, and solve a series of interactive puzzles, exam-style questions, and hands-on labs to leave locked rooms. Compete against others to escape first! You must bring a laptop with a Chrome, Firefox, or Edge browser to participate. Headphones are recommended but optional."
  },
  {
    "Position": "15",
    "Session Type": "Gamified learning",
    "Topic": "Cloud Operations",
    "Industry": "Management & Governance",
    "Area of Interest": "Management & Governance",
    "Level": "300 – Advanced",
    "Role": "Solution / Systems Architect",
    "Service": "",
    "Service Detail": "",
    "Description": "Join us for an interactive and collaborative learning exercise to develop practical skills for keeping AWS environments up and running. Gain experience in a real AWS account with deployed infrastructure that needs your help. Use and build skills in monitoring, automation, observability, configuration management, and more. Whether you’re a seasoned cloud professional or just starting your journey, this cloud operations AWS GameDay is an opportunity to put your theoretical knowledge to the test and gain invaluable experience. This session features a quest from Dynatrace."
  },
  {
    "Position": "16",
    "Session Type": "Gamified learning",
    "Topic": "DevOps & Developer Productivity",
    "Industry": "Serverless Compute & Containers",
    "Area of Interest": "Event-Driven Architecture",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Solution / Systems Architect",
    "Service Detail": "",
    "Description": "Join us for an interactive and collaborative learning exercise to gain practical skills for working with code on AWS. Come blend the skills of developers and operations teams to fully harness the combined power of DevOps. Leverage and build skills in serverless applications, CI/CD pipelines, containers, infrastructure as code, and more. Whether you’re a seasoned cloud professional or just starting your journey, this developer experience AWS GameDay is an opportunity to put your theoretical knowledge to the test and gain invaluable experience. This session features a quest from New Relic."
  },
  {
    "Position": "17",
    "Session Type": "Gamified learning",
    "Topic": "AI/ML",
    "Industry": "Generative AI",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "",
    "Service Detail": "",
    "Description": "Join us for an interactive and collaborative learning exercise to gain practical skills for working with generative AI on AWS. Discover and build with the technology that’s sweeping the industry. Come leverage and build skills in prompt engineering and foundation model evaluation while connecting applications to LLMs, building with agents, and more. Whether you’re a seasoned cloud professional or just starting your journey, this generative AI AWS GameDay is an opportunity to put your theoretical knowledge to the test and gain invaluable experience. This session features a quest from Datadog."
  },
  {
    "Position": "18",
    "Session Type": "Gamified learning",
    "Topic": "Security, Compliance & Identity",
    "Industry": "Networking",
    "Area of Interest": "Application Security",
    "Level": "300 – Advanced",
    "Role": "Cloud Security Specialist",
    "Service": "System Administrator",
    "Service Detail": "",
    "Description": "Join us for an interactive and collaborative learning exercise to develop practical skills for connecting and protecting infrastructure in AWS environments. Gain experience in a real AWS account with deployed infrastructure that needs your help. Respond to real-world networking and security scenarios involving compromised credentials, asset uplifting to IPv6, data leaks, VPC connectivity issues, instance breaches, and more. Whether you’re a seasoned cloud professional or just starting your journey, this security and networking AWS GameDay is an opportunity to put your theoretical knowledge to the test and gain invaluable experience. This session features a quest from Lacework."
  },
  {
    "Position": "19",
    "Session Type": "Gamified learning",
    "Topic": "Migration & Modernization",
    "Industry": "Modernization",
    "Area of Interest": "Modernization",
    "Level": "300 – Advanced",
    "Role": "",
    "Service": "",
    "Service Detail": "",
    "Description": "Are you looking to enhance your AWS DevOps and modernization skills? Immerse yourself in AWS DevOps challenges and collaborate with fellow enthusiasts. Activities are structured to accommodate AWS users of all skill levels, and you'll have a chance to win SWAG and prizes. Ask questions of the subject matter expert leading the study session, and enhance your DevOps knowledge with guided exercises. All you need to bring is your desire to learn and a laptop."
  },
  {
    "Position": "20",
    "Session Type": "Gamified learning",
    "Topic": "Security, Compliance & Identity",
    "Industry": "Data Protection",
    "Area of Interest": "Data Protection",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "",
    "Service Detail": "",
    "Description": "Are you concerned about protecting sensitive data in the cloud? Are you ready to put your AWS security skills to the test and learn in a gamified, experiential, team-based competition? Join us for this Security Jam, and gain hands-on experience with AWS and AWS Partners services and offerings via simulated real-world scenarios. Activities are structured to accommodate AWS users of all skill levels, and you'll have a chance to win SWAG and prizes. Ask questions of the subject matter expert leading the study session, and enhance your security knowledge with guided exercises. All you need to bring is your desire to learn and a laptop."
  },
  {
    "Position": "21",
    "Session Type": "Community activities",
    "Topic": "100 – Foundational",
    "Industry": "",
    "Area of Interest": "",
    "Level": "100 – Foundational",
    "Role": "",
    "Service": "",
    "Service Detail": "",
    "Description": "Bring your workout gear and get ready to join the fun. Embrace the challenge alongside fellow attendees to cross the finish line of the annual re:Invent 5K run. Participants of all skill levels are welcome, and there is no fee to participate. The course begins and ends at the Michelob ULTRA Arena at Mandalay Bay and follows Frank Sinatra Drive. Visit the Community Events Desk to learn more and pick up your bib and packet."
  },
  {
    "Position": "22",
    "Session Type": "Community activities",
    "Topic": "",
    "Industry": "",
    "Area of Interest": "",
    "Level": "",
    "Role": "",
    "Service": "",
    "Service Detail": "",
    "Description": "The AWS Sports Forum is the ultimate destination to elevate your game. Join us and witness the future unfold. The AWS Sports Forum not only hosts activities from the NFL, NHL, and Formula 1 but also showcases relevant customer stories that appeal to a wide range of conference attendees including casual fans, fitness enthusiasts, and gamers."
  },
  {
    "Position": "23",
    "Session Type": "Bootcamp",
    "Topic": "Cloud Operations",
    "Industry": "Training & Certification",
    "Area of Interest": "Monitoring & Observability",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "Amazon CloudWatch",
    "Service Detail": "Amazon CloudWatch Events",
    "Description": "This bootcamp provides a deep dive into AWS observability services such as Amazon CloudWatch, AWS X-Ray, Amazon Managed Service for Prometheus, Amazon Managed Grafana, and AWS Distro for OpenTelemetry. Come gain hands-on experience with features, possibilities, and solutions offered by the AWS observability suite. This bootcamp covers creating custom dashboards, using feature experimentation, and using logging and monitoring for troubleshooting. By the end, you have the ability to champion the value of AWS observability services, even without prior AWS expertise."
  },
  {
    "Position": "24",
    "Session Type": "Builders' session",
    "Topic": "DevOps & Developer Productivity",
    "Industry": "Front-End Web & Mobile",
    "Area of Interest": "Front-End Web & Mobile",
    "Level": "300 – Advanced",
    "Role": "AWS Device Farm",
    "Service": "",
    "Service Detail": "",
    "Description": "Learn how to build applications for Android, iOS, and the web without the stress of maintaining different code bases. Use React Native libraries in AWS Amplify to create full-featured, cloud-powered applications. Learn how to add features such as authentication, API and data interactions, generative AI, and media/file storage. Also, test your application using AWS Device Farm. You must bring your laptop to participate."
  },
  {
    "Position": "25",
    "Session Type": "Community activities",
    "Topic": "100 – Foundational",
    "Industry": "",
    "Area of Interest": "",
    "Level": "100 – Foundational",
    "Role": "",
    "Service": "",
    "Service Detail": "",
    "Description": "Bingo Night returns to re:Invent! Join us for a fun night filled with bingo and prizes."
  },
  {
    "Position": "26",
    "Session Type": "Builders' session",
    "Topic": "AI/ML",
    "Industry": "Nonprofit",
    "Area of Interest": "Public Sector",
    "Level": "200 – Intermediate",
    "Role": "IT Professional / Technical Manager",
    "Service": "Solution / Systems Architect",
    "Service Detail": "Amazon Personalize",
    "Description": "Donor engagement and retention are critical objectives for nonprofit organizations. In this builders’ session, discover how AWS machine learning and generative AI services can help you implement targeted and personalized experiences across various digital channels and enhance the overall donor experience. Get the opportunity to choose from a variety of use cases, such as targeted email campaigns and donor profile management. Leave this session with hands-on experience using AWS AI services that can help you enhance campaign effectiveness, and ultimately, build a stronger connection with your donors. You must bring your laptop to participate."
  },
  {
    "Position": "27",
    "Session Type": "Spotlight labs",
    "Topic": "AI/ML",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Generative AI",
    "Level": "200 – Intermediate",
    "Role": "Data Engineer",
    "Service": "Amazon SageMaker",
    "Service Detail": "Amazon SageMaker",
    "Description": "In this Amazon SageMaker lab, learn how to build and run a machine learning model with no code using Amazon SageMaker Canvas. Use sample data to train models, compare their performance, and make predictions."
  },
  {
    "Position": "28",
    "Session Type": "Builders' session",
    "Topic": "AI/ML",
    "Industry": "Financial Services",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "Data Engineer",
    "Service": "Solution / Systems Architect",
    "Service Detail": "Amazon Bedrock",
    "Description": "Financial institutions manage complex, document-intensive workflows to perform financial analysis and reporting. In this session, build an assistant that enhances financial document processing and improves productivity using multimodal large language model (LLM) capabilities and a knowledge base built with Amazon Q. Also, learn how to use agents for Amazon Bedrock to create a single view for financial analysis on documents, structured content, and APIs. This approach can help you interact with these data sources, summarize financial statements, and generate prospectus documents including charts and data tables. You must bring your laptop to participate."
  },
  {
    "Position": "29",
    "Session Type": "Builders' session",
    "Topic": "AI/ML",
    "Industry": "Telecommunications",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon SageMaker",
    "Service Detail": "Amazon Lex",
    "Description": "This builders’ session showcases how generative AI services like Amazon Bedrock, Amazon SageMaker, and Amazon OpenSearch Service can revolutionize customer self-service and automated troubleshooting. Learn to build personalized customer journeys using real-time data, and explore constructing generative AI workflows using knowledge bases and machine learning (ML) algorithms to resolve issues autonomously. A live demo will highlight these AI-driven solutions’ potential for enhanced customer engagement, efficiency, and proactive issue resolution. You must bring your laptop to participate."
  },
  {
    "Position": "30",
    "Session Type": "Builders' session",
    "Topic": "AI/ML",
    "Industry": "Automotive",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "Generative AI",
    "Service": "Developer / Engineer",
    "Service Detail": "Solution / Systems Architect",
    "Description": "Learn how to build a generative AI assistant to analyze data from industrial IoT sensors, documents, manuals, and other manufacturing systems. Also learn how to provide natural language summaries of operation statuses and current issues with suggestion actions, and how to help operators, manufacturing engineers, and factory leaders conduct Q&A–based exploratory root cause analysis to increase overall plant productivity. You must bring your laptop to participate."
  },
  {
    "Position": "31",
    "Session Type": "Community activities",
    "Topic": "100 – Foundational",
    "Industry": "",
    "Area of Interest": "",
    "Level": "100 – Foundational",
    "Role": "",
    "Service": "",
    "Service Detail": "",
    "Description": "Join AWS in supporting local nonprofits in Las Vegas, Nevada, by participating in activities such as building dynamo lights or packing first aid kits at our Build and Give Back location in the Expo."
  },
  {
    "Position": "32",
    "Session Type": "Community activities",
    "Topic": "100 – Foundational",
    "Industry": "",
    "Area of Interest": "",
    "Level": "100 – Foundational",
    "Role": "",
    "Service": "",
    "Service Detail": "",
    "Description": "Join AWS in supporting local nonprofits in Las Vegas, Nevada, by participating in activities such as building dynamo lights or packing first aid kits at our Build and Give Back location in the Expo."
  },
  {
    "Position": "33",
    "Session Type": "Community activities",
    "Topic": "100 – Foundational",
    "Industry": "",
    "Area of Interest": "",
    "Level": "100 – Foundational",
    "Role": "",
    "Service": "",
    "Service Detail": "",
    "Description": "Join AWS in supporting local nonprofits in Las Vegas, Nevada, by participating in activities such as building dynamo lights or packing first aid kits at our Build and Give Back location in the Expo."
  },
  {
    "Position": "34",
    "Session Type": "Community activities",
    "Topic": "100 – Foundational",
    "Industry": "",
    "Area of Interest": "",
    "Level": "100 – Foundational",
    "Role": "",
    "Service": "",
    "Service Detail": "",
    "Description": "Join AWS in supporting local nonprofits in Las Vegas, Nevada, by participating in activities such as building dynamo lights or packing first aid kits at our Build and Give Back location in the Expo."
  },
  {
    "Position": "35",
    "Session Type": "Community activities",
    "Topic": "100 – Foundational",
    "Industry": "",
    "Area of Interest": "",
    "Level": "100 – Foundational",
    "Role": "",
    "Service": "",
    "Service Detail": "",
    "Description": "Join AWS in supporting local nonprofits in Las Vegas, Nevada, by participating in activities such as building dynamo lights or packing first aid kits at our Build and Give Back location in the Expo."
  },
  {
    "Position": "36",
    "Session Type": "Spotlight labs",
    "Topic": "Databases",
    "Industry": "Developer Community",
    "Area of Interest": "Developer Community",
    "Level": "200 – Intermediate",
    "Role": "Amazon Neptune",
    "Service": "",
    "Service Detail": "",
    "Description": "In this lab, learn how to model your source data from relational databases and document stores to Amazon Neptune in order to meet this business need. Use a sample customer order database to build a product recommendation system that is used to send real-time product recommendations to customers as they browse the products portal."
  },
  {
    "Position": "37",
    "Session Type": "Builders' session",
    "Topic": "AI/ML",
    "Industry": "Serverless Compute & Containers",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "Solution / Systems Architect",
    "Service Detail": "Amazon Bedrock",
    "Description": "In this hands-on builders' session, build a serverless, real-time chat experience with a virtual assistant. Dive deep into serverless, real-time APIs powered by AWS AppSync, AWS Lambda, and Amazon Bedrock. Explore how to leverage these APIs to build cutting-edge generative AI applications. Leave with practical skills for building scalable, cost-effective, real-time APIs that seamlessly integrate your generative AI models. Gain firsthand experience constructing an immersive chat experience enhanced by AI capabilities. You must bring your laptop to participate."
  },
  {
    "Position": "38",
    "Session Type": "Builders' session",
    "Topic": "AI/ML",
    "Industry": "Automotive",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "Edge Computing",
    "Service": "300 – Advanced",
    "Service Detail": "Developer / Engineer",
    "Description": "This hands-on builders’ session guides you through the process of connecting Siemens PLCs at scale, determining the exposed data, and generating an AWS IoT SiteWise hierarchy using generative AI with Amazon Bedrock. Learn how to take exposed data from a brownfield PLC; create an ISA-95-compliant asset hierarchy using AWS IoT SiteWise, AWS IoT Greengrass, and Amazon Bedrock; and build a dashboard displaying live data. This session offers a step-by-step, practical approach to mastering the skills needed to build a unified namespace and connecting a factory at scale. You must bring your laptop to participate."
  },
  {
    "Position": "39",
    "Session Type": "Builders' session",
    "Topic": "Architecture",
    "Industry": "Automotive",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Amazon Q",
    "Service Detail": "AWS IoT FleetWise",
    "Description": "In this interactive session, use AWS IoT FleetWise to ingest vehicle data and then use Amazon Q to build a conversational generative AI–powered assistant that helps analyze the data using natural language queries and responses. Ask questions about the data like “Which vehicles have a low battery charge?” or “What are average vehicle speeds in the morning versus evening?” Learn how you can use Amazon Q to explore advanced querying and analysis capabilities like filtering, aggregations, and anomaly detection, and discover how Amazon Q can help you fine-tune your data collection campaigns or maintenance schedules based on collected data. You must bring your laptop to participate."
  },
  {
    "Position": "40",
    "Session Type": "Builders' session",
    "Topic": "AI/ML",
    "Industry": "DevOps & Developer Productivity",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "AWS Amplify",
    "Service Detail": "",
    "Description": "Create powerful generative AI web applications using the TypeScript-based developer experience of AWS Amplify. In this hands-on builders’ session, build AI-driven features like intelligent search, summarization, content generation, and interactive AI assistants. Learn to integrate core application components, including data management and user authentication. By the end of the session, deploy your finished application to the cloud and gain practical experience developing and launching a full-stack AI application. You must bring your laptop to participate."
  },
  {
    "Position": "41",
    "Session Type": "Builders' session",
    "Topic": "Serverless Compute & Containers",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Application Integration",
    "Level": "200 – Intermediate",
    "Role": "IT Professional / Technical Manager",
    "Service": "AWS Step Functions",
    "Service Detail": "",
    "Description": "Accelerate your data processing journey in this hands-on AWS Step Functions workshop. Build orchestrated data processing, async processing, and distributed transaction use cases. Discover how to simplify managing and scaling distributed data processing, offload undifferentiated tasks, and overcome serverless parallelism challenges. Through real-world examples and best practices, gain skills to unlock new business value. Leave with a deeper understanding of how to use AWS Step Functions to build scalable, efficient, cost-effective data processing architectures. You must bring your laptop to participate."
  },
  {
    "Position": "42",
    "Session Type": "Spotlight labs",
    "Topic": "AI/ML",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "Data Engineer",
    "Service": "Developer / Engineer",
    "Service Detail": "Amazon Bedrock",
    "Description": "This Amazon Bedrock session teaches you how to use generative AI models for tasks like writing summaries, answering questions, and building chatbots. The session is based on real-world use cases and provides you with hands-on experience using API calls, software tools, and open source libraries. Discover how to use generative AI to improve your efficiency and build your own AI-powered applications."
  },
  {
    "Position": "43",
    "Session Type": "Bootcamp",
    "Topic": "Databases",
    "Industry": "Developer Community",
    "Area of Interest": "Developer Community",
    "Level": "200 – Intermediate",
    "Role": "Amazon DocumentDB (with MongoDB compatibility)",
    "Service": "AWS Lambda",
    "Service Detail": "",
    "Description": "Do you need to deliver applications with consistent, high performance and nearly unlimited throughput and storage? Learn to build modern applications using AWS purpose-built NoSQL databases. This bootcamp is for developers, architects, and database engineers who want to build applications that involve complex data characteristics and millisecond performance requirements from their databases. Learn about using AWS purpose-built databases to build a typical modern application with diverse access patterns and real-time scaling needs."
  },
  {
    "Position": "44",
    "Session Type": "Keynote",
    "Topic": "",
    "Industry": "",
    "Area of Interest": "",
    "Level": "",
    "Role": "",
    "Service": "",
    "Service Detail": "",
    "Description": "Join AWS CEO Matt Garman to hear how AWS is innovating across every aspect of the world’s leading cloud. He explores how we are reinventing foundational building blocks as well as developing brand new experiences, all to empower customers and partners with what they need to build a better future."
  },
  {
    "Position": "45",
    "Session Type": "Lightning talk",
    "Topic": "Business Applications",
    "Industry": "Government",
    "Area of Interest": "Customer Stories",
    "Level": "100 – Foundational",
    "Role": "IT Professional / Technical Manager",
    "Service": "100 – Foundational",
    "Service Detail": "Business Executive",
    "Description": "Nonprofits face a big challenge: increasing giving to drive more global impact. Bonterra, one of the world’s largest social good software companies, is going all in on AWS to help nonprofits get more for their missions. Join us as Bonterra shares their cloud journey—rapidly migrating from data centers to AWS, rearchitecting applications with cloud-native services, and sunsetting legacy tech debt. Hear how this decision—and adopting services like Amazon SES and Amazon Q—drive more impact across fundraising, grant management, and strategic philanthropy. The end result: a major step toward Bonterra’s mission to create $573 billion in new annual global impact by 2033."
  },
  {
    "Position": "46",
    "Session Type": "Builders' session",
    "Topic": "Kubernetes",
    "Industry": "DevOps & Developer Productivity",
    "Area of Interest": "Application Integration",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "Solution / Systems Architect",
    "Service Detail": "Amazon Elastic Container Registry (Amazon ECR)",
    "Description": "Learn how to build cloud-native Java applications based on best practices, and discover ways you can optimize for performance. In this builders’ session, gain hands-on experience building cloud-native Java applications with Amazon Corretto and Spring Boot. In addition, explore how to use Amazon Q Developer to simplify the creation of new Java functionality and increase development speed, and learn how to deploy Java applications on Amazon EKS. You must bring your laptop to participate."
  },
  {
    "Position": "47",
    "Session Type": "Community activities",
    "Topic": "100 – Foundational",
    "Industry": "",
    "Area of Interest": "",
    "Level": "100 – Foundational",
    "Role": "",
    "Service": "",
    "Service Detail": "",
    "Description": "Stop by the Community Events Desk to learn more about re:Invent events happening during the week! AWS re:Invent 5K run sign-up and packet pickup is available Sunday, Monday, and Tuesday."
  },
  {
    "Position": "48",
    "Session Type": "Community activities",
    "Topic": "100 – Foundational",
    "Industry": "",
    "Area of Interest": "",
    "Level": "100 – Foundational",
    "Role": "",
    "Service": "",
    "Service Detail": "",
    "Description": "Stop by the Community Events Desk to learn more about re:Invent events happening during the week! AWS re:Invent 5K run sign-up and packet pickup is available Sunday, Monday, and Tuesday."
  },
  {
    "Position": "49",
    "Session Type": "Community activities",
    "Topic": "100 – Foundational",
    "Industry": "",
    "Area of Interest": "",
    "Level": "100 – Foundational",
    "Role": "",
    "Service": "",
    "Service Detail": "",
    "Description": "Stop by the Community Events Desk to learn more about re:Invent events happening during the week! AWS re:Invent 5K run sign-up and packet pickup is available Sunday, Monday, and Tuesday."
  },
  {
    "Position": "50",
    "Session Type": "Community activities",
    "Topic": "100 – Foundational",
    "Industry": "",
    "Area of Interest": "",
    "Level": "100 – Foundational",
    "Role": "",
    "Service": "",
    "Service Detail": "",
    "Description": "Stop by the Community Events Desk to learn more about re:Invent events happening during the week! AWS re:Invent 5K run sign-up and packet pickup is available Sunday, Monday, and Tuesday."
  },
  {
    "Position": "51",
    "Session Type": "Community activities",
    "Topic": "100 – Foundational",
    "Industry": "",
    "Area of Interest": "",
    "Level": "100 – Foundational",
    "Role": "",
    "Service": "",
    "Service Detail": "",
    "Description": "Stop by the Community Events Desk to learn more about re:Invent events happening during the week! AWS re:Invent 5K run sign-up and packet pickup is available Sunday, Monday, and Tuesday."
  },
  {
    "Position": "52",
    "Session Type": "Bootcamp",
    "Topic": "Training & Certification",
    "Industry": "Management & Governance",
    "Area of Interest": "Management & Governance",
    "Level": "200 – Intermediate",
    "Role": "IT Professional / Technical Manager",
    "Service": "AWS Config",
    "Service Detail": "",
    "Description": "This hands-on bootcamp equips you with the ability to enable effective cloud compliance management. Learn how to centralize AWS Config data, create AWS CloudTrail Lake queries, deploy conformance packs, configure automatic remediation, and track infrastructure and application changes. Also explore how to enable AWS Config, create CloudTrail Lake event stores, and use advanced event selectors. Discover how to use AWS compliance capabilities so you can implement a robust cloud compliance strategy and accelerate customer opportunities within your organization."
  },
  {
    "Position": "53",
    "Session Type": "Builders' session",
    "Topic": "Cloud Operations",
    "Industry": "Management & Governance",
    "Area of Interest": "Management & Governance",
    "Level": "400 – Expert",
    "Role": "Solution / Systems Architect",
    "Service": "Amazon CloudWatch",
    "Service Detail": "",
    "Description": "Distributed tracing is a crucial observability technique for understanding complex, microservices-based applications on AWS. In this builders’ session, learn how to use Amazon CloudWatch to instrument your applications and collect tracing data, allowing you to identify performance bottlenecks, debug issues, and optimize your systems. Leave this session with the knowledge and skills to unlock the full potential of distributed tracing and enhance the observability of your AWS-based applications, driving better decision-making for your business. You must bring your laptop to participate."
  },
  {
    "Position": "54",
    "Session Type": "Builders' session",
    "Topic": "AI/ML",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "300 – Advanced",
    "Service": "Amazon Pinpoint",
    "Service Detail": "",
    "Description": "In this hands-on builders’ session, walk through how to use Amazon Pinpoint SMS with other AWS services to build scalable and interactive SMS programs. Start by building and sending order confirmations, requesting that end users reply back with specific responses. Then, explore how to handle unexpected end user responses. Learn how to route complex queries using natural language processing via AWS AI services to an Amazon Connect contact center (or to a system of your choice) to enable support via a contact agent to ensure a seamless and intuitive customer experience. You must bring your laptop to participate."
  },
  {
    "Position": "55",
    "Session Type": "Builders' session",
    "Topic": "AI/ML",
    "Industry": "Business Applications",
    "Area of Interest": "AWS Marketplace",
    "Level": "300 – Advanced",
    "Role": "",
    "Service": "Amazon SageMaker",
    "Service Detail": "",
    "Description": "In this builders’ session, gain hands-on experience using pretrained generative AI models from AWS Marketplace to create content for practical business use cases. Learn how you can use leading generative AI models while maintaining privacy. These third-party models from AWS Marketplace are deployed to Amazon SageMaker in your own AWS account, which ensures that the prompts, data, and model responses stay within the boundaries of your account and are not shared with model providers. This is important for business use cases where competitive or confidential information may be used with models. You must bring your laptop to participate."
  },
  {
    "Position": "56",
    "Session Type": "Builders' session",
    "Topic": "DevOps & Developer Productivity",
    "Industry": "Serverless Compute & Containers",
    "Area of Interest": "Lambda-Based Applications",
    "Level": "200 – Intermediate",
    "Role": "IT Professional / Technical Manager",
    "Service": "Amazon API Gateway",
    "Service Detail": "AWS Lambda",
    "Description": "In this builders’ session, learn how to design and provision complete APIs using infrastructure as code. Follow the OpenAPI specification for API design, leveraging extensions to interact with Amazon API Gateway. Configure features like caching, rate limiting, message transformation, payload validation, and API keys with usage plans for backend integration. Leave with practical skills for defining and deploying APIs as code adhering to the OpenAPI standard. You must bring your laptop to participate."
  },
  {
    "Position": "57",
    "Session Type": "Builders' session",
    "Topic": "AI/ML",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "IT Professional / Technical Manager",
    "Service Detail": "Amazon Q Developer",
    "Description": "In this builders’ session, gain hands-on experience using Amazon Q Developer to create secure code. Write unit tests, optimize code, and scan for vulnerabilities, and discover how Amazon Q Developer suggests remediations that help fix your code instantaneously. Also, learn how you can use Amazon Q Developer security scanning to outperform other publicly benchmarkable tools on detection across popular programming languages. You must bring your laptop to participate."
  },
  {
    "Position": "58",
    "Session Type": "Builders' session",
    "Topic": "Security, Compliance & Identity",
    "Industry": "Data Protection",
    "Area of Interest": "Data Protection",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Service Detail": "",
    "Description": "Build actual data perimeter policies in real time based on provided requirements. Test that your policies work with an assessment tool that evaluates if you’ve effectively completed the data perimeter requirement. Leave this builders’ session understanding the tools that are available for you to ensure that only trusted identities are accessing trusted resources from expected networks. You must bring your laptop to participate."
  },
  {
    "Position": "59",
    "Session Type": "Builders' session",
    "Topic": "Serverless Compute & Containers",
    "Industry": "Application Integration",
    "Area of Interest": "Application Integration",
    "Level": "200 – Intermediate",
    "Role": "IT Professional / Technical Manager",
    "Service": "Amazon EventBridge",
    "Service Detail": "",
    "Description": "Decoupling services is one of the largest advantages of adopting a modern event-driven architecture, which can improve development agility and operational resilience. In this builders’ session, see how different services or even different applications can respond in real time to changes in an Amazon DynamoDB table using Amazon EventBridge Pipes and event buses. Learn to reduce coupling by prioritizing configuration over code, serverless over provisioned services, and generic over service-specific communication. You must bring your laptop to participate."
  },
  {
    "Position": "60",
    "Session Type": "Builders' session",
    "Topic": "Internet of Things",
    "Industry": "Energy & Utilities",
    "Area of Interest": "Application Integration",
    "Level": "300 – Advanced",
    "Role": "Disaster Response & Recovery",
    "Service": "300 – Advanced",
    "Service Detail": "Advisor / Consultant",
    "Description": "In this builders’ session, learn the essential steps to integrate a LoRaWAN gateway with AWS IoT Core for LoRaWAN. Learn how to onboard your first LoRaWAN device effectively and set up an AWS Lambda function to decode the payload. Leave this session with the practical skills to manage LoRaWAN communications with AWS, enhancing your IoT projects. You must bring your laptop to participate."
  },
  {
    "Position": "61",
    "Session Type": "Spotlight labs",
    "Topic": "DevOps & Developer Productivity",
    "Industry": "Developer Community",
    "Area of Interest": "Developer Community",
    "Level": "200 – Intermediate",
    "Role": "AWS Cloud Development Kit (AWS CDK)",
    "Service": "",
    "Service Detail": "",
    "Description": "Attend this lab to learn how to deploy an existing containerized application. Create a pipeline to build and test the application. Then, add a deployment stage to the pipeline to automatically deploy code updates to test and production environments."
  },
  {
    "Position": "62",
    "Session Type": "Builders' session",
    "Topic": "AI/ML",
    "Industry": "Agriculture",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "Edge Computing",
    "Service": "Robotics",
    "Service Detail": "300 – Advanced",
    "Description": "In this builders’ session, learn how to deploy offline LLMs and a web portal as AWS IoT Greengrass components. Discover how to synchronize contextual data from private sources or Amazon S3 to build local knowledge bases. Explore Retrieval Augmented Generation (RAG) for more relevant, accurate, and customized responses, and learn how to integrate multimodal local agents for complex edge tasks. This approach unlocks LLM power at the edge, helping ensure data privacy, low latency, and tailored experiences by combining contextual knowledge with edge computing and multimodal agent capabilities. You must bring your laptop to participate."
  },
  {
    "Position": "63",
    "Session Type": "Builders' session",
    "Topic": "Migration & Modernization",
    "Industry": "Nonprofit",
    "Area of Interest": "Modernization",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "IT Professional / Technical Manager",
    "Service Detail": "Amazon Aurora",
    "Description": "We all have workloads we’re not proud of: they’re old, often brittle, but they keep the mission running. Nonprofits have limited time and resources, so how do they even begin to upgrade or replace a legacy workload? In this builders’ session, get hands-on to move a legacy mission-based application into a modern cloud-native architecture. Migrate a monolithic application into a microservice architecture, model and move data into Amazon DynamoDB, and work with a variety of other cloud-native services. Leave this session knowing how to modernize your legacy workloads with confidence. You must bring your laptop to participate."
  },
  {
    "Position": "64",
    "Session Type": "Builders' session",
    "Topic": "Cloud Operations",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Network & Infrastructure Security",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "Solution / Systems Architect",
    "Service Detail": "Amazon Route 53",
    "Description": "For organizations considering or migrating to AWS, designing the VPC network architecture is a foundational step to achieve efficient management, cost-effectiveness, and the best performance. In addition to AWS networking best practices, the use of VPC sharing allows small admin teams to centrally manage large-scale networks and free development teams from infrastructure setup tasks. In this builders’ session, learn how to build a multi-account shared VPC architecture, and discover how DNS, AD integration, and routing operate in the environment. You must bring your laptop to participate."
  },
  {
    "Position": "65",
    "Session Type": "Builders' session",
    "Topic": "Architecture",
    "Industry": "Telecommunications",
    "Area of Interest": "Disaster Response & Recovery",
    "Level": "300 – Advanced",
    "Role": "300 – Advanced",
    "Service": "Solution / Systems Architect",
    "Service Detail": "Amazon API Gateway",
    "Description": "In this builders’ session, you learn how to use Amazon EKS to implement elastic scaling strategies for 5G core network functions, ensuring high availability and resilience. Explore cold standby Amazon EKS clusters for efficient disaster recovery across Availability Zones. Rapidly provision standby environments to handle failures or sudden traffic spikes. Implement gradual, intelligent scaling using Karpenter, provisioning worker nodes based on real-time resource utilization. Optimize costs while meeting dynamic workload demands. Hands-on labs guide you through configuring cold standby, setting up Karpenter, and simulating recovery scenarios. Gain practical experience with resilient, cost-effective scaling tailored for mission-critical 5G deployments. You must bring your laptop to participate."
  },
  {
    "Position": "66",
    "Session Type": "Bootcamp",
    "Topic": "AI/ML",
    "Industry": "Training & Certification",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "Solution / Systems Architect",
    "Service Detail": "Amazon Bedrock",
    "Description": "In this hands-on bootcamp, you are guided through an intelligent document processing scenario and shown how to automate a paper-to-post invoice management process by integrating SAP with AWS artificial intelligence and machine learning (AI/ML) services natively using the AWS SDK for SAP ABAP. You also learn how you can build smart audit assistants using the Amazon Bedrock generative AI service to gain audit insights from invoices."
  },
  {
    "Position": "67",
    "Session Type": "Builders' session",
    "Topic": "Business Applications",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "Developer / Engineer",
    "Service Detail": "IT Professional / Technical Manager",
    "Description": "Attend this builders’ session to learn how to use video capabilities from Amazon Connect, integrated with generative AI for computer vision and Internet of Things (IoT), to implement an intelligent customer service response management solution. Experts guide you step-by-step through the process of integrating web video chat in Amazon Connect with AI-powered IoT cameras for real-time event detection and analysis. You then act as contact center agents, receiving AI-powered recommendations from Amazon Q in Amazon Connect based on live video feeds (enabling immediate service responses and accurate personnel dispatch) and experiencing the power of visual guidance in customer service response management. You must bring your laptop to participate."
  },
  {
    "Position": "68",
    "Session Type": "Builders' session",
    "Topic": "Cloud Operations",
    "Industry": "Cost Optimization",
    "Area of Interest": "Cost Optimization",
    "Level": "300 – Advanced",
    "Role": "System Administrator",
    "Service": "",
    "Service Detail": "",
    "Description": "AWS Cost Categories helps make cost allocation easier by mapping costs using billing dimensions like accounts and tags. In this builders’ session, get hands-on experience using AWS Cost Categories to create custom cost groupings, define category rules, and distribute shared costs. Dive deep into examples of advanced AWS Cost Categories implementations and explore best practices. Access to your AWS Organizations payer account is recommended for this session. You must bring your laptop to participate."
  },
  {
    "Position": "69",
    "Session Type": "Builders' session",
    "Topic": "AI/ML",
    "Industry": "Generative AI",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "",
    "Service": "",
    "Service Detail": "",
    "Description": "Generative AI promises transformative innovation, and as SMBs increasingly adopt generative AI applications, safeguarding these technologies with practical, cost-effective strategies is crucial. In this builders’ session, learn how to enhance your security posture by using defense in depth, and see an architecture with layered defenses across trust boundaries. Learn strategies to innovate while increasing resilience, build on the secure AWS infrastructure, and integrate AI/ML-specific security. Explore solutions like guardrails, observability, and responsible AI practices to ensure the safety and integrity of AI-powered solutions, harnessing generative AI while mitigating risks. You must bring your laptop to participate."
  },
  {
    "Position": "70",
    "Session Type": "Builders' session",
    "Topic": "Serverless Compute & Containers",
    "Industry": "Application Security",
    "Area of Interest": "Application Security",
    "Level": "300 – Advanced",
    "Role": "DevOps Engineer",
    "Service": "",
    "Service Detail": "",
    "Description": "Implement fine-grained, context-aware access control for your APIs in this hands-on builders’ session. Explore how to define granular, policy-based access controls using roles and attributes with the expressive, open source Cedar policy language. Integrate with Amazon Cognito user pools via the Amazon Cognito authorizer to enforce these fine-grained permissions in your APIs. Learn practical skills for enhancing API security through attribute-based access policies tailored to your application's unique requirements. You must bring your laptop to participate."
  },
  {
    "Position": "71",
    "Session Type": "Builders' session",
    "Topic": "Cloud Operations",
    "Industry": "Management & Governance",
    "Area of Interest": "Management & Governance",
    "Level": "300 – Advanced",
    "Role": "System Administrator",
    "Service": "Amazon Q Developer",
    "Service Detail": "",
    "Description": "In this builders’ session, discover how Amazon Q Developer, an AI coding assistant, can simplify the creation and maintenance of your AWS Systems Manager runbooks to improve your operational efficiency. Learn how to build your own runbooks by using Amazon Q to enhance code quality, readability, and maintainability. Find out how to generate high-quality documentation for your runbooks for clearer and more effective communication with your team and stakeholders. You must bring your laptop to participate."
  },
  {
    "Position": "72",
    "Session Type": "Builders' session",
    "Topic": "AI/ML",
    "Industry": "Healthcare & Life Sciences",
    "Area of Interest": "Generative AI",
    "Level": "200 – Intermediate",
    "Role": "Solution / Systems Architect",
    "Service": "",
    "Service Detail": "",
    "Description": "In this session, learn how to use AWS HealthScribe generative AI capabilities to build interactive healthcare applications that reduce clinician administrative burdens and improve patient experiences. You must bring your laptop to participate."
  },
  {
    "Position": "73",
    "Session Type": "Builders' session",
    "Topic": "AI/ML",
    "Industry": "Generative AI",
    "Area of Interest": "Generative AI",
    "Level": "400 – Expert",
    "Role": "",
    "Service": "",
    "Service Detail": "",
    "Description": "In this hands-on builders’ session, create an evaluation tool for Retrieval Augmented Generation (RAG) pipelines. While using Amazon Bedrock, LangChain, and Ragas (an open source RAG assessment framework), learn how to build an evaluation tool to grade your RAG pipeline across a variety of metrics to ensure it is providing correct answers while avoiding malicious or harmful responses. Leave this session with a customizable RAG evaluation tool to apply to your own RAG pipelines. You must bring your laptop to participate."
  },
  {
    "Position": "74",
    "Session Type": "Builders' session",
    "Topic": "AI/ML",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "Amazon Q Business",
    "Service Detail": "",
    "Description": "In this builders’ session, learn how to develop a comprehensive evaluation framework for the outputs generated by Amazon Q Business. Explore how this framework can help you measure key metrics like truthfulness and completeness, allowing you to quantitatively assess the performance of your generative AI applications. By leveraging your private enterprise data and subject matter experts, you can ensure that the outputs are not only accurate but also tailored to the specific requirements of your business. You must bring your laptop to participate."
  },
  {
    "Position": "75",
    "Session Type": "Exam Prep",
    "Topic": "AI/ML",
    "Industry": "Training & Certification",
    "Area of Interest": "Generative AI",
    "Level": "100 – Foundational",
    "Role": "IT Professional / Technical Manager",
    "Service": "",
    "Service Detail": "",
    "Description": "Prepare for the AWS Certified AI Practitioner exam with this 90-minute study session. Review questions from the official practice question set. Ask questions of the subject matter expert leading the study session. Continue preparing for your exam with confidence following the four-step plan on AWS Skill Builder."
  },
  {
    "Position": "76",
    "Session Type": "Exam Prep",
    "Topic": "Training & Certification",
    "Industry": "Data Protection",
    "Area of Interest": "Data Protection",
    "Level": "200 – Intermediate",
    "Role": "",
    "Service": "",
    "Service Detail": "",
    "Description": "Prepare for the AWS Certified Data Engineer – Associate exam with this 90-minute study session. Review questions from the official practice question set. Get your questions answered by the subject matter expert leading the study session. Continue preparing for your exam with confidence following the four-step plan on AWS Skill Builder."
  },
  {
    "Position": "77",
    "Session Type": "Exam Prep",
    "Topic": "AI/ML",
    "Industry": "Training & Certification",
    "Area of Interest": "Developer Community",
    "Level": "200 – Intermediate",
    "Role": "DevOps Engineer",
    "Service": "",
    "Service Detail": "",
    "Description": "Prepare for the AWS Certified Machine Learning Engineer – Associate exam with this 90-minute study session. Review questions from the official practice question set. Get your questions answered by the subject matter expert leading the study session. Continue preparing for your exam with confidence following the four-step plan on AWS Skill Builder."
  },
  {
    "Position": "78",
    "Session Type": "Exam Prep",
    "Topic": "Training & Certification",
    "Industry": "Well-Architected Framework",
    "Area of Interest": "Well-Architected Framework",
    "Level": "200 – Intermediate",
    "Role": "",
    "Service": "",
    "Service Detail": "",
    "Description": "Prepare for the AWS Certified Solutions Architect – Associate exam with this 90-minute study session. Review questions from the official practice question set. Get your questions answered by the subject matter expert leading the study session. Continue preparing for your exam with confidence following the four-step plan on AWS Skill Builder."
  },
  {
    "Position": "79",
    "Session Type": "Builders' session",
    "Topic": "AI/ML",
    "Industry": "Serverless Compute & Containers",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "Data Scientist",
    "Service": "Amazon Elastic Container Service (Amazon ECS)",
    "Service Detail": "AWS Fargate",
    "Description": "In this builders’ session, explore how to extend generative AI workloads using the capabilities of Amazon ECS with AWS Fargate and Retrieval Augmented Generation (RAG). Through real-world examples of RAG-powered workloads, delve into the considerations and best practices for building generative AI applications with serverless containers. Then, gain hands-on experience building one by yourself. You must bring your laptop to participate."
  },
  {
    "Position": "80",
    "Session Type": "Builders' session",
    "Topic": "AI/ML",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "Innovation & Transformation",
    "Service": "Amazon SageMaker",
    "Service Detail": "Data Scientist",
    "Description": "Large language models (LLMs) are pretrained on vast amounts of data and perform well across a variety of general-purpose tasks and benchmarks without further specialized training. In practice, however, it is common to improve the performance of a pretrained LLM by fine-tuning the model using a smaller task-specific or domain-specific dataset. In this builders’ session, learn how to use Amazon SageMaker to fine-tune a pretrained Hugging Face LLM using AWS Trainium, and then leverage the fine-tuned model for inference. You must bring your laptop to participate."
  },
  {
    "Position": "81",
    "Session Type": "Builders' session",
    "Topic": "AI/ML",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "Amazon SageMaker",
    "Service Detail": "",
    "Description": "In this builders’ session, get step-by-step implementation experience fine-tuning Llama 3 8B using the QLoRA strategy. Learn how you can fine-tune Llama 3 models at scale using the memory-efficient PyTorch Fully Sharded Data Parallel (FSDP2) library with access to built-in debugging and GPU utilization metrics. Use a custom deep learning container with Amazon SageMaker to run these large-scale training jobs on the Amazon EC2 G5 instance. Discover how you can bring your own choice of libraries, like torchtune, on Amazon SageMaker’s managed infrastructure of GPU resources. You must bring your laptop to participate."
  },
  {
    "Position": "82",
    "Session Type": "Spotlight labs",
    "Topic": "AI/ML",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "Data Engineer",
    "Service": "Developer / Engineer",
    "Service Detail": "Amazon QuickSight",
    "Description": "This Amazon QuickSight session teaches you how to use machine learning to forecast data and identify anomalies. Learn to create forecasts, customize narratives for insights, and detect anomalies with contribution analysis."
  },
  {
    "Position": "83",
    "Session Type": "Bootcamp",
    "Topic": "AI/ML",
    "Industry": "Training & Certification",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "Amazon SageMaker",
    "Service Detail": "Amazon SageMaker",
    "Description": "This bootcamp equips you with practical skills for using generative AI for public sector use cases. You gain hands-on experience in deploying your own generative AI models on AWS and building proofs of concept. Dive into key concepts like large language models (LLMs) and Stable Diffusion, and explore use cases such as LLM for education, fine-tuning an LLM on medical data, CT scan upscaling, and synthetic satellite data generation. You have the opportunity to deploy and fine-tune generative AI models to address specific challenges in the public sector."
  },
  {
    "Position": "84",
    "Session Type": "Bootcamp",
    "Topic": "AI/ML",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Generative AI",
    "Level": "200 – Intermediate",
    "Role": "IT Professional / Technical Manager",
    "Service": "IT Executive",
    "Service Detail": "IT Professional / Technical Manager",
    "Description": "This bootcamp equips business leaders with the knowledge to jump-start generative AI within their companies. Executives and business decision-makers can gain a solid understanding of generative AI’s capabilities and practical applications. They can also discover how AWS services and best practices can help them successfully implement generative AI in their organizations."
  },
  {
    "Position": "85",
    "Session Type": "Builders' session",
    "Topic": "DevOps & Developer Productivity",
    "Industry": "Serverless Compute & Containers",
    "Area of Interest": "Lambda-Based Applications",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Service": "AWS Lambda",
    "Service Detail": "",
    "Description": "Discover how serverless workloads can handle massive spikes in this interactive session on AWS Lambda scaling. Learn best practices for generating high throughput using load testing tools and how to analyze scaling behavior with Amazon CloudWatch metrics. Explore real-world use cases that cover potential pitfalls like cold starts, concurrency limits, and upstream bottlenecks. Learn a tested approach to validate Lambda scaling capacity, even at high throughput levels. Gain confidence knowing that your applications can scale on demand. You must bring your laptop to participate."
  },
  {
    "Position": "86",
    "Session Type": "Builders' session",
    "Topic": "AI/ML",
    "Industry": "Architecture",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "Solution / Systems Architect",
    "Service": "Amazon Q Developer",
    "Service Detail": "",
    "Description": "This builders’ session explores using generative AI to create and comprehend architecture diagrams, a critical aspect of software design and communication. Diagrams are often image data, custom formats of drawing programs, or text-based representations from diagram-as-code tools. Techniques are used from two different layers of the generative AI stack, Amazon Q Developer and foundational models on Amazon Bedrock. Chat-based workflows first understand and analyze existing diagrams, and then ask follow-up questions about best practices. New diagrams are created using diagram-as-code formats. Leave with practical strategies for harnessing generative AI in your software architecture workflows. You must bring your laptop to participate."
  },
  {
    "Position": "87",
    "Session Type": "Builders' session",
    "Topic": "AI/ML",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Edge Computing",
    "Level": "300 – Advanced",
    "Role": "Edge Computing",
    "Service": "Monitoring & Observability",
    "Service Detail": "300 – Advanced",
    "Description": "Gain critical insights for optimizing the performance of your web application with Amazon CloudFront logs using Amazon Bedrock. In this builders’ session, learn why analyzing and monitoring logs is essential for detecting anomalies, enhancing reliability, and improving site performance. Whether you’re an SRE focused on fine-tuning performance or a CTO ensuring a robust infrastructure, discover how AI-powered log analysis empowers proactive decision-making. Find out how to harness the power of Amazon CloudFront data for actionable intelligence and to drive your application’s success. You must bring your laptop to participate."
  },
  {
    "Position": "88",
    "Session Type": "Builders' session",
    "Topic": "Compute",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Sustainability",
    "Level": "300 – Advanced",
    "Role": "300 – Advanced",
    "Service": "Developer / Engineer",
    "Service Detail": "IT Administrator",
    "Description": "As organizations strive to reduce their carbon footprint and promote environmental sustainability, optimizing high performance computing (HPC) workloads in the cloud has become a critical priority. In this hands-on builders’ session, learn how to design and deploy HPC clusters on AWS that deliver both performance and sustainability. Work through the process of architecting an HPC cluster using the latest AWS services, with a strong focus on the AWS Well-Architected Framework sustainability pillar. Leave this session equipped to design and deploy sustainable HPC clusters on AWS that deliver both high performance and environmental responsibility. You must bring your laptop to participate."
  },
  {
    "Position": "89",
    "Session Type": "Community activities",
    "Topic": "100 – Foundational",
    "Industry": "",
    "Area of Interest": "",
    "Level": "100 – Foundational",
    "Role": "",
    "Service": "",
    "Service Detail": "",
    "Description": "This year, AWS is partnering with Fill it Forward to support charity: water at the Water Walk. Millions of people around the world are without access to clean and safe drinking water and must walk every day to collect water. Come get involved, raise awareness, and experience a simulation of this walk that so many make every single day for their water supply. Don’t forget to fill your water bottle to support Hydrate and Help. Grab a bottle from the SWAG Desk and stop by any Hydrate and Help station at re:Invent. Each time you refill your bottle and scan the QR code, you’re giving back while reducing waste from single-use cups and bottles."
  },
  {
    "Position": "90",
    "Session Type": "Community activities",
    "Topic": "100 – Foundational",
    "Industry": "",
    "Area of Interest": "",
    "Level": "100 – Foundational",
    "Role": "",
    "Service": "",
    "Service Detail": "",
    "Description": "This year, AWS is partnering with Fill it Forward to support charity: water at the Water Walk. Millions of people around the world are without access to clean and safe drinking water and must walk every day to collect water. Come get involved, raise awareness, and experience a simulation of this walk that so many make every single day for their water supply. Don’t forget to fill your water bottle to support Hydrate and Help. Grab a bottle from the SWAG Desk and stop by any Hydrate and Help station at re:Invent. Each time you refill your bottle and scan the QR code, you’re giving back while reducing waste from single-use cups and bottles."
  },
  {
    "Position": "91",
    "Session Type": "Community activities",
    "Topic": "100 – Foundational",
    "Industry": "",
    "Area of Interest": "",
    "Level": "100 – Foundational",
    "Role": "",
    "Service": "",
    "Service Detail": "",
    "Description": "This year, AWS is partnering with Fill it Forward to support charity: water at the Water Walk. Millions of people around the world are without access to clean and safe drinking water and must walk every day to collect water. Come get involved, raise awareness, and experience a simulation of this walk that so many make every single day for their water supply. Don’t forget to fill your water bottle to support Hydrate and Help. Grab a bottle from the SWAG Desk and stop by any Hydrate and Help station at re:Invent. Each time you refill your bottle and scan the QR code, you’re giving back while reducing waste from single-use cups and bottles."
  },
  {
    "Position": "92",
    "Session Type": "Community activities",
    "Topic": "100 – Foundational",
    "Industry": "",
    "Area of Interest": "",
    "Level": "100 – Foundational",
    "Role": "",
    "Service": "",
    "Service Detail": "",
    "Description": "This year, AWS is partnering with Fill it Forward to support charity: water at the Water Walk. Millions of people around the world are without access to clean and safe drinking water and must walk every day to collect water. Come get involved, raise awareness, and experience a simulation of this walk that so many make every single day for their water supply. Don’t forget to fill your water bottle to support Hydrate and Help. Grab a bottle from the SWAG Desk and stop by any Hydrate and Help station at re:Invent. Each time you refill your bottle and scan the QR code, you’re giving back while reducing waste from single-use cups and bottles."
  },
  {
    "Position": "93",
    "Session Type": "Community activities",
    "Topic": "100 – Foundational",
    "Industry": "",
    "Area of Interest": "",
    "Level": "100 – Foundational",
    "Role": "",
    "Service": "",
    "Service Detail": "",
    "Description": "This year, AWS is partnering with Fill it Forward to support charity: water at the Water Walk. Millions of people around the world are without access to clean and safe drinking water and must walk every day to collect water. Come get involved, raise awareness, and experience a simulation of this walk that so many make every single day for their water supply. Don’t forget to fill your water bottle to support Hydrate and Help. Grab a bottle from the SWAG Desk and stop by any Hydrate and Help station at re:Invent. Each time you refill your bottle and scan the QR code, you’re giving back while reducing waste from single-use cups and bottles."
  },
  {
    "Position": "94",
    "Session Type": "Builders' session",
    "Topic": "Architecture",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Resilience",
    "Level": "400 – Expert",
    "Role": "DevOps Engineer",
    "Service": "Amazon Bedrock",
    "Service Detail": "Amazon CloudWatch",
    "Description": "In the era of generative AI, applications require intelligent monitoring that can detect the subtlest anomalies. In this builders’ session, dive deep on how to use Amazon CloudWatch anomaly detection, powered by machine learning, to automatically identify abnormal patterns in metrics and logs across your applications and infrastructure. Explore best practices for configuring anomaly detection models, creating insightful visualizations to investigate anomalies, integrating with incident response workflows like AWS Systems Manager for automated remediation through response plans, and leveraging generative AI techniques to enhance anomaly triage and root cause analysis. Leave this session with experience on how to boost observability using cutting-edge AI/ML capabilities. You must bring your laptop to participate."
  },
  {
    "Position": "95",
    "Session Type": "Innovation Talks",
    "Topic": "AI/ML",
    "Industry": "Financial Services",
    "Area of Interest": "Generative AI",
    "Level": "200 – Intermediate",
    "Role": "200 – Intermediate",
    "Service": "IT Executive",
    "Service Detail": "Amazon Bedrock",
    "Description": "Running ultra-low-latency trading platforms in the cloud. Building digital banks from the ground up. Moving off mainframes to improve mission-critical payments applications. Generating customized product offers at scale. Financial institutions are pushing past longstanding limits to reinvent the industry on AWS. They are making customer service more personal, meaningful, and valuable. They are providing consumers and businesses with more timely access to capital. And they are helping investors, lenders, and insurers make more informed decisions. In this talk, hear from industry leaders about how they are harnessing new generative AI, ML, and analytics capabilities—and the global infrastructure that powers them—to convert big ideas into real-world applications."
  },
  {
    "Position": "96",
    "Session Type": "Builders' session",
    "Topic": "Architecture",
    "Industry": "Government",
    "Area of Interest": "Resilience",
    "Level": "200 – Intermediate",
    "Role": "",
    "Service": "",
    "Service Detail": "",
    "Description": "When designing your AWS GovCloud (US) architectures, you follow best practices and known design patterns. However, in the event of an outage, is your mission-critical architecture going to hold up like you think? Find out with AWS Resilience Hub and AWS Fault Injection Service. In this builders’ session, explore architectures that superficially appear well-architected and expose risks and deficiencies. Learn how to use AWS tools to uncover the components that will fail during an outage and discover how to rearchitect to fix these gaps. You must bring your laptop to participate."
  },
  {
    "Position": "97",
    "Session Type": "Builders' session",
    "Topic": "AI/ML",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Generative AI",
    "Level": "300 – Advanced",
    "Role": "Innovation & Transformation",
    "Service": "Amazon SageMaker",
    "Service Detail": "Data Scientist",
    "Description": "While large language models (LLMs) offer versatility, smaller language models (SLMs) provide resource efficiency, speed, and simplicity. This builders’ session explores task simplification and decomposition techniques to harness multiple specialized SLMs, surpassing a single large model’s accuracy at a fraction of the cost. Learn how to build a generative AI application by deploying SLMs from Amazon SageMaker JumpStart on AWS Inferentia. Understand model trade-offs and a mental model for selecting the right approach. Leave with a deep understanding of designing generative AI applications by orchestrating SLMs through agentic workflows for cost savings, accuracy, and performance. You must bring your laptop to participate."
  },
  {
    "Position": "98",
    "Session Type": "Builders' session",
    "Topic": "AI/ML",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Generative AI",
    "Level": "200 – Intermediate",
    "Role": "IT Professional / Technical Manager",
    "Service": "IT Professional / Technical Manager",
    "Service Detail": "Amazon Q Developer",
    "Description": "Experience the power of Amazon Q Developer, your AI-powered assistant for software development. In this session, explore how Amazon Q Developer can streamline your daily workflow on AWS. Stuck in the console? Open the Amazon Q Developer panel for instant assistance. Can't find your way through the documentation? Amazon Q Developer guides you effortlessly. Need help crafting CLI commands? Amazon Q Developer has you covered. Want assistance right in Slack or Microsoft Teams? Amazon Q Developer is by your side, helping you work smarter, faster, and more efficiently across your favorite tools. You must bring your laptop to participate."
  },
  {
    "Position": "99",
    "Session Type": "Builders' session",
    "Topic": "Compute",
    "Industry": "Cross-Industry Solutions",
    "Area of Interest": "Blockchain",
    "Level": "300 – Advanced",
    "Role": "300 – Advanced",
    "Service": "",
    "Service Detail": "",
    "Description": "Join this builders’ session on empowering blockchain innovation to learn how to deploy blockchain nodes effectively using AWS technology. Led by AWS solutions architects, the session highlights the AWS Blockchain Node Runners initiative, an open source project that simplifies the complexities of blockchain deployment on AWS. Gain insights into the development processes, and explore deployment strategies. This session is ideal for both blockchain enthusiasts and professionals seeking to enhance their deployment capabilities on AWS with a variety of blockchain protocols, such as Ethereum, Solana, Polygon, and more. You must bring your laptop to participate."
  },
  {
    "Position": "100",
    "Session Type": "Builders' session",
    "Topic": "Databases",
    "Industry": "Application Integration",
    "Area of Interest": "Application Integration",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Service": "",
    "Service Detail": "",
    "Description": "Using Valkey with your application tends to give quick performance wins using only a few strategically placed GETs and SETs. However, understanding all of Valkey’s data types and commands unlocks even more use cases and performance boosts. This builders’ session gives you an overview of the entire Valkey landscape of data types and their related commands, linking them to real-world use cases with hands-on exercises. Previous Valkey or Redis experience is helpful, but this session starts at the basics and moves quickly to touch on more advanced topics. You must bring your laptop to participate."
  }
]