[
  {
    "Position": "1",
    "Session Type": "Code talk",
    "Topic": "AI/ML",
    "Area of Interest": "Generative AI",
    "Technology": "Microsoft & .NET",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Role 2": "Solution / Systems Architect",
    "Service": "Amazon Q Developer",
    "Service 2": "",
    "Service 3": "",
    "Description": "With Amazon Q Developer, a generative AI-powered assistant, you can write, debug, test, optimize, secure, and upgrade your .NET code faster and more efficiently. In this code talk, learn how to set up Amazon Q Developer with multiple integrated development environments (IDEs) and use it to generate C# code to solve real-world problems. Learn how Amazon Q Developer explains undocumented code, scans for issues, and answers complex technical questions to help you deliver code faster. This talk also includes a discussion of the built-in privacy, security, and enterprise features of Amazon Q Developer."
  },
  {
    "Position": "2",
    "Session Type": "Code talk",
    "Topic": "Security, Compliance & Identity",
    "Area of Interest": "Generative AI",
    "Technology": "Microsoft & .NET",
    "Level": "300 – Advanced",
    "Role": "IT Administrator",
    "Role 2": "Solution / Systems Architect",
    "Service": "Amazon Bedrock",
    "Service 2": "",
    "Service 3": "",
    "Description": "Active Directory (AD) administration often involves repetitive tasks and time-consuming troubleshooting. Come discover the future of smarter, more efficient AD management, powered by the remarkable capabilities of generative AI. Learn how to use AI-driven agents for Amazon Bedrock to simplify employee onboarding, automate repetitive administration tasks, and provide root cause analysis with remediation recommendations in natural language for common AD issues like account lockouts and Kerberos problems. Watch live demos showcasing how these agents analyze log files, event logs, and diagnostic data to identify and resolve AD-related issues efficiently. It’s time to boost your AD management skills with AI."
  },
  {
    "Position": "3",
    "Session Type": "Code talk",
    "Topic": "AI/ML",
    "Area of Interest": "Generative AI",
    "Technology": "Cross-Industry Solutions",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Role 2": "Solution / Systems Architect",
    "Service": "Amazon Bedrock",
    "Service 2": "Amazon Transcribe",
    "Service 3": "AWS Step Functions",
    "Description": "In this code talk, see live coding of a serverless application for producing meeting summaries with generative AI. Learn how to orchestrate transcription using Amazon Transcribe and summarization with Amazon Bedrock, orchestrated with AWS Step Functions. Discover how to simplify and scale your application using event-driven techniques with Amazon EventBridge. Leave with practical skills for developing serverless generative AI solutions that streamline meeting insights through automated transcription and summarization powered by AI/ML services."
  },
  {
    "Position": "4",
    "Session Type": "Code talk",
    "Topic": "Analytics",
    "Area of Interest": "Generative AI",
    "Technology": "Microsoft & .NET",
    "Level": "400 – Expert",
    "Role": "Solution / Systems Architect",
    "Role 2": "Solution / Systems Architect",
    "Service": "Amazon Bedrock",
    "Service 2": "",
    "Service 3": "",
    "Description": "In this code talk, learn how to build a smart, semantic image search engine for a .NET application using Amazon Bedrock and Amazon OpenSearch Service. The implementation will include preprocessing and indexing images using Amazon Bedrock, storing and managing data with OpenSearch Service, and developing a .NET application for user interaction. Leave this talk knowing how to use these tools to make your own powerful image search engine."
  },
  {
    "Position": "5",
    "Session Type": "Code talk",
    "Topic": "DevOps & Developer Productivity",
    "Area of Interest": "Serverless Compute & Containers",
    "Technology": "Lambda-Based Applications",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Role 2": "DevOps Engineer",
    "Service": "AWS Lambda",
    "Service 2": "",
    "Service 3": "",
    "Description": "Explore the pragmatic considerations for building serverless applications in this code talk. Learn how many AWS Lambda functions should comprise a single API, and discover techniques for progressively improving your API event handlers. Understand the challenges, solutions, and trade-offs involved in creating modular, well-architected Lambda “monoliths” (Lambdaliths). Gain insights into using Powertools for Lambda to construct efficient monolithic and microservice Lambda function architectures. Leave with a clear approach for structuring your serverless APIs using the Lambdalith and other patterns."
  },
  {
    "Position": "6",
    "Session Type": "Code talk",
    "Topic": "AI/ML",
    "Area of Interest": "Generative AI",
    "Technology": "Cross-Industry Solutions",
    "Level": "400 – Expert",
    "Role": "Innovation & Transformation",
    "Role 2": "400 – Expert",
    "Service": "AWS Trainium",
    "Service 2": "",
    "Service 3": "",
    "Description": "Neuron empowers AI scientists and researchers to invent new model architectures, build the next generation of foundation models on AWS Trainium, and push the boundaries of generative AI research and open source innovation. In this code talk, learn how to use Neuron Kernel Interface to build innovative compute kernels that outperform existing techniques and build highly optimized kernels to maximize performance for the most critical or differentiated parts of your models. You must bring a laptop to participate."
  },
  {
    "Position": "7",
    "Session Type": "Code talk",
    "Topic": "AI/ML",
    "Area of Interest": "Generative AI",
    "Technology": "Microsoft & .NET",
    "Level": "300 – Advanced",
    "Role": "IT Professional / Technical Manager",
    "Role 2": "Solution / Systems Architect",
    "Service": "AWS SDK for .NET",
    "Service 2": "",
    "Service 3": "",
    "Description": "With AWS AI services, you can enrich your .NET applications with capabilities like natural language processing, translation, and image analysis. And with generative AI, you can add powerful capabilities like text summarization, content generation, and visual reasoning. In this demo-heavy coding session, explore when and how to use AWS AI services and generative AI services with AWS SDK for .NET. Learn how to build a sample intelligent document processing application with both AI and generative AI capabilities using a generative AI–powered assistant to help write the code."
  },
  {
    "Position": "8",
    "Session Type": "Code talk",
    "Topic": "Databases",
    "Area of Interest": "Open Source",
    "Technology": "400 – Expert",
    "Level": "400 – Expert",
    "Role": "IT Professional / Technical Manager",
    "Role 2": "Solution / Systems Architect",
    "Service": "Amazon Aurora",
    "Service 2": "",
    "Service 3": "",
    "Description": "Do you deal with PostgreSQL query performance–related issues? In this code talk, explore advanced techniques for monitoring query plans in Amazon Aurora PostgreSQL-Compatible Edition and maintaining query plan stability using Aurora query plan management. This talk features live coding scenarios and interactive discussions to identify and address query plan regression. Gain deep insights into tools and methods to tweak PostgreSQL execution plans to ensure optimal query performance and stability in your databases. Learn practical insights and troubleshoot common issues in real time. This talk is designed for attendees who are familiar with PostgreSQL and basic query optimization concepts."
  },
  {
    "Position": "9",
    "Session Type": "Code talk",
    "Topic": "AI/ML",
    "Area of Interest": "Security, Compliance & Identity",
    "Technology": "Cross-Industry Solutions",
    "Level": "400 – Expert",
    "Role": "IT Professional / Technical Manager",
    "Role 2": "Cloud Security Specialist",
    "Service": "Amazon Inspector",
    "Service 2": "",
    "Service 3": "",
    "Description": "Explore how to use generative AI to improve the security of your applications. Learn how AI-powered tools can help rapidly identify and then recommend remediations for security threats. Learn about how Amazon Inspector detects software and code vulnerabilities in your applications, and discover how to scan for issues and remediate them using generative AI in your IDE."
  },
  {
    "Position": "10",
    "Session Type": "Code talk",
    "Topic": "Databases",
    "Area of Interest": "Modernization",
    "Technology": "400 – Expert",
    "Level": "400 – Expert",
    "Role": "Solution / Systems Architect",
    "Role 2": "Solution / Systems Architect",
    "Service": "Amazon DynamoDB",
    "Service 2": "",
    "Service 3": "",
    "Description": "In this code talk, discover how to optimize the performance of interacting with Amazon DynamoDB using the AWS SDK for Java. See live coding scenarios on how to minimize the latency of your DynamoDB interactions and improve throughput, and learn best practices for configuring your AWS SDK client. Get answers to your questions along the way, and hear the reasons behind the coding decisions."
  },
  {
    "Position": "11",
    "Session Type": "Code talk",
    "Topic": "DevOps & Developer Productivity",
    "Area of Interest": "Serverless Compute & Containers",
    "Technology": "Application Integration",
    "Level": "300 – Advanced",
    "Role": "Developer / Engineer",
    "Role 2": "DevOps Engineer",
    "Service": "AWS Lambda",
    "Service 2": "",
    "Service 3": "AWS Step Functions",
    "Description": "What does it mean to be a serverless developer? What disciplines do you need to master to build cloud-native, serverless solutions today? In this code talk, walk through a day in the life of a serverless developer and explore the core principles, architecture patterns, frameworks, and tools you need to know to build your next-generation serverless application."
  },
  {
    "Position": "12",
    "Session Type": "Code talk",
    "Topic": "Serverless Compute & Containers",
    "Area of Interest": "Cross-Industry Solutions",
    "Technology": "Application Integration",
    "Level": "200 – Intermediate",
    "Role": "Solution / Systems Architect",
    "Role 2": "Solution / Systems Architect",
    "Service": "AWS Lambda",
    "Service 2": "",
    "Service 3": "AWS Step Functions",
    "Description": "In this code talk, learn how to accelerate your serverless development with AWS tools, including Amazon Q Developer, integrated into IDEs. Experience the benefits of local development, deployment with Terraform and AWS CDK, and testing methodologies for serverless workloads. See a live coding session on how to build a serverless solution using AWS Lambda, AWS Step Functions, and Amazon EventBridge, and discover tools and best practices that can enhance the developer experience. Leave this talk with practical skills for achieving fast feedback loops to iterate quickly, catch issues early, and deliver high-quality serverless software efficiently."
  },
  {
    "Position": "13",
    "Session Type": "Code talk",
    "Topic": "Databases",
    "Area of Interest": "Generative AI",
    "Technology": "Generative AI",
    "Level": "400 – Expert",
    "Role": "IT Professional / Technical Manager",
    "Role 2": "Solution / Systems Architect",
    "Service": "AWS Database Migration Service (AWS DMS)",
    "Service 2": "",
    "Service 3": "",
    "Description": "Does the thought of modernizing your application and database architecture fill you with concern? In this code talk, learn how to overcome common migration issues and concerns that arise during modernization projects. See live coding examples to learn how to use generative AI and the AWS DMS Schema Conversion feature to successfully modernize your database."
  },
  {
    "Position": "14",
    "Session Type": "Code talk",
    "Topic": "Databases",
    "Area of Interest": "Generative AI",
    "Technology": "Open Source",
    "Level": "400 – Expert",
    "Role": "IT Professional / Technical Manager",
    "Role 2": "Solution / Systems Architect",
    "Service": "Amazon Bedrock",
    "Service 2": "",
    "Service 3": "",
    "Description": "Do you want to build a generative AI application with Amazon Aurora but are unsure of how to get started? In this code talk, learn essential tools for creating your own generative AI applications, including LangChain and pgvector. See live coding firsthand and learn the code required to connect these tools together, including how to use Retrieval Augmented Generation (RAG) to enhance the answers of the generative AI application. Also learn how to use Amazon Aurora with pgvector to accelerate vector similarity search. Discover how to use fundamental building blocks to build your own generative AI applications with Aurora."
  },
  {
    "Position": "15",
    "Session Type": "Code talk",
    "Topic": "AI/ML",
    "Area of Interest": "Generative AI",
    "Technology": "Generative AI",
    "Level": "400 – Expert",
    "Role": "IT Professional / Technical Manager",
    "Role 2": "Solution / Systems Architect",
    "Service": "Amazon Bedrock",
    "Service 2": "",
    "Service 3": "",
    "Description": "Multimodal embeddings enable a wide range of video analysis capabilities, from content understanding and summarization to classification and recommendations. In this code talk, learn how to use smart sampling and video search, generating multimodal embeddings with Amazon Titan models in Amazon Bedrock and using vector search powered by Amazon MemoryDB. See live coding examples to discover how to build delightful video experiences for your customers."
  }
]